UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
/*
 * Copyright 2022 MindMotion Microelectronics Co., Ltd.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef __MM32F0163D_H__
#define __MM32F0163D_H__

/* -----------------------------------------------------------------------------
  -- Interrupt vector numbers
  ----------------------------------------------------------------------------- */

/*!
* @addtogroup Interrupt_vector_numbers Interrupt vector numbers

* @{
*/

/** Interrupt Number Definitions */

#define NUMBER_OF_INT_VECTORS 38                 /**< Number of interrupts in the Vector table */

typedef enum IRQ {
  Reset_IRQn                               = -15,                                    /*!< Reset*/
  NMI_IRQn                                 = -14,                                    /*!< Unmaskable interrupt RCC Clock security system (CSS) connected to NMI */
  Hardwarefault_IRQn                       = -13,                                    /*!< All types of faults*/
  SVCall_IRQn                              = -5,                                     /*!< System service call via SWI instruction*/
  PendSV_IRQn                              = -2,                                     /*!< Pending system service*/
  SysTick_IRQn                             = -1,                                     /*!< System tick timer*/
  WWDG_IWDG_IRQn                           = 0,                                      /*!< Window watchdog interrupt and independent watchdog interrupt connected to EXTI21*/
  PVD_IRQn                                 = 1,                                      /*!< Power voltage detection (PVD) connected to EXTI16*/
  RTC_BKP_IRQn                             = 2,                                      /*!< RTC global interrupt and RTC_ALARAM interrupt connected to EXTI17*/
  FLASH_IRQn                               = 3,                                      /*!< Flash global interrupt*/
  RCC_IRQn                                 = 4,                                      /*!< RCC global interrupt*/
  EXTI0_1_IRQn                             = 5,                                      /*!< EXTI line [1:0] interrupt*/
  EXTI3_2_IRQn                             = 6,                                      /*!< EXTI line [3:2] interrupt*/
  EXTI15_4_IRQn                            = 7,                                      /*!< EXTI line [15:4] interrupt*/
  HWDIV_IRQn                               = 8,                                      /*!< Hard_Divider interrupt*/
  DMA1_CH1_IRQn                            = 9,                                      /*!< DMA1 channel 1 global interrupt*/
  DMA1_CH3_CH2_IRQn                        = 10,                                     /*!< DMA1 channel [3:2] global interrupt*/
  DMA1_CH7_CH4_IRQn                        = 11,                                     /*!< DMA1 channel [7:4] global interrupt*/
  ADC_COMP_IRQn                            = 12,                                     /*!< ADC1 global interrupt and Comparator 4 interrupt connected to EXTI19 */
  TIM1_BRK_UP_TRG_COM_IRQn                 = 13,                                     /*!< TIM1 break, update, trigger, COM interrupt*/
  TIM1_CC_IRQn                             = 14,                                     /*!< TIM1 capture compare interrupt*/
  TIM2_IRQn                                = 15,                                     /*!< TIM2 global interrupt */
  TIM3_IRQn                                = 16,                                     /*!< TIM3 global interrupt*/
  LPUART_IRQn                              = 17,                                     /*!< LPUART global interrupt connected to EXTI22*/
  LPTIM_IRQn                               = 18,                                     /*!< LPTIMER global interrupt connected to EXTI23*/
  TIM14_IRQn                               = 19,                                     /*!< TIM14 global interrupt*/
  TIM16_IRQn                               = 21,                                     /*!< TIM16 global interrupt*/
  TIM17_IRQn                               = 22,                                     /*!< TIM17 global interrupt*/
  I2C1_IRQn                                = 23,                                     /*!< I2C1 global interrupt connected to EXTI24 and I2C1 global interrupt*/
  I3C1_IRQn                                = 24,                                     /*!< I3C1 global interrupt */
  SPI1_IRQn                                = 25,                                     /*!< SPI1 global interrupt*/
  SPI2_IRQn                                = 26,                                     /*!< SPI2 global interrupt*/
  UART1_IRQn                               = 27,                                     /*!< UART1 global interrupt connected to EXTI25 and UART1 global interrupt*/
  UART2_IRQn                               = 28,                                     /*!< UART2 global interrupt connected to EXTI26 and UART2 global interrupt*/
  UART3_4_IRQn                             = 29,                                     /*!< UART3 and UART4 global interrupt */
  FlexCAN_IRQn                             = 30,                                     /*!< FLexCAN global interrupt */
  USB_IRQn                                 = 31,                                     /*!< USB global interrupt and USB wake-up interrupt (EXTI18)*/
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */



/* -----------------------------------------------------------------------------
 -- Cortex m0 Core Configuration
  ----------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex m0 Core Configuration
 * @{
 */

/* ----------------------------------------------------------------------------
   -- Cortex M0 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M0 Core Configuration
 * @{
 */

#define __CM0_REV                 0x0000U   /* Core revision r0p0 */
#define __MPU_PRESENT             0U        /* no MPU present */
#define __VTOR_PRESENT            0U        /* no VTOR present */
#define __NVIC_PRIO_BITS          2U        /* Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0U        /* Set to 1 if different SysTick Config is used */

#include "core_cm0.h"                       /* Processor and core peripherals */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */
/*
** Start of section using anonymous unions
*/

