UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif
/* Define the base address of the large memory block mapping */

#define BOOT_BASE                   0x00000000u
#define FLASH_BASE_BASE             0x08000000u
#define ENCRYPTEDSPACE_BASE         0x1FFE1000u
#define SYSTEMMEMORY_BASE           0x1FFFF400u
#define OPTIONBYTES_BASE            0x1FFFF800u
#define SRAM_BASE                   0x20000000u
#define APB1_0_BASE                 0x40000000u
#define APB2_0_BASE                 0x40010000u
#define AHB1_0_BASE                 0x40020000u
#define AHB1_1_BASE                 0x40030000u
#define AHB1_2_BASE                 0x40100000u
#define AHB1_3_BASE                 0x48000000u
#define AHB1_4_BASE                 0x48010000u
#define AHB1_5_BASE                 0x48100000u
#define AHB2_0_BASE                 0x50000000u
#define AHB2_1_BASE                 0x50040000u
#define AHB2_2_BASE                 0x50100000u


/* Define the mapping base address of the peripheral module */
#define TIM2_BASE                   (APB1_0_BASE + 0x0000 )
#define TIM3_BASE                   (APB1_0_BASE + 0x0400 )
#define RTC_BKP_BASE                (APB1_0_BASE + 0x2800 )
#define WWDG_BASE                   (APB1_0_BASE + 0x2C00 )
#define IWDG_BASE                   (APB1_0_BASE + 0x3000 )
#define SPI2_BASE                   (APB1_0_BASE + 0x3800 )
#define UART2_BASE                  (APB1_0_BASE + 0x4400 )
#define UART3_BASE                  (APB1_0_BASE + 0x4800 )
#define UART4_BASE                  (APB1_0_BASE + 0x4C00 )
#define I2C1_BASE                   (APB1_0_BASE + 0x5400 )
#define CRS_BASE                    (APB1_0_BASE + 0x6C00 )
#define PWR_BASE                    (APB1_0_BASE + 0x7000 )
#define I3C1_BASE                   (APB1_0_BASE + 0xA000 )

#define FLEXCAN_BASE                (APB1_0_BASE + 0xC000 )
#define SYSCFG_BASE                 (APB2_0_BASE + 0x0000 )
#define EXTI_BASE                   (APB2_0_BASE + 0x0400 )
#define LPUART_BASE                 (APB2_0_BASE + 0x0800 )
#define ADC_BASE                    (APB2_0_BASE + 0x2400 )
#define LPTIM1_BASE                 (APB2_0_BASE + 0x2800 )
#define TIM1_BASE                   (APB2_0_BASE + 0x2C00 )
#define SPI1_BASE                   (APB2_0_BASE + 0x3000 )
#define DBGMCU_BASE                 (APB2_0_BASE + 0x3400 )
#define UART1_BASE                  (APB2_0_BASE + 0x3800 )
#define COMP_BASE                   (APB2_0_BASE + 0x3C00 )
#define TIM14_BASE                  (APB2_0_BASE + 0x4000 )
#define TIM16_BASE                  (APB2_0_BASE + 0x4400 )
#define TIM17_BASE                  (APB2_0_BASE + 0x4800 )

#define DMA_BASE                    (AHB1_0_BASE + 0x0000 )
#define RCC_BASE                    (AHB1_0_BASE + 0x1000 )
#define FLASH_BASE                  (AHB1_0_BASE + 0x2000 )
#define CRC_BASE                    (AHB1_0_BASE + 0x3000 )

#define HWDIV_BASE                  (AHB1_1_BASE + 0x0000 )

#define GPIOA_BASE                  (AHB1_3_BASE + 0x0000 )
#define GPIOB_BASE                  (AHB1_3_BASE + 0x0400 )
#define GPIOC_BASE                  (AHB1_3_BASE + 0x0800 )
#define GPIOD_BASE                  (AHB1_3_BASE + 0x0C00 )

#define USB_FS_BASE                 (AHB2_0_BASE + 0x0000 )


/*!
 * @addtogroup ADC_Peripheral_Access_Layer ADC Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * ADC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t ADDATA;                                                       ///< A/D Data Register                            offset: 0x00
    __IO uint32_t ADCFG;                                                        ///< A/D Configuration Register                   offset: 0x04
    __IO uint32_t ADCR;                                                         ///< A/D Control Register                         offset: 0x08
    __IO uint32_t ADCHS;                                                        ///< A/D Channel Selection Register               offset: 0x0C
    __IO uint32_t ADCMPR;                                                       ///< A/D Analog Watchdog Compare Register         offset: 0x10
    __IO uint32_t ADSTA;                                                        ///< A/D Status Register                          offset: 0x14
    __IO uint32_t ADDR[16];                                                     ///< A/D Channel Data Register                    offset: 0x18
    __IO uint32_t ADSTAEXT;                                                     ///< A/D Extended State Register                  offset: 0x58
    __IO uint32_t CHANY0;                                                       ///< A/D Any Channel Selection Register 0         offset: 0x5C
    __IO uint32_t CHANY1;                                                       ///< A/D Any Channel Selection Register 1         offset: 0x60
    __IO uint32_t ANYCFG;                                                       ///< A/D Any Channel Configuration Register       offset: 0x64
    __IO uint32_t ANYCR;                                                        ///< A/D Any Channel Control Register             offset: 0x68
    __IO uint32_t Reserved0[1];                                                 ///< Reserved
    __IO uint32_t SMPR1;                                                        ///< A/D Sample Configuration Register 1          offset: 0x70
    __IO uint32_t SMPR2;                                                        ///< A/D Sample Configuration Register 2          offset: 0x74
    __IO uint32_t Reserved1[1];                                                 ///< Reserved
    __IO uint32_t JOFR[4];                                                      ///< A/D Injected Channel Data Offset Register    offset: 0x7C
    __IO uint32_t JSQR;                                                         ///< A/D Injected Channel Sequence Register       offset: 0x8C
    __IO uint32_t JADDATA;                                                      ///< A/D Injected Data Register                   offset: 0x90
    __IO uint32_t Reserved2[7];                                                 ///< Reserved
    __IO uint32_t JDR[4];                                                       ///< A/D Injected Channel Data Register           offset: 0xB0
    __IO uint32_t Reserved3[12];                                                ///< Reserved
    __IO uint32_t LDATA;                                                        ///< A/D Last Conversion Data Register            offset: 0xF0
} ADC_Type;

