UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define ADC_ANYCR_JAUTO_SHIFT                   (5)
#define ADC_ANYCR_JAUTO_MASK                    (0x1U << ADC_ANYCR_JAUTO_SHIFT)
#define ADC_ANYCR_JAUTO(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_JAUTO_SHIFT)) & ADC_ANYCR_JAUTO_MASK)

#define ADC_ANYCR_JEOSIE_SHIFT                  (4)
#define ADC_ANYCR_JEOSIE_MASK                   (0x1U << ADC_ANYCR_JEOSIE_SHIFT)
#define ADC_ANYCR_JEOSIE(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_JEOSIE_SHIFT)) & ADC_ANYCR_JEOSIE_MASK)

#define ADC_ANYCR_JEOCIE_SHIFT                  (3)
#define ADC_ANYCR_JEOCIE_MASK                   (0x1U << ADC_ANYCR_JEOCIE_SHIFT)
#define ADC_ANYCR_JEOCIE(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_JEOCIE_SHIFT)) & ADC_ANYCR_JEOCIE_MASK)

#define ADC_ANYCR_JEOSMPIE_SHIFT                (2)
#define ADC_ANYCR_JEOSMPIE_MASK                 (0x1U << ADC_ANYCR_JEOSMPIE_SHIFT)
#define ADC_ANYCR_JEOSMPIE(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_JEOSMPIE_SHIFT)) & ADC_ANYCR_JEOSMPIE_MASK)

#define ADC_ANYCR_JCEN_SHIFT                    (1)
#define ADC_ANYCR_JCEN_MASK                     (0x1U << ADC_ANYCR_JCEN_SHIFT)
#define ADC_ANYCR_JCEN(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_JCEN_SHIFT)) & ADC_ANYCR_JCEN_MASK)

#define ADC_ANYCR_CHANYMDEN_SHIFT               (0)
#define ADC_ANYCR_CHANYMDEN_MASK                (0x1U << ADC_ANYCR_CHANYMDEN_SHIFT)
#define ADC_ANYCR_CHANYMDEN(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_CHANYMDEN_SHIFT)) & ADC_ANYCR_CHANYMDEN_MASK)

/*!
 * @brief ADC_SMPR1 Register Bit Definition
 */

#define ADC_SMPR1_SAMP7_SHIFT                   (28)
#define ADC_SMPR1_SAMP7_MASK                    (0xFU << ADC_SMPR1_SAMP7_SHIFT)
#define ADC_SMPR1_SAMP7(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP7_SHIFT)) & ADC_SMPR1_SAMP7_MASK)

#define ADC_SMPR1_SAMP6_SHIFT                   (24)
#define ADC_SMPR1_SAMP6_MASK                    (0xFU << ADC_SMPR1_SAMP6_SHIFT)
#define ADC_SMPR1_SAMP6(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP6_SHIFT)) & ADC_SMPR1_SAMP6_MASK)

#define ADC_SMPR1_SAMP5_SHIFT                   (20)
#define ADC_SMPR1_SAMP5_MASK                    (0xFU << ADC_SMPR1_SAMP5_SHIFT)
#define ADC_SMPR1_SAMP5(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP5_SHIFT)) & ADC_SMPR1_SAMP5_MASK)

#define ADC_SMPR1_SAMP4_SHIFT                   (16)
#define ADC_SMPR1_SAMP4_MASK                    (0xFU << ADC_SMPR1_SAMP4_SHIFT)
#define ADC_SMPR1_SAMP4(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP4_SHIFT)) & ADC_SMPR1_SAMP4_MASK)

#define ADC_SMPR1_SAMP3_SHIFT                   (12)
#define ADC_SMPR1_SAMP3_MASK                    (0xFU << ADC_SMPR1_SAMP3_SHIFT)
#define ADC_SMPR1_SAMP3(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP3_SHIFT)) & ADC_SMPR1_SAMP3_MASK)

#define ADC_SMPR1_SAMP2_SHIFT                   (8)
#define ADC_SMPR1_SAMP2_MASK                    (0xFU << ADC_SMPR1_SAMP2_SHIFT)
#define ADC_SMPR1_SAMP2(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP2_SHIFT)) & ADC_SMPR1_SAMP2_MASK)

#define ADC_SMPR1_SAMP1_SHIFT                   (4)
#define ADC_SMPR1_SAMP1_MASK                    (0xFU << ADC_SMPR1_SAMP1_SHIFT)
#define ADC_SMPR1_SAMP1(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP1_SHIFT)) & ADC_SMPR1_SAMP1_MASK)

#define ADC_SMPR1_SAMP0_SHIFT                   (0)
#define ADC_SMPR1_SAMP0_MASK                    (0xFU << ADC_SMPR1_SAMP0_SHIFT)
#define ADC_SMPR1_SAMP0(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP0_SHIFT)) & ADC_SMPR1_SAMP0_MASK)

/*!
 * @brief ADC_SMPR2 Register Bit Definition
 */

#define ADC_SMPR2_SAMP15_SHIFT                  (28)
#define ADC_SMPR2_SAMP15_MASK                   (0xFU << ADC_SMPR2_SAMP15_SHIFT)
#define ADC_SMPR2_SAMP15(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP15_SHIFT)) & ADC_SMPR2_SAMP15_MASK)

#define ADC_SMPR2_SAMP14_SHIFT                  (24)
#define ADC_SMPR2_SAMP14_MASK                   (0xFU << ADC_SMPR2_SAMP14_SHIFT)
#define ADC_SMPR2_SAMP14(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP14_SHIFT)) & ADC_SMPR2_SAMP14_MASK)

#define ADC_SMPR2_SAMP13_SHIFT                  (20)
#define ADC_SMPR2_SAMP13_MASK                   (0xFU << ADC_SMPR2_SAMP13_SHIFT)
#define ADC_SMPR2_SAMP13(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP13_SHIFT)) & ADC_SMPR2_SAMP13_MASK)

#define ADC_SMPR2_SAMP12_SHIFT                  (16)
#define ADC_SMPR2_SAMP12_MASK                   (0xFU << ADC_SMPR2_SAMP12_SHIFT)
#define ADC_SMPR2_SAMP12(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP12_SHIFT)) & ADC_SMPR2_SAMP12_MASK)

#define ADC_SMPR2_SAMP11_SHIFT                  (12)
#define ADC_SMPR2_SAMP11_MASK                   (0xFU << ADC_SMPR2_SAMP11_SHIFT)
#define ADC_SMPR2_SAMP11(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP11_SHIFT)) & ADC_SMPR2_SAMP11_MASK)

#define ADC_SMPR2_SAMP10_SHIFT                  (8)
#define ADC_SMPR2_SAMP10_MASK                   (0xFU << ADC_SMPR2_SAMP10_SHIFT)
#define ADC_SMPR2_SAMP10(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP10_SHIFT)) & ADC_SMPR2_SAMP10_MASK)

#define ADC_SMPR2_SAMP9_SHIFT                   (4)
#define ADC_SMPR2_SAMP9_MASK                    (0xFU << ADC_SMPR2_SAMP9_SHIFT)
#define ADC_SMPR2_SAMP9(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP9_SHIFT)) & ADC_SMPR2_SAMP9_MASK)

#define ADC_SMPR2_SAMP8_SHIFT                   (0)
#define ADC_SMPR2_SAMP8_MASK                    (0xFU << ADC_SMPR2_SAMP8_SHIFT)
#define ADC_SMPR2_SAMP8(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP8_SHIFT)) & ADC_SMPR2_SAMP8_MASK)

/*!
 * @brief ADC_JOFR Register Bit Definition
 */

#define ADC_JOFR_JOFFSET_SHIFT                  (0)
#define ADC_JOFR_JOFFSET_MASK                   (0xFFFU << ADC_JOFR_JOFFSET_SHIFT)
#define ADC_JOFR_JOFFSET(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_JOFR_JOFFSET_SHIFT)) & ADC_JOFR_JOFFSET_MASK)

/*!
 * @brief ADC_JSQR Register Bit Definition
 */

#define ADC_JSQR_JNUM_SHIFT                     (20)
#define ADC_JSQR_JNUM_MASK                      (0x3U << ADC_JSQR_JNUM_SHIFT)
#define ADC_JSQR_JNUM(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JSQR_JNUM_SHIFT)) & ADC_JSQR_JNUM_MASK)

#define ADC_JSQR_JSQ3_SHIFT                     (15)
#define ADC_JSQR_JSQ3_MASK                      (0x1FU << ADC_JSQR_JSQ3_SHIFT)
#define ADC_JSQR_JSQ3(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JSQR_JSQ3_SHIFT)) & ADC_JSQR_JSQ3_MASK)

