UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define COMP_POLL_POUT_SHIFT                    (8)
#define COMP_POLL_POUT_MASK                     (0x7U << COMP_POLL_POUT_SHIFT)
#define COMP_POLL_POUT(x)                       (((uint32_t)(((uint32_t)(x)) << COMP_POLL_POUT_SHIFT)) & COMP_POLL_POUT_MASK)

#define COMP_POLL_PERIOD_SHIFT                  (4)
#define COMP_POLL_PERIOD_MASK                   (0x7U << COMP_POLL_PERIOD_SHIFT)
#define COMP_POLL_PERIOD(x)                     (((uint32_t)(((uint32_t)(x)) << COMP_POLL_PERIOD_SHIFT)) & COMP_POLL_PERIOD_MASK)

#define COMP_POLL_FIXN_SHIFT                    (2)
#define COMP_POLL_FIXN_MASK                     (0x1U << COMP_POLL_FIXN_SHIFT)
#define COMP_POLL_FIXN(x)                       (((uint32_t)(((uint32_t)(x)) << COMP_POLL_FIXN_SHIFT)) & COMP_POLL_FIXN_MASK)

#define COMP_POLL_POLLCH_SHIFT                  (1)
#define COMP_POLL_POLLCH_MASK                   (0x1U << COMP_POLL_POLLCH_SHIFT)
#define COMP_POLL_POLLCH(x)                     (((uint32_t)(((uint32_t)(x)) << COMP_POLL_POLLCH_SHIFT)) & COMP_POLL_POLLCH_MASK)

#define COMP_POLL_POLLEN_SHIFT                  (0)
#define COMP_POLL_POLLEN_MASK                   (0x1U << COMP_POLL_POLLEN_SHIFT)
#define COMP_POLL_POLLEN(x)                     (((uint32_t)(((uint32_t)(x)) << COMP_POLL_POLLEN_SHIFT)) & COMP_POLL_POLLEN_MASK)

/*!
 * @}
 */ /* end of group COMP_Register_Masks */
/******************************************************************************
 *COMP Instance
*******************************************************************************/

#define COMP                 ((COMP_Type*)COMP_BASE)

/*!
 * @}
 */ /* end of group COMP_Peripheral_Access_Layer */



/*!
 * @addtogroup CRC_Peripheral_Access_Layer CRC Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * CRC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t DR;                                                           ///< CRC Data Register                            offset: 0x00
    __IO uint32_t IDR;                                                          ///< CRC Independent Data Register                offset: 0x04
    __IO uint32_t CR;                                                           ///< CRC Control Register                         offset: 0x08
    __IO uint32_t MIR;                                                          ///< CRC Middle Data Register                     offset: 0x0C
} CRC_Type;

/*******************************************************************************
 * CRC Type
 ******************************************************************************/

/*!
 * @addtogroup CRC_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief CRC_DR Register Bit Definition
 */

#define CRC_DR_DR_SHIFT                         (0)
#define CRC_DR_DR_MASK                          (0xFFFFFFFFU << CRC_DR_DR_SHIFT)
#define CRC_DR_DR(x)                            (((uint32_t)(((uint32_t)(x)) << CRC_DR_DR_SHIFT)) & CRC_DR_DR_MASK)

/*!
 * @brief CRC_IDR Register Bit Definition
 */

#define CRC_IDR_IDR_SHIFT                       (0)
#define CRC_IDR_IDR_MASK                        (0xFFU << CRC_IDR_IDR_SHIFT)
#define CRC_IDR_IDR(x)                          (((uint32_t)(((uint32_t)(x)) << CRC_IDR_IDR_SHIFT)) & CRC_IDR_IDR_MASK)

/*!
 * @brief CRC_CR Register Bit Definition
 */

#define CRC_CR_OES_SHIFT                        (5)
#define CRC_CR_OES_MASK                         (0x1U << CRC_CR_OES_SHIFT)
#define CRC_CR_OES(x)                           (((uint32_t)(((uint32_t)(x)) << CRC_CR_OES_SHIFT)) & CRC_CR_OES_MASK)

#define CRC_CR_IES_SHIFT                        (4)
#define CRC_CR_IES_MASK                         (0x1U << CRC_CR_IES_SHIFT)
#define CRC_CR_IES(x)                           (((uint32_t)(((uint32_t)(x)) << CRC_CR_IES_SHIFT)) & CRC_CR_IES_MASK)

#define CRC_CR_ISIZE_SHIFT                      (2)
#define CRC_CR_ISIZE_MASK                       (0x3U << CRC_CR_ISIZE_SHIFT)
#define CRC_CR_ISIZE(x)                         (((uint32_t)(((uint32_t)(x)) << CRC_CR_ISIZE_SHIFT)) & CRC_CR_ISIZE_MASK)

#define CRC_CR_AS_SHIFT                         (1)
#define CRC_CR_AS_MASK                          (0x1U << CRC_CR_AS_SHIFT)
#define CRC_CR_AS(x)                            (((uint32_t)(((uint32_t)(x)) << CRC_CR_AS_SHIFT)) & CRC_CR_AS_MASK)

#define CRC_CR_RST_SHIFT                        (0)
#define CRC_CR_RST_MASK                         (0x1U << CRC_CR_RST_SHIFT)
#define CRC_CR_RST(x)                           (((uint32_t)(((uint32_t)(x)) << CRC_CR_RST_SHIFT)) & CRC_CR_RST_MASK)

/*!
 * @brief CRC_MIR Register Bit Definition
 */

#define CRC_MIR_MIR_SHIFT                       (0)
#define CRC_MIR_MIR_MASK                        (0xFFFFFFFFU << CRC_MIR_MIR_SHIFT)
#define CRC_MIR_MIR(x)                          (((uint32_t)(((uint32_t)(x)) << CRC_MIR_MIR_SHIFT)) & CRC_MIR_MIR_MASK)

/*!
 * @}
 */ /* end of group CRC_Register_Masks */
/******************************************************************************
 *CRC Instance
*******************************************************************************/

#define CRC                  ((CRC_Type*)CRC_BASE)

/*!
 * @}
 */ /* end of group CRC_Peripheral_Access_Layer */


/*!
 * @addtogroup CRS_Peripheral_Access_Layer CRS Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * CRS Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                           ///< CRS control register                         offset: 0x00
    __IO uint32_t CFGR;                                                         ///< CRS configuration register                   offset: 0x04
    __IO uint32_t ISR;                                                          ///< CRS interrupt status register                offset: 0x08
    __IO uint32_t ICR;                                                          ///< CRS interrupt flag clear register            offset: 0x0C
} CRS_Type;

