UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define CRS_ICR_ESYNCC_SHIFT                    (3)
#define CRS_ICR_ESYNCC_MASK                     (0x1U << CRS_ICR_ESYNCC_SHIFT)
#define CRS_ICR_ESYNCC(x)                       (((uint32_t)(((uint32_t)(x)) << CRS_ICR_ESYNCC_SHIFT)) & CRS_ICR_ESYNCC_MASK)

#define CRS_ICR_ERRC_SHIFT                      (2)
#define CRS_ICR_ERRC_MASK                       (0x1U << CRS_ICR_ERRC_SHIFT)
#define CRS_ICR_ERRC(x)                         (((uint32_t)(((uint32_t)(x)) << CRS_ICR_ERRC_SHIFT)) & CRS_ICR_ERRC_MASK)

#define CRS_ICR_SYNCWARNC_SHIFT                 (1)
#define CRS_ICR_SYNCWARNC_MASK                  (0x1U << CRS_ICR_SYNCWARNC_SHIFT)
#define CRS_ICR_SYNCWARNC(x)                    (((uint32_t)(((uint32_t)(x)) << CRS_ICR_SYNCWARNC_SHIFT)) & CRS_ICR_SYNCWARNC_MASK)

#define CRS_ICR_SYNCOKC_SHIFT                   (0)
#define CRS_ICR_SYNCOKC_MASK                    (0x1U << CRS_ICR_SYNCOKC_SHIFT)
#define CRS_ICR_SYNCOKC(x)                      (((uint32_t)(((uint32_t)(x)) << CRS_ICR_SYNCOKC_SHIFT)) & CRS_ICR_SYNCOKC_MASK)

/*!
 * @}
 */ /* end of group CRS_Register_Masks */
/******************************************************************************
 *CRS Instance
*******************************************************************************/

#define CRS                  ((CRS_Type*)CRS_BASE)

/*!
 * @}
 */ /* end of group CRS_Peripheral_Access_Layer */

/*!
 * @addtogroup DBGMCU_Peripheral_Access_Layer DBGMCU Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * DBGMCU Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t IDCODE;                                                       ///< DBG ID code register                         offset: 0x00
    __IO uint32_t CR;                                                           ///< DBG control register                         offset: 0x04
} DBGMCU_Type;

/*******************************************************************************
 * DBGMCU Type
 ******************************************************************************/

/*!
 * @addtogroup DBGMCU_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief DBGMCU_IDCODE Register Bit Definition
 */

#define DBGMCU_IDCODE_DEVID_SHIFT               (0)
#define DBGMCU_IDCODE_DEVID_MASK                (0xFFFFFFFFU << DBGMCU_IDCODE_DEVID_SHIFT)
#define DBGMCU_IDCODE_DEVID(x)                  (((uint32_t)(((uint32_t)(x)) << DBGMCU_IDCODE_DEVID_SHIFT)) & DBGMCU_IDCODE_DEVID_MASK)

/*!
 * @brief DBGMCU_CR Register Bit Definition
 */

#define DBGMCU_CR_IPGDEBUG_SHIFT                (24)
#define DBGMCU_CR_IPGDEBUG_MASK                 (0x1U << DBGMCU_CR_IPGDEBUG_SHIFT)
#define DBGMCU_CR_IPGDEBUG(x)                   (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_IPGDEBUG_SHIFT)) & DBGMCU_CR_IPGDEBUG_MASK)

#define DBGMCU_CR_IPSTESTACCESS_SHIFT           (22)
#define DBGMCU_CR_IPSTESTACCESS_MASK            (0x1U << DBGMCU_CR_IPSTESTACCESS_SHIFT)
#define DBGMCU_CR_IPSTESTACCESS(x)              (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_IPSTESTACCESS_SHIFT)) & DBGMCU_CR_IPSTESTACCESS_MASK)

#define DBGMCU_CR_IPSSUPERVISORACCESS_SHIFT     (21)
#define DBGMCU_CR_IPSSUPERVISORACCESS_MASK      (0x1U << DBGMCU_CR_IPSSUPERVISORACCESS_SHIFT)
#define DBGMCU_CR_IPSSUPERVISORACCESS(x)        (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_IPSSUPERVISORACCESS_SHIFT)) & DBGMCU_CR_IPSSUPERVISORACCESS_MASK)

#define DBGMCU_CR_DBGTIM14STOP_SHIFT            (18)
#define DBGMCU_CR_DBGTIM14STOP_MASK             (0x1U << DBGMCU_CR_DBGTIM14STOP_SHIFT)
#define DBGMCU_CR_DBGTIM14STOP(x)               (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM14STOP_SHIFT)) & DBGMCU_CR_DBGTIM14STOP_MASK)

#define DBGMCU_CR_DBGTIM17STOP_SHIFT            (17)
#define DBGMCU_CR_DBGTIM17STOP_MASK             (0x1U << DBGMCU_CR_DBGTIM17STOP_SHIFT)
#define DBGMCU_CR_DBGTIM17STOP(x)               (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM17STOP_SHIFT)) & DBGMCU_CR_DBGTIM17STOP_MASK)

#define DBGMCU_CR_DBGTIM16STOP_SHIFT            (16)
#define DBGMCU_CR_DBGTIM16STOP_MASK             (0x1U << DBGMCU_CR_DBGTIM16STOP_SHIFT)
#define DBGMCU_CR_DBGTIM16STOP(x)               (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM16STOP_SHIFT)) & DBGMCU_CR_DBGTIM16STOP_MASK)

#define DBGMCU_CR_DBGTIM3STOP_SHIFT             (12)
#define DBGMCU_CR_DBGTIM3STOP_MASK              (0x1U << DBGMCU_CR_DBGTIM3STOP_SHIFT)
#define DBGMCU_CR_DBGTIM3STOP(x)                (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM3STOP_SHIFT)) & DBGMCU_CR_DBGTIM3STOP_MASK)

#define DBGMCU_CR_DBGTIM2STOP_SHIFT             (11)
#define DBGMCU_CR_DBGTIM2STOP_MASK              (0x1U << DBGMCU_CR_DBGTIM2STOP_SHIFT)
#define DBGMCU_CR_DBGTIM2STOP(x)                (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM2STOP_SHIFT)) & DBGMCU_CR_DBGTIM2STOP_MASK)

#define DBGMCU_CR_DBGTIM1STOP_SHIFT             (10)
#define DBGMCU_CR_DBGTIM1STOP_MASK              (0x1U << DBGMCU_CR_DBGTIM1STOP_SHIFT)
#define DBGMCU_CR_DBGTIM1STOP(x)                (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM1STOP_SHIFT)) & DBGMCU_CR_DBGTIM1STOP_MASK)

#define DBGMCU_CR_DBGWWDGSTOP_SHIFT             (9)
#define DBGMCU_CR_DBGWWDGSTOP_MASK              (0x1U << DBGMCU_CR_DBGWWDGSTOP_SHIFT)
#define DBGMCU_CR_DBGWWDGSTOP(x)                (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGWWDGSTOP_SHIFT)) & DBGMCU_CR_DBGWWDGSTOP_MASK)

#define DBGMCU_CR_DBGIWDGSTOP_SHIFT             (8)
#define DBGMCU_CR_DBGIWDGSTOP_MASK              (0x1U << DBGMCU_CR_DBGIWDGSTOP_SHIFT)
#define DBGMCU_CR_DBGIWDGSTOP(x)                (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGIWDGSTOP_SHIFT)) & DBGMCU_CR_DBGIWDGSTOP_MASK)

#define DBGMCU_CR_DBGSTOPFORLDO_SHIFT           (3)
#define DBGMCU_CR_DBGSTOPFORLDO_MASK            (0x1U << DBGMCU_CR_DBGSTOPFORLDO_SHIFT)
#define DBGMCU_CR_DBGSTOPFORLDO(x)              (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGSTOPFORLDO_SHIFT)) & DBGMCU_CR_DBGSTOPFORLDO_MASK)

#define DBGMCU_CR_DBGSTANDBY_SHIFT              (2)
#define DBGMCU_CR_DBGSTANDBY_MASK               (0x1U << DBGMCU_CR_DBGSTANDBY_SHIFT)
#define DBGMCU_CR_DBGSTANDBY(x)                 (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGSTANDBY_SHIFT)) & DBGMCU_CR_DBGSTANDBY_MASK)

