UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define FLASH                ((FLASH_Type*)FLASH_BASE)

/*!
 * @}
 */ /* end of group FLASH_Peripheral_Access_Layer */



/*!
 * @addtogroup FLEXCAN_Peripheral_Access_Layer FLEXCAN Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * FLEXCAN Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t MCR;                                                          ///< Module Configuration Register                offset: 0x00
    __IO uint32_t CTRL1;                                                        ///< Control Register 1                           offset: 0x04
    __IO uint32_t TIMER;                                                        ///< Free Running Timer Register                  offset: 0x08
    __IO uint32_t Reserved0[1];                                                 ///< Reserved
    __IO uint32_t RXMGMASK;                                                     ///< Rx Mailboxes Global Mask Register            offset: 0x10
    __IO uint32_t RX14MASK;                                                     ///< Rx 14 Mask Register                          offset: 0x14
    __IO uint32_t RX15MASK;                                                     ///< Rx 15 Mask Register                          offset: 0x18
    __IO uint32_t ECR;                                                          ///< Error Counter Register                       offset: 0x1C
    __IO uint32_t ESR1;                                                         ///< Error and Status Register 1                  offset: 0x20
    __IO uint32_t Reserved1[1];                                                 ///< Reserved
    __IO uint32_t IMASK1;                                                       ///< Interrupt Mask Register 1                    offset: 0x28
    __IO uint32_t Reserved2[1];                                                 ///< Reserved
    __IO uint32_t IFLAG1;                                                       ///< Interrupt Flag Register 1                    offset: 0x30
    __IO uint32_t CTRL2;                                                        ///< Control Register 2                           offset: 0x34
    __IO uint32_t ESR2;                                                         ///< Error and Status Register 2                  offset: 0x38
    __IO uint32_t Reserved3[2];                                                 ///< Reserved
    __IO uint32_t CRCR;                                                         ///< CRC Register                                 offset: 0x44
    __IO uint32_t RXFGMASK;                                                     ///< Rx FIFO Global Mask Register                 offset: 0x48
    __IO uint32_t RXFIR;                                                       ///< FIFO Information Register                    offset: 0x4C
    __IO uint32_t CBT;                                                          ///< CAN Bit Timing Register                      offset: 0x50
    __IO uint32_t Reserved4[11];                                                  ///< Reserved
    struct {
        __IO uint32_t CS ;                                                        ///<  Legacy Message Buffer 0 CS Register       offset: 0x80
        __IO uint32_t ID;                                                         ///<  Legacy Message Buffer 0 ID Register       offset: 0x84
        __IO uint32_t WORD0;                                                      ///<  Legacy Message Buffer 0 WORD0 Register    offset: 0x88
        __IO uint32_t WORD1;                                                      ///<  Legacy Message Buffer 0 WORD1 Register    offset: 0x8C
    } MB[32];
    __IO uint32_t Reserved5[384];                                               ///< Reserved
    __IO uint32_t RXIMRN[32];                                                    ///< Rx Individual Mask Registers (n = 0~31)      offset: 0x880
    __IO uint32_t Reserved6[192];                                               ///< Reserved
    __IO uint32_t FDCTRL;                                                       ///< CAN FD Control Register                      offset: 0xC00
    __IO uint32_t FDCBT;                                                        ///< CAN FD Bit Timing Register                   offset: 0xC04
    __IO uint32_t FDCRC;                                                        ///< CAN FD CRC Register                          offset: 0xC08
    __IO uint32_t ERFCR;                                                        ///< Enhanced Rx FIFO Control Register            offset: 0xC0C
    __IO uint32_t ERFIER;                                                       ///< Enhanced Rx FIFO Interrupt Enable Register   offset: 0xC10
    __IO uint32_t ERFSR;                                                        ///< Enhanced Rx FIFO Status Register             offset: 0xC14
    __IO uint32_t Reserved7[1274];                                              ///< Reserved
    struct {
        __IO uint32_t ERFCS ;                                                   ///<  Enhanced Rx FIFO Buffer 0 CS Register       offset: 0x2000
        __IO uint32_t ERFDID;                                                   ///<  Enhanced Rx FIFO Buffer 0 ID Register       offset: 0x2004
        __IO uint32_t ERFDWORD[16];                                             ///<  Enhanced Rx FIFO Buffer 0 WORD Register     offset: 0x2008
        __IO uint32_t IHOFF;                                                    ///<  Identifier receive filter hit indication    offset: 0x2048
        __IO uint32_t Reserved8;
    }ERFMB[6];
    __IO uint32_t Reserved9[904];                                               ///< Reserved
    __IO uint32_t ERFFEL[2];                                                    ///< Enhanced Rx FIFO Filter Element Registers (n=0 ~ 1)offset: 0x3000
} FLEXCAN_Type;

/*******************************************************************************
 * FLEXCAN Type
 ******************************************************************************/

/*!
 * @addtogroup FLEXCAN_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief FLEXCAN_MCR Register Bit Definition
 */

#define FLEXCAN_MCR_MDIS_SHIFT                  (31)
#define FLEXCAN_MCR_MDIS_MASK                   (0x1U << FLEXCAN_MCR_MDIS_SHIFT)
#define FLEXCAN_MCR_MDIS(x)                     (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_MDIS_SHIFT)) & FLEXCAN_MCR_MDIS_MASK)

#define FLEXCAN_MCR_FRZ_SHIFT                   (30)
#define FLEXCAN_MCR_FRZ_MASK                    (0x1U << FLEXCAN_MCR_FRZ_SHIFT)
#define FLEXCAN_MCR_FRZ(x)                      (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_FRZ_SHIFT)) & FLEXCAN_MCR_FRZ_MASK)

