UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define FLEXCAN_ERFCR_DMALW_SHIFT               (26)
#define FLEXCAN_ERFCR_DMALW_MASK                (0x1FU << FLEXCAN_ERFCR_DMALW_SHIFT)
#define FLEXCAN_ERFCR_DMALW(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFCR_DMALW_SHIFT)) & FLEXCAN_ERFCR_DMALW_MASK)

#define FLEXCAN_ERFCR_NEXIF_SHIFT               (16)
#define FLEXCAN_ERFCR_NEXIF_MASK                (0x1U << FLEXCAN_ERFCR_NEXIF_SHIFT)
#define FLEXCAN_ERFCR_NEXIF(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFCR_NEXIF_SHIFT)) & FLEXCAN_ERFCR_NEXIF_MASK)

#define FLEXCAN_ERFCR_ERFWM_SHIFT               (0)
#define FLEXCAN_ERFCR_ERFWM_MASK                (0x7U << FLEXCAN_ERFCR_ERFWM_SHIFT)
#define FLEXCAN_ERFCR_ERFWM(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFCR_ERFWM_SHIFT)) & FLEXCAN_ERFCR_ERFWM_MASK)

/*!
 * @brief FLEXCAN_ERFIER Register Bit Definition
 */

#define FLEXCAN_ERFIER_ERFUFWIE_SHIFT           (31)
#define FLEXCAN_ERFIER_ERFUFWIE_MASK            (0x1U << FLEXCAN_ERFIER_ERFUFWIE_SHIFT)
#define FLEXCAN_ERFIER_ERFUFWIE(x)              (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFIER_ERFUFWIE_SHIFT)) & FLEXCAN_ERFIER_ERFUFWIE_MASK)

#define FLEXCAN_ERFIER_ERFOVFIE_SHIFT           (30)
#define FLEXCAN_ERFIER_ERFOVFIE_MASK            (0x1U << FLEXCAN_ERFIER_ERFOVFIE_SHIFT)
#define FLEXCAN_ERFIER_ERFOVFIE(x)              (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFIER_ERFOVFIE_SHIFT)) & FLEXCAN_ERFIER_ERFOVFIE_MASK)

#define FLEXCAN_ERFIER_ERFWMIIE_SHIFT           (29)
#define FLEXCAN_ERFIER_ERFWMIIE_MASK            (0x1U << FLEXCAN_ERFIER_ERFWMIIE_SHIFT)
#define FLEXCAN_ERFIER_ERFWMIIE(x)              (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFIER_ERFWMIIE_SHIFT)) & FLEXCAN_ERFIER_ERFWMIIE_MASK)

#define FLEXCAN_ERFIER_ERFDAIE_SHIFT            (28)
#define FLEXCAN_ERFIER_ERFDAIE_MASK             (0x1U << FLEXCAN_ERFIER_ERFDAIE_SHIFT)
#define FLEXCAN_ERFIER_ERFDAIE(x)               (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFIER_ERFDAIE_SHIFT)) & FLEXCAN_ERFIER_ERFDAIE_MASK)

/*!
 * @brief FLEXCAN_ERFSR Register Bit Definition
 */

#define FLEXCAN_ERFSR_ERFUFW_SHIFT              (31)
#define FLEXCAN_ERFSR_ERFUFW_MASK               (0x1U << FLEXCAN_ERFSR_ERFUFW_SHIFT)
#define FLEXCAN_ERFSR_ERFUFW(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFSR_ERFUFW_SHIFT)) & FLEXCAN_ERFSR_ERFUFW_MASK)

#define FLEXCAN_ERFSR_ERFOVF_SHIFT              (30)
#define FLEXCAN_ERFSR_ERFOVF_MASK               (0x1U << FLEXCAN_ERFSR_ERFOVF_SHIFT)
#define FLEXCAN_ERFSR_ERFOVF(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFSR_ERFOVF_SHIFT)) & FLEXCAN_ERFSR_ERFOVF_MASK)

#define FLEXCAN_ERFSR_ERFWMI_SHIFT              (29)
#define FLEXCAN_ERFSR_ERFWMI_MASK               (0x1U << FLEXCAN_ERFSR_ERFWMI_SHIFT)
#define FLEXCAN_ERFSR_ERFWMI(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFSR_ERFWMI_SHIFT)) & FLEXCAN_ERFSR_ERFWMI_MASK)

#define FLEXCAN_ERFSR_ERFDA_SHIFT               (28)
#define FLEXCAN_ERFSR_ERFDA_MASK                (0x1U << FLEXCAN_ERFSR_ERFDA_SHIFT)
#define FLEXCAN_ERFSR_ERFDA(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFSR_ERFDA_SHIFT)) & FLEXCAN_ERFSR_ERFDA_MASK)

#define FLEXCAN_ERFSR_ERFCLR_SHIFT              (27)
#define FLEXCAN_ERFSR_ERFCLR_MASK               (0x1U << FLEXCAN_ERFSR_ERFCLR_SHIFT)
#define FLEXCAN_ERFSR_ERFCLR(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFSR_ERFCLR_SHIFT)) & FLEXCAN_ERFSR_ERFCLR_MASK)

#define FLEXCAN_ERFSR_ERFE_SHIFT                (17)
#define FLEXCAN_ERFSR_ERFE_MASK                 (0x1U << FLEXCAN_ERFSR_ERFE_SHIFT)
#define FLEXCAN_ERFSR_ERFE(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFSR_ERFE_SHIFT)) & FLEXCAN_ERFSR_ERFE_MASK)

#define FLEXCAN_ERFSR_ERFF_SHIFT                (16)
#define FLEXCAN_ERFSR_ERFF_MASK                 (0x1U << FLEXCAN_ERFSR_ERFF_SHIFT)
#define FLEXCAN_ERFSR_ERFF(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFSR_ERFF_SHIFT)) & FLEXCAN_ERFSR_ERFF_MASK)

#define FLEXCAN_ERFSR_ERFEL_SHIFT               (0)
#define FLEXCAN_ERFSR_ERFEL_MASK                (0x7U << FLEXCAN_ERFSR_ERFEL_SHIFT)
#define FLEXCAN_ERFSR_ERFEL(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFSR_ERFEL_SHIFT)) & FLEXCAN_ERFSR_ERFEL_MASK)

/*!
 * @brief FLEXCAN_ERFFEL Register Bit Definition
 */

#define FLEXCAN_ERFFEL_FEL_SHIFT                (0)
#define FLEXCAN_ERFFEL_FEL_MASK                 (0xFFFFFFFFU << FLEXCAN_ERFFEL_FEL_SHIFT)
#define FLEXCAN_ERFFEL_FEL(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFFEL_FEL_SHIFT)) & FLEXCAN_ERFFEL_FEL_MASK)

/*!
 * @}
 */ /* end of group FLEXCAN_Register_Masks */
/******************************************************************************
 *FLEXCAN Instance
*******************************************************************************/

#define FLEXCAN              ((FLEXCAN_Type*)FLEXCAN_BASE)

/*!
 * @}
 */ /* end of group FLEXCAN_Peripheral_Access_Layer */



/*!
 * @addtogroup GPIO_Peripheral_Access_Layer GPIO Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * GPIO Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CRL;                                                          ///< Port configuration register low              offset: 0x00
    __IO uint32_t CRH;                                                          ///< Port configuration register high             offset: 0x04
    __IO uint32_t IDR;                                                          ///< Port input data register                     offset: 0x08
    __IO uint32_t ODR;                                                          ///< Port output data register                    offset: 0x0C
    __IO uint32_t BSRR;                                                         ///< Port bit set/reset register                  offset: 0x10
    __IO uint32_t BRR;                                                          ///< Port bit reset register                      offset: 0x14
    __IO uint32_t LCKR;                                                         ///< Port configuration lock register             offset: 0x18
    __IO uint32_t DCR;                                                          ///< Port output open drain control register      offset: 0x1C
    __IO uint32_t AFRL;                                                         ///< Port alternate function register low         offset: 0x20
    __IO uint32_t AFRH;                                                         ///< Port alternate function register high        offset: 0x24
} GPIO_Type;

