UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define GPIO_CRH_CNF9_SHIFT                     (6)
#define GPIO_CRH_CNF9_MASK                      (0x3U << GPIO_CRH_CNF9_SHIFT)
#define GPIO_CRH_CNF9(x)                        (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_CNF9_SHIFT)) & GPIO_CRH_CNF9_MASK)

#define GPIO_CRH_MODE9_SHIFT                    (4)
#define GPIO_CRH_MODE9_MASK                     (0x3U << GPIO_CRH_MODE9_SHIFT)
#define GPIO_CRH_MODE9(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_MODE9_SHIFT)) & GPIO_CRH_MODE9_MASK)

#define GPIO_CRH_CNF8_SHIFT                     (2)
#define GPIO_CRH_CNF8_MASK                      (0x3U << GPIO_CRH_CNF8_SHIFT)
#define GPIO_CRH_CNF8(x)                        (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_CNF8_SHIFT)) & GPIO_CRH_CNF8_MASK)

#define GPIO_CRH_MODE8_SHIFT                    (0)
#define GPIO_CRH_MODE8_MASK                     (0x3U << GPIO_CRH_MODE8_SHIFT)
#define GPIO_CRH_MODE8(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_MODE8_SHIFT)) & GPIO_CRH_MODE8_MASK)

/*!
 * @brief GPIO_IDR Register Bit Definition
 */

#define GPIO_IDR_IDRY_SHIFT                     (0)
#define GPIO_IDR_IDRY_MASK                      (0xFFFFU << GPIO_IDR_IDRY_SHIFT)
#define GPIO_IDR_IDRY(x)                        (((uint32_t)(((uint32_t)(x)) << GPIO_IDR_IDRY_SHIFT)) & GPIO_IDR_IDRY_MASK)

/*!
 * @brief GPIO_ODR Register Bit Definition
 */

#define GPIO_ODR_ODRY_SHIFT                     (0)
#define GPIO_ODR_ODRY_MASK                      (0xFFFFU << GPIO_ODR_ODRY_SHIFT)
#define GPIO_ODR_ODRY(x)                        (((uint32_t)(((uint32_t)(x)) << GPIO_ODR_ODRY_SHIFT)) & GPIO_ODR_ODRY_MASK)

/*!
 * @brief GPIO_BSRR Register Bit Definition
 */

#define GPIO_BSRR_BRY_SHIFT                     (16)
#define GPIO_BSRR_BRY_MASK                      (0xFFFFU << GPIO_BSRR_BRY_SHIFT)
#define GPIO_BSRR_BRY(x)                        (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BRY_SHIFT)) & GPIO_BSRR_BRY_MASK)

#define GPIO_BSRR_BSY_SHIFT                     (0)
#define GPIO_BSRR_BSY_MASK                      (0xFFFFU << GPIO_BSRR_BSY_SHIFT)
#define GPIO_BSRR_BSY(x)                        (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BSY_SHIFT)) & GPIO_BSRR_BSY_MASK)

/*!
 * @brief GPIO_BRR Register Bit Definition
 */

#define GPIO_BRR_BRY_SHIFT                      (0)
#define GPIO_BRR_BRY_MASK                       (0xFFFFU << GPIO_BRR_BRY_SHIFT)
#define GPIO_BRR_BRY(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BRY_SHIFT)) & GPIO_BRR_BRY_MASK)

/*!
 * @brief GPIO_LCKR Register Bit Definition
 */

#define GPIO_LCKR_LCKK_SHIFT                    (16)
#define GPIO_LCKR_LCKK_MASK                     (0x1U << GPIO_LCKR_LCKK_SHIFT)
#define GPIO_LCKR_LCKK(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_LCKR_LCKK_SHIFT)) & GPIO_LCKR_LCKK_MASK)

#define GPIO_LCKR_LCK_SHIFT                     (0)
#define GPIO_LCKR_LCK_MASK                      (0xFFFFU << GPIO_LCKR_LCK_SHIFT)
#define GPIO_LCKR_LCK(x)                        (((uint32_t)(((uint32_t)(x)) << GPIO_LCKR_LCK_SHIFT)) & GPIO_LCKR_LCK_MASK)

/*!
 * @brief GPIO_DCR Register Bit Definition
 */

#define GPIO_DCR_PX15_SHIFT                     (30)
#define GPIO_DCR_PX15_MASK                      (0x3U << GPIO_DCR_PX15_SHIFT)
#define GPIO_DCR_PX15(x)                        (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX15_SHIFT)) & GPIO_DCR_PX15_MASK)

#define GPIO_DCR_PX14_SHIFT                     (28)
#define GPIO_DCR_PX14_MASK                      (0x3U << GPIO_DCR_PX14_SHIFT)
#define GPIO_DCR_PX14(x)                        (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX14_SHIFT)) & GPIO_DCR_PX14_MASK)

#define GPIO_DCR_PX13_SHIFT                     (26)
#define GPIO_DCR_PX13_MASK                      (0x3U << GPIO_DCR_PX13_SHIFT)
#define GPIO_DCR_PX13(x)                        (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX13_SHIFT)) & GPIO_DCR_PX13_MASK)

#define GPIO_DCR_PX12_SHIFT                     (24)
#define GPIO_DCR_PX12_MASK                      (0x3U << GPIO_DCR_PX12_SHIFT)
#define GPIO_DCR_PX12(x)                        (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX12_SHIFT)) & GPIO_DCR_PX12_MASK)

#define GPIO_DCR_PX11_SHIFT                     (22)
#define GPIO_DCR_PX11_MASK                      (0x3U << GPIO_DCR_PX11_SHIFT)
#define GPIO_DCR_PX11(x)                        (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX11_SHIFT)) & GPIO_DCR_PX11_MASK)

#define GPIO_DCR_PX10_SHIFT                     (20)
#define GPIO_DCR_PX10_MASK                      (0x3U << GPIO_DCR_PX10_SHIFT)
#define GPIO_DCR_PX10(x)                        (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX10_SHIFT)) & GPIO_DCR_PX10_MASK)

#define GPIO_DCR_PX9_SHIFT                      (18)
#define GPIO_DCR_PX9_MASK                       (0x3U << GPIO_DCR_PX9_SHIFT)
#define GPIO_DCR_PX9(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX9_SHIFT)) & GPIO_DCR_PX9_MASK)

#define GPIO_DCR_PX8_SHIFT                      (16)
#define GPIO_DCR_PX8_MASK                       (0x3U << GPIO_DCR_PX8_SHIFT)
#define GPIO_DCR_PX8(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX8_SHIFT)) & GPIO_DCR_PX8_MASK)

#define GPIO_DCR_PX7_SHIFT                      (14)
#define GPIO_DCR_PX7_MASK                       (0x3U << GPIO_DCR_PX7_SHIFT)
#define GPIO_DCR_PX7(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX7_SHIFT)) & GPIO_DCR_PX7_MASK)

#define GPIO_DCR_PX6_SHIFT                      (12)
#define GPIO_DCR_PX6_MASK                       (0x3U << GPIO_DCR_PX6_SHIFT)
#define GPIO_DCR_PX6(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX6_SHIFT)) & GPIO_DCR_PX6_MASK)

#define GPIO_DCR_PX5_SHIFT                      (10)
#define GPIO_DCR_PX5_MASK                       (0x3U << GPIO_DCR_PX5_SHIFT)
#define GPIO_DCR_PX5(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX5_SHIFT)) & GPIO_DCR_PX5_MASK)

#define GPIO_DCR_PX4_SHIFT                      (8)
#define GPIO_DCR_PX4_MASK                       (0x3U << GPIO_DCR_PX4_SHIFT)
#define GPIO_DCR_PX4(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX4_SHIFT)) & GPIO_DCR_PX4_MASK)

