UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define GPIO_DCR_PX3_SHIFT                      (6)
#define GPIO_DCR_PX3_MASK                       (0x3U << GPIO_DCR_PX3_SHIFT)
#define GPIO_DCR_PX3(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX3_SHIFT)) & GPIO_DCR_PX3_MASK)

#define GPIO_DCR_PX2_SHIFT                      (4)
#define GPIO_DCR_PX2_MASK                       (0x3U << GPIO_DCR_PX2_SHIFT)
#define GPIO_DCR_PX2(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX2_SHIFT)) & GPIO_DCR_PX2_MASK)

#define GPIO_DCR_PX1_SHIFT                      (2)
#define GPIO_DCR_PX1_MASK                       (0x3U << GPIO_DCR_PX1_SHIFT)
#define GPIO_DCR_PX1(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX1_SHIFT)) & GPIO_DCR_PX1_MASK)

#define GPIO_DCR_PX0_SHIFT                      (0)
#define GPIO_DCR_PX0_MASK                       (0x3U << GPIO_DCR_PX0_SHIFT)
#define GPIO_DCR_PX0(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX0_SHIFT)) & GPIO_DCR_PX0_MASK)

/*!
 * @brief GPIO_AFRL Register Bit Definition
 */

#define GPIO_AFRL_AFR7_SHIFT                    (28)
#define GPIO_AFRL_AFR7_MASK                     (0xFU << GPIO_AFRL_AFR7_SHIFT)
#define GPIO_AFRL_AFR7(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR7_SHIFT)) & GPIO_AFRL_AFR7_MASK)

#define GPIO_AFRL_AFR6_SHIFT                    (24)
#define GPIO_AFRL_AFR6_MASK                     (0xFU << GPIO_AFRL_AFR6_SHIFT)
#define GPIO_AFRL_AFR6(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR6_SHIFT)) & GPIO_AFRL_AFR6_MASK)

#define GPIO_AFRL_AFR5_SHIFT                    (20)
#define GPIO_AFRL_AFR5_MASK                     (0xFU << GPIO_AFRL_AFR5_SHIFT)
#define GPIO_AFRL_AFR5(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR5_SHIFT)) & GPIO_AFRL_AFR5_MASK)

#define GPIO_AFRL_AFR4_SHIFT                    (16)
#define GPIO_AFRL_AFR4_MASK                     (0xFU << GPIO_AFRL_AFR4_SHIFT)
#define GPIO_AFRL_AFR4(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR4_SHIFT)) & GPIO_AFRL_AFR4_MASK)

#define GPIO_AFRL_AFR3_SHIFT                    (12)
#define GPIO_AFRL_AFR3_MASK                     (0xFU << GPIO_AFRL_AFR3_SHIFT)
#define GPIO_AFRL_AFR3(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR3_SHIFT)) & GPIO_AFRL_AFR3_MASK)

#define GPIO_AFRL_AFR2_SHIFT                    (8)
#define GPIO_AFRL_AFR2_MASK                     (0xFU << GPIO_AFRL_AFR2_SHIFT)
#define GPIO_AFRL_AFR2(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR2_SHIFT)) & GPIO_AFRL_AFR2_MASK)

#define GPIO_AFRL_AFR1_SHIFT                    (4)
#define GPIO_AFRL_AFR1_MASK                     (0xFU << GPIO_AFRL_AFR1_SHIFT)
#define GPIO_AFRL_AFR1(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR1_SHIFT)) & GPIO_AFRL_AFR1_MASK)

#define GPIO_AFRL_AFR0_SHIFT                    (0)
#define GPIO_AFRL_AFR0_MASK                     (0xFU << GPIO_AFRL_AFR0_SHIFT)
#define GPIO_AFRL_AFR0(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR0_SHIFT)) & GPIO_AFRL_AFR0_MASK)

/*!
 * @brief GPIO_AFRH Register Bit Definition
 */

#define GPIO_AFRH_AFR15_SHIFT                   (28)
#define GPIO_AFRH_AFR15_MASK                    (0xFU << GPIO_AFRH_AFR15_SHIFT)
#define GPIO_AFRH_AFR15(x)                      (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR15_SHIFT)) & GPIO_AFRH_AFR15_MASK)

#define GPIO_AFRH_AFR14_SHIFT                   (24)
#define GPIO_AFRH_AFR14_MASK                    (0xFU << GPIO_AFRH_AFR14_SHIFT)
#define GPIO_AFRH_AFR14(x)                      (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR14_SHIFT)) & GPIO_AFRH_AFR14_MASK)

#define GPIO_AFRH_AFR13_SHIFT                   (20)
#define GPIO_AFRH_AFR13_MASK                    (0xFU << GPIO_AFRH_AFR13_SHIFT)
#define GPIO_AFRH_AFR13(x)                      (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR13_SHIFT)) & GPIO_AFRH_AFR13_MASK)

#define GPIO_AFRH_AFR12_SHIFT                   (16)
#define GPIO_AFRH_AFR12_MASK                    (0xFU << GPIO_AFRH_AFR12_SHIFT)
#define GPIO_AFRH_AFR12(x)                      (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR12_SHIFT)) & GPIO_AFRH_AFR12_MASK)

#define GPIO_AFRH_AFR11_SHIFT                   (12)
#define GPIO_AFRH_AFR11_MASK                    (0xFU << GPIO_AFRH_AFR11_SHIFT)
#define GPIO_AFRH_AFR11(x)                      (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR11_SHIFT)) & GPIO_AFRH_AFR11_MASK)

#define GPIO_AFRH_AFR10_SHIFT                   (8)
#define GPIO_AFRH_AFR10_MASK                    (0xFU << GPIO_AFRH_AFR10_SHIFT)
#define GPIO_AFRH_AFR10(x)                      (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR10_SHIFT)) & GPIO_AFRH_AFR10_MASK)

#define GPIO_AFRH_AFR9_SHIFT                    (4)
#define GPIO_AFRH_AFR9_MASK                     (0xFU << GPIO_AFRH_AFR9_SHIFT)
#define GPIO_AFRH_AFR9(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR9_SHIFT)) & GPIO_AFRH_AFR9_MASK)

#define GPIO_AFRH_AFR8_SHIFT                    (0)
#define GPIO_AFRH_AFR8_MASK                     (0xFU << GPIO_AFRH_AFR8_SHIFT)
#define GPIO_AFRH_AFR8(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR8_SHIFT)) & GPIO_AFRH_AFR8_MASK)

/*!
 * @}
 */ /* end of group GPIO_Register_Masks */
/******************************************************************************
 *GPIO Instance
*******************************************************************************/

#define GPIOA                ((GPIO_Type*)GPIOA_BASE)

#define GPIOB                ((GPIO_Type*)GPIOB_BASE)

#define GPIOC                ((GPIO_Type*)GPIOC_BASE)

#define GPIOD                ((GPIO_Type*)GPIOD_BASE)

/*!
 * @}
 */ /* end of group GPIO_Peripheral_Access_Layer */



/*!
 * @addtogroup HWDIV_Peripheral_Access_Layer HWDIV Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * HWDIV Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t DVDR;                                                         ///< Dividend register                            offset: 0x00
    __IO uint32_t DVSR;                                                         ///< Divisor register                             offset: 0x04
    __IO uint32_t QUOTR;                                                        ///< Quotient register                            offset: 0x08
    __IO uint32_t RMDR;                                                         ///< Remainder register                           offset: 0x0C
    __IO uint32_t SR;                                                           ///< Status register                              offset: 0x10
    __IO uint32_t CR;                                                           ///< Control register                             offset: 0x14
} HWDIV_Type;

