UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
/*******************************************************************************
 * HWDIV Type
 ******************************************************************************/

/*!
 * @addtogroup HWDIV_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief HWDIV_DVDR Register Bit Definition
 */

#define HWDIV_DVDR_DIVIDEND_SHIFT               (0)
#define HWDIV_DVDR_DIVIDEND_MASK                (0xFFFFFFFFU << HWDIV_DVDR_DIVIDEND_SHIFT)
#define HWDIV_DVDR_DIVIDEND(x)                  (((uint32_t)(((uint32_t)(x)) << HWDIV_DVDR_DIVIDEND_SHIFT)) & HWDIV_DVDR_DIVIDEND_MASK)

/*!
 * @brief HWDIV_DVSR Register Bit Definition
 */

#define HWDIV_DVSR_DIVISOR_SHIFT                (0)
#define HWDIV_DVSR_DIVISOR_MASK                 (0xFFFFFFFFU << HWDIV_DVSR_DIVISOR_SHIFT)
#define HWDIV_DVSR_DIVISOR(x)                   (((uint32_t)(((uint32_t)(x)) << HWDIV_DVSR_DIVISOR_SHIFT)) & HWDIV_DVSR_DIVISOR_MASK)

/*!
 * @brief HWDIV_QUOTR Register Bit Definition
 */

#define HWDIV_QUOTR_QUOTIENT_SHIFT              (0)
#define HWDIV_QUOTR_QUOTIENT_MASK               (0xFFFFFFFFU << HWDIV_QUOTR_QUOTIENT_SHIFT)
#define HWDIV_QUOTR_QUOTIENT(x)                 (((uint32_t)(((uint32_t)(x)) << HWDIV_QUOTR_QUOTIENT_SHIFT)) & HWDIV_QUOTR_QUOTIENT_MASK)

/*!
 * @brief HWDIV_RMDR Register Bit Definition
 */

#define HWDIV_RMDR_REMAINDER_SHIFT              (0)
#define HWDIV_RMDR_REMAINDER_MASK               (0xFFFFFFFFU << HWDIV_RMDR_REMAINDER_SHIFT)
#define HWDIV_RMDR_REMAINDER(x)                 (((uint32_t)(((uint32_t)(x)) << HWDIV_RMDR_REMAINDER_SHIFT)) & HWDIV_RMDR_REMAINDER_MASK)

/*!
 * @brief HWDIV_SR Register Bit Definition
 */

#define HWDIV_SR_OVF_SHIFT                      (0)
#define HWDIV_SR_OVF_MASK                       (0x1U << HWDIV_SR_OVF_SHIFT)
#define HWDIV_SR_OVF(x)                         (((uint32_t)(((uint32_t)(x)) << HWDIV_SR_OVF_SHIFT)) & HWDIV_SR_OVF_MASK)

/*!
 * @brief HWDIV_CR Register Bit Definition
 */

#define HWDIV_CR_OVFE_SHIFT                     (1)
#define HWDIV_CR_OVFE_MASK                      (0x1U << HWDIV_CR_OVFE_SHIFT)
#define HWDIV_CR_OVFE(x)                        (((uint32_t)(((uint32_t)(x)) << HWDIV_CR_OVFE_SHIFT)) & HWDIV_CR_OVFE_MASK)

#define HWDIV_CR_USIGN_SHIFT                    (0)
#define HWDIV_CR_USIGN_MASK                     (0x1U << HWDIV_CR_USIGN_SHIFT)
#define HWDIV_CR_USIGN(x)                       (((uint32_t)(((uint32_t)(x)) << HWDIV_CR_USIGN_SHIFT)) & HWDIV_CR_USIGN_MASK)

/*!
 * @}
 */ /* end of group HWDIV_Register_Masks */
/******************************************************************************
 *HWDIV Instance
*******************************************************************************/

#define HWDIV                ((HWDIV_Type*)HWDIV_BASE)

/*!
 * @}
 */ /* end of group HWDIV_Peripheral_Access_Layer */



/*!
 * @addtogroup I2C_Peripheral_Access_Layer I2C Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * I2C Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                           ///< Control Register                             offset: 0x00
    __IO uint32_t TAR;                                                          ///< Target Address Register                      offset: 0x04
    __IO uint32_t SAR;                                                          ///< Slave Address Register                       offset: 0x08
    __IO uint32_t Reserved0[1];                                                 ///< Reserved
    __IO uint32_t DR;                                                           ///< Data Command Register                        offset: 0x10
    __IO uint32_t SSHR;                                                         ///< Standard Mode SCL High Count Register        offset: 0x14
    __IO uint32_t SSLR;                                                         ///< Standard Mode SCL Low Count Register         offset: 0x18
    __IO uint32_t FSHR;                                                         ///< Fast Mode SCL High Count Register            offset: 0x1C
    __IO uint32_t FSLR;                                                         ///< Fast Mode SCL Low Count Register             offset: 0x20
    __IO uint32_t Reserved1[2];                                                 ///< Reserved
    __IO uint32_t ISR;                                                          ///< Interrupt Status Register                    offset: 0x2C
    __IO uint32_t IMR;                                                          ///< Interrupt Mask Register                      offset: 0x30
    __IO uint32_t RAWISR;                                                       ///< RAW Interrupt Status Register                offset: 0x34
    __IO uint32_t RXTLR;                                                        ///< Receive Threshold Register                   offset: 0x38
    __IO uint32_t TXTLR;                                                        ///< Transmit Threshold Register                  offset: 0x3C
    __IO uint32_t ICR;                                                          ///< Combined and Independent Interrupt Clear Registeroffset: 0x40
    __IO uint32_t RXUNDER;                                                      ///< RX_UNDER Interrupt Clear Register            offset: 0x44
    __IO uint32_t RXOVER;                                                       ///< RX_OVER Interrupt Clear Register             offset: 0x48
    __IO uint32_t TXOVER;                                                       ///< TX_OVER Interrupt Clear Register             offset: 0x4C
    __IO uint32_t RDREQ;                                                        ///< RD_REQ Interrupt Clear Register              offset: 0x50
    __IO uint32_t TXABRT;                                                       ///< TX_ABRT Interrupt Clear Register             offset: 0x54
    __IO uint32_t RXDONE;                                                       ///< RX_DONE Interrupt Clear Register             offset: 0x58
    __IO uint32_t ACTIV;                                                        ///< ACTIVITY Interrupt Clear Register            offset: 0x5C
    __IO uint32_t STOP;                                                         ///< STOP_DET Interrupt Clear Register            offset: 0x60
    __IO uint32_t START;                                                        ///< START_DET Interrupt Clear Register           offset: 0x64
    __IO uint32_t GC;                                                           ///< GEN_CALL Interrupt Clear Register            offset: 0x68
    __IO uint32_t ENR;                                                          ///< Enable Register                              offset: 0x6C
    __IO uint32_t SR;                                                           ///< Status Register                              offset: 0x70
    __IO uint32_t TXFLR;                                                        ///< Transmit FIFO Level Register                 offset: 0x74
    __IO uint32_t RXFLR;                                                        ///< Receive FIFO Level Register                  offset: 0x78
    __IO uint32_t HOLD;                                                         ///< SDA Hold Time Register                       offset: 0x7C
    __IO uint32_t Reserved2[2];                                                 ///< Reserved
    __IO uint32_t DMA;                                                          ///< DMA Control Register                         offset: 0x88
    __IO uint32_t Reserved3[2];                                                 ///< Reserved
    __IO uint32_t SETUP;                                                        ///< SDA Setup Time Register                      offset: 0x94
    __IO uint32_t GCR;                                                          ///< General Call ACK Register                    offset: 0x98
    __IO uint32_t Reserved4[5];                                                 ///< Reserved
    __IO uint32_t SLVMASK;                                                      ///< Slave Address Mask Register                  offset: 0xB0
    __IO uint32_t SLVRCVADDR;                                                   ///< Slave Address Receive Register               offset: 0xB4
} I2C_Type;

