UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define I3C_STATUS_STHDR_SHIFT                  (6)
#define I3C_STATUS_STHDR_MASK                   (0x1U << I3C_STATUS_STHDR_SHIFT)
#define I3C_STATUS_STHDR(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STHDR_SHIFT)) & I3C_STATUS_STHDR_MASK)

#define I3C_STATUS_STDAA_SHIFT                  (5)
#define I3C_STATUS_STDAA_MASK                   (0x1U << I3C_STATUS_STDAA_SHIFT)
#define I3C_STATUS_STDAA(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STDAA_SHIFT)) & I3C_STATUS_STDAA_MASK)

#define I3C_STATUS_STREQWR_SHIFT                (4)
#define I3C_STATUS_STREQWR_MASK                 (0x1U << I3C_STATUS_STREQWR_SHIFT)
#define I3C_STATUS_STREQWR(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STREQWR_SHIFT)) & I3C_STATUS_STREQWR_MASK)

#define I3C_STATUS_STREQRD_SHIFT                (3)
#define I3C_STATUS_STREQRD_MASK                 (0x1U << I3C_STATUS_STREQRD_SHIFT)
#define I3C_STATUS_STREQRD(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STREQRD_SHIFT)) & I3C_STATUS_STREQRD_MASK)

#define I3C_STATUS_STCCCH_SHIFT                 (2)
#define I3C_STATUS_STCCCH_MASK                  (0x1U << I3C_STATUS_STCCCH_SHIFT)
#define I3C_STATUS_STCCCH(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STCCCH_SHIFT)) & I3C_STATUS_STCCCH_MASK)

#define I3C_STATUS_STMSG_SHIFT                  (1)
#define I3C_STATUS_STMSG_MASK                   (0x1U << I3C_STATUS_STMSG_SHIFT)
#define I3C_STATUS_STMSG(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STMSG_SHIFT)) & I3C_STATUS_STMSG_MASK)

#define I3C_STATUS_STNOTSTOP_SHIFT              (0)
#define I3C_STATUS_STNOTSTOP_MASK               (0x1U << I3C_STATUS_STNOTSTOP_SHIFT)
#define I3C_STATUS_STNOTSTOP(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STNOTSTOP_SHIFT)) & I3C_STATUS_STNOTSTOP_MASK)

/*!
 * @brief I3C_CTRL Register Bit Definition
 */

#define I3C_CTRL_VENDINFO_SHIFT                 (24)
#define I3C_CTRL_VENDINFO_MASK                  (0xFFU << I3C_CTRL_VENDINFO_SHIFT)
#define I3C_CTRL_VENDINFO(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_CTRL_VENDINFO_SHIFT)) & I3C_CTRL_VENDINFO_MASK)

#define I3C_CTRL_ACTSTATE_SHIFT                 (20)
#define I3C_CTRL_ACTSTATE_MASK                  (0x3U << I3C_CTRL_ACTSTATE_SHIFT)
#define I3C_CTRL_ACTSTATE(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_CTRL_ACTSTATE_SHIFT)) & I3C_CTRL_ACTSTATE_MASK)

#define I3C_CTRL_PENDINT_SHIFT                  (16)
#define I3C_CTRL_PENDINT_MASK                   (0xFU << I3C_CTRL_PENDINT_SHIFT)
#define I3C_CTRL_PENDINT(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_CTRL_PENDINT_SHIFT)) & I3C_CTRL_PENDINT_MASK)

#define I3C_CTRL_IBIDATA_SHIFT                  (8)
#define I3C_CTRL_IBIDATA_MASK                   (0xFFU << I3C_CTRL_IBIDATA_SHIFT)
#define I3C_CTRL_IBIDATA(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_CTRL_IBIDATA_SHIFT)) & I3C_CTRL_IBIDATA_MASK)

#define I3C_CTRL_EXTDATA_SHIFT                  (3)
#define I3C_CTRL_EXTDATA_MASK                   (0x1U << I3C_CTRL_EXTDATA_SHIFT)
#define I3C_CTRL_EXTDATA(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_CTRL_EXTDATA_SHIFT)) & I3C_CTRL_EXTDATA_MASK)

#define I3C_CTRL_EVENT_SHIFT                    (0)
#define I3C_CTRL_EVENT_MASK                     (0x3U << I3C_CTRL_EVENT_SHIFT)
#define I3C_CTRL_EVENT(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_CTRL_EVENT_SHIFT)) & I3C_CTRL_EVENT_MASK)

/*!
 * @brief I3C_INTSET Register Bit Definition
 */

#define I3C_INTSET_EVTIE_SHIFT                  (18)
#define I3C_INTSET_EVTIE_MASK                   (0x1U << I3C_INTSET_EVTIE_SHIFT)
#define I3C_INTSET_EVTIE(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_EVTIE_SHIFT)) & I3C_INTSET_EVTIE_MASK)

#define I3C_INTSET_HANDLEDIE_SHIFT              (17)
#define I3C_INTSET_HANDLEDIE_MASK               (0x1U << I3C_INTSET_HANDLEDIE_SHIFT)
#define I3C_INTSET_HANDLEDIE(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_HANDLEDIE_SHIFT)) & I3C_INTSET_HANDLEDIE_MASK)

#define I3C_INTSET_ERWARIE_SHIFT                (15)
#define I3C_INTSET_ERWARIE_MASK                 (0x1U << I3C_INTSET_ERWARIE_SHIFT)
#define I3C_INTSET_ERWARIE(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_ERWARIE_SHIFT)) & I3C_INTSET_ERWARIE_MASK)

#define I3C_INTSET_CCCIE_SHIFT                  (14)
#define I3C_INTSET_CCCIE_MASK                   (0x1U << I3C_INTSET_CCCIE_SHIFT)
#define I3C_INTSET_CCCIE(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_CCCIE_SHIFT)) & I3C_INTSET_CCCIE_MASK)

#define I3C_INTSET_DACHGIE_SHIFT                (13)
#define I3C_INTSET_DACHGIE_MASK                 (0x1U << I3C_INTSET_DACHGIE_SHIFT)
#define I3C_INTSET_DACHGIE(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_DACHGIE_SHIFT)) & I3C_INTSET_DACHGIE_MASK)

#define I3C_INTSET_TXSIE_SHIFT                  (12)
#define I3C_INTSET_TXSIE_MASK                   (0x1U << I3C_INTSET_TXSIE_SHIFT)
#define I3C_INTSET_TXSIE(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_TXSIE_SHIFT)) & I3C_INTSET_TXSIE_MASK)

#define I3C_INTSET_RXPIE_SHIFT                  (11)
#define I3C_INTSET_RXPIE_MASK                   (0x1U << I3C_INTSET_RXPIE_SHIFT)
#define I3C_INTSET_RXPIE(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_RXPIE_SHIFT)) & I3C_INTSET_RXPIE_MASK)

#define I3C_INTSET_SPIE_SHIFT                   (10)
#define I3C_INTSET_SPIE_MASK                    (0x1U << I3C_INTSET_SPIE_SHIFT)
#define I3C_INTSET_SPIE(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_SPIE_SHIFT)) & I3C_INTSET_SPIE_MASK)

#define I3C_INTSET_MATEDIE_SHIFT                (9)
#define I3C_INTSET_MATEDIE_MASK                 (0x1U << I3C_INTSET_MATEDIE_SHIFT)
#define I3C_INTSET_MATEDIE(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_MATEDIE_SHIFT)) & I3C_INTSET_MATEDIE_MASK)

#define I3C_INTSET_STIE_SHIFT                   (8)
#define I3C_INTSET_STIE_MASK                    (0x1U << I3C_INTSET_STIE_SHIFT)
#define I3C_INTSET_STIE(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_STIE_SHIFT)) & I3C_INTSET_STIE_MASK)

/*!
 * @brief I3C_INTCLR Register Bit Definition
 */

