UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define I3C_INTCLR_EVTCLR_SHIFT                 (18)
#define I3C_INTCLR_EVTCLR_MASK                  (0x1U << I3C_INTCLR_EVTCLR_SHIFT)
#define I3C_INTCLR_EVTCLR(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_EVTCLR_SHIFT)) & I3C_INTCLR_EVTCLR_MASK)

#define I3C_INTCLR_HANDLEDCLR_SHIFT             (17)
#define I3C_INTCLR_HANDLEDCLR_MASK              (0x1U << I3C_INTCLR_HANDLEDCLR_SHIFT)
#define I3C_INTCLR_HANDLEDCLR(x)                (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_HANDLEDCLR_SHIFT)) & I3C_INTCLR_HANDLEDCLR_MASK)

#define I3C_INTCLR_ERWARCLR_SHIFT               (15)
#define I3C_INTCLR_ERWARCLR_MASK                (0x1U << I3C_INTCLR_ERWARCLR_SHIFT)
#define I3C_INTCLR_ERWARCLR(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_ERWARCLR_SHIFT)) & I3C_INTCLR_ERWARCLR_MASK)

#define I3C_INTCLR_CCCCLR_SHIFT                 (14)
#define I3C_INTCLR_CCCCLR_MASK                  (0x1U << I3C_INTCLR_CCCCLR_SHIFT)
#define I3C_INTCLR_CCCCLR(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_CCCCLR_SHIFT)) & I3C_INTCLR_CCCCLR_MASK)

#define I3C_INTCLR_DACHGCLR_SHIFT               (13)
#define I3C_INTCLR_DACHGCLR_MASK                (0x1U << I3C_INTCLR_DACHGCLR_SHIFT)
#define I3C_INTCLR_DACHGCLR(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_DACHGCLR_SHIFT)) & I3C_INTCLR_DACHGCLR_MASK)

#define I3C_INTCLR_TXSCLR_SHIFT                 (12)
#define I3C_INTCLR_TXSCLR_MASK                  (0x1U << I3C_INTCLR_TXSCLR_SHIFT)
#define I3C_INTCLR_TXSCLR(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_TXSCLR_SHIFT)) & I3C_INTCLR_TXSCLR_MASK)

#define I3C_INTCLR_RXPCLR_SHIFT                 (11)
#define I3C_INTCLR_RXPCLR_MASK                  (0x1U << I3C_INTCLR_RXPCLR_SHIFT)
#define I3C_INTCLR_RXPCLR(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_RXPCLR_SHIFT)) & I3C_INTCLR_RXPCLR_MASK)

#define I3C_INTCLR_SPCLR_SHIFT                  (10)
#define I3C_INTCLR_SPCLR_MASK                   (0x1U << I3C_INTCLR_SPCLR_SHIFT)
#define I3C_INTCLR_SPCLR(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_SPCLR_SHIFT)) & I3C_INTCLR_SPCLR_MASK)

#define I3C_INTCLR_MATEDCLR_SHIFT               (9)
#define I3C_INTCLR_MATEDCLR_MASK                (0x1U << I3C_INTCLR_MATEDCLR_SHIFT)
#define I3C_INTCLR_MATEDCLR(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_MATEDCLR_SHIFT)) & I3C_INTCLR_MATEDCLR_MASK)

#define I3C_INTCLR_STCLR_SHIFT                  (8)
#define I3C_INTCLR_STCLR_MASK                   (0x1U << I3C_INTCLR_STCLR_SHIFT)
#define I3C_INTCLR_STCLR(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_STCLR_SHIFT)) & I3C_INTCLR_STCLR_MASK)

/*!
 * @brief I3C_INTMASKED Register Bit Definition
 */

#define I3C_INTMASKED_EVTMSK_SHIFT              (18)
#define I3C_INTMASKED_EVTMSK_MASK               (0x1U << I3C_INTMASKED_EVTMSK_SHIFT)
#define I3C_INTMASKED_EVTMSK(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_EVTMSK_SHIFT)) & I3C_INTMASKED_EVTMSK_MASK)

#define I3C_INTMASKED_HANDLEDMSK_SHIFT          (17)
#define I3C_INTMASKED_HANDLEDMSK_MASK           (0x1U << I3C_INTMASKED_HANDLEDMSK_SHIFT)
#define I3C_INTMASKED_HANDLEDMSK(x)             (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_HANDLEDMSK_SHIFT)) & I3C_INTMASKED_HANDLEDMSK_MASK)

#define I3C_INTMASKED_ERWARMSK_SHIFT            (15)
#define I3C_INTMASKED_ERWARMSK_MASK             (0x1U << I3C_INTMASKED_ERWARMSK_SHIFT)
#define I3C_INTMASKED_ERWARMSK(x)               (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_ERWARMSK_SHIFT)) & I3C_INTMASKED_ERWARMSK_MASK)

#define I3C_INTMASKED_CCCMSK_SHIFT              (14)
#define I3C_INTMASKED_CCCMSK_MASK               (0x1U << I3C_INTMASKED_CCCMSK_SHIFT)
#define I3C_INTMASKED_CCCMSK(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_CCCMSK_SHIFT)) & I3C_INTMASKED_CCCMSK_MASK)

#define I3C_INTMASKED_DACHGMSK_SHIFT            (13)
#define I3C_INTMASKED_DACHGMSK_MASK             (0x1U << I3C_INTMASKED_DACHGMSK_SHIFT)
#define I3C_INTMASKED_DACHGMSK(x)               (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_DACHGMSK_SHIFT)) & I3C_INTMASKED_DACHGMSK_MASK)

#define I3C_INTMASKED_TXSMSK_SHIFT              (12)
#define I3C_INTMASKED_TXSMSK_MASK               (0x1U << I3C_INTMASKED_TXSMSK_SHIFT)
#define I3C_INTMASKED_TXSMSK(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_TXSMSK_SHIFT)) & I3C_INTMASKED_TXSMSK_MASK)

#define I3C_INTMASKED_RXPMSK_SHIFT              (11)
#define I3C_INTMASKED_RXPMSK_MASK               (0x1U << I3C_INTMASKED_RXPMSK_SHIFT)
#define I3C_INTMASKED_RXPMSK(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_RXPMSK_SHIFT)) & I3C_INTMASKED_RXPMSK_MASK)

#define I3C_INTMASKED_SPMSK_SHIFT               (10)
#define I3C_INTMASKED_SPMSK_MASK                (0x1U << I3C_INTMASKED_SPMSK_SHIFT)
#define I3C_INTMASKED_SPMSK(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_SPMSK_SHIFT)) & I3C_INTMASKED_SPMSK_MASK)

#define I3C_INTMASKED_MATEDMSK_SHIFT            (9)
#define I3C_INTMASKED_MATEDMSK_MASK             (0x1U << I3C_INTMASKED_MATEDMSK_SHIFT)
#define I3C_INTMASKED_MATEDMSK(x)               (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_MATEDMSK_SHIFT)) & I3C_INTMASKED_MATEDMSK_MASK)

#define I3C_INTMASKED_STMSK_SHIFT               (8)
#define I3C_INTMASKED_STMSK_MASK                (0x1U << I3C_INTMASKED_STMSK_SHIFT)
#define I3C_INTMASKED_STMSK(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_STMSK_SHIFT)) & I3C_INTMASKED_STMSK_MASK)

/*!
 * @brief I3C_ERWAR Register Bit Definition
 */

#define I3C_ERWAR_OWRITE_SHIFT                  (17)
#define I3C_ERWAR_OWRITE_MASK                   (0x1U << I3C_ERWAR_OWRITE_SHIFT)
#define I3C_ERWAR_OWRITE(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_ERWAR_OWRITE_SHIFT)) & I3C_ERWAR_OWRITE_MASK)

#define I3C_ERWAR_OREAD_SHIFT                   (16)
#define I3C_ERWAR_OREAD_MASK                    (0x1U << I3C_ERWAR_OREAD_SHIFT)
#define I3C_ERWAR_OREAD(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_ERWAR_OREAD_SHIFT)) & I3C_ERWAR_OREAD_MASK)

#define I3C_ERWAR_S0S1_SHIFT                    (11)
#define I3C_ERWAR_S0S1_MASK                     (0x1U << I3C_ERWAR_S0S1_SHIFT)
#define I3C_ERWAR_S0S1(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_ERWAR_S0S1_SHIFT)) & I3C_ERWAR_S0S1_MASK)

#define I3C_ERWAR_SPAR_SHIFT                    (8)
#define I3C_ERWAR_SPAR_MASK                     (0x1U << I3C_ERWAR_SPAR_SHIFT)
#define I3C_ERWAR_SPAR(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_ERWAR_SPAR_SHIFT)) & I3C_ERWAR_SPAR_MASK)

