UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define I3C_ERWAR_INVST_SHIFT                   (4)
#define I3C_ERWAR_INVST_MASK                    (0x1U << I3C_ERWAR_INVST_SHIFT)
#define I3C_ERWAR_INVST(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_ERWAR_INVST_SHIFT)) & I3C_ERWAR_INVST_MASK)

#define I3C_ERWAR_TERM_SHIFT                    (3)
#define I3C_ERWAR_TERM_MASK                     (0x1U << I3C_ERWAR_TERM_SHIFT)
#define I3C_ERWAR_TERM(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_ERWAR_TERM_SHIFT)) & I3C_ERWAR_TERM_MASK)

#define I3C_ERWAR_URUNNACK_SHIFT                (2)
#define I3C_ERWAR_URUNNACK_MASK                 (0x1U << I3C_ERWAR_URUNNACK_SHIFT)
#define I3C_ERWAR_URUNNACK(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_ERWAR_URUNNACK_SHIFT)) & I3C_ERWAR_URUNNACK_MASK)

#define I3C_ERWAR_URUN_SHIFT                    (1)
#define I3C_ERWAR_URUN_MASK                     (0x1U << I3C_ERWAR_URUN_SHIFT)
#define I3C_ERWAR_URUN(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_ERWAR_URUN_SHIFT)) & I3C_ERWAR_URUN_MASK)

#define I3C_ERWAR_ORUN_SHIFT                    (0)
#define I3C_ERWAR_ORUN_MASK                     (0x1U << I3C_ERWAR_ORUN_SHIFT)
#define I3C_ERWAR_ORUN(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_ERWAR_ORUN_SHIFT)) & I3C_ERWAR_ORUN_MASK)

/*!
 * @brief I3C_DMACTRL Register Bit Definition
 */

#define I3C_DMACTRL_DMAWTH_SHIFT                (4)
#define I3C_DMACTRL_DMAWTH_MASK                 (0x3U << I3C_DMACTRL_DMAWTH_SHIFT)
#define I3C_DMACTRL_DMAWTH(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_DMACTRL_DMAWTH_SHIFT)) & I3C_DMACTRL_DMAWTH_MASK)

#define I3C_DMACTRL_DMATB_SHIFT                 (2)
#define I3C_DMACTRL_DMATB_MASK                  (0x3U << I3C_DMACTRL_DMATB_SHIFT)
#define I3C_DMACTRL_DMATB(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_DMACTRL_DMATB_SHIFT)) & I3C_DMACTRL_DMATB_MASK)

#define I3C_DMACTRL_DMAFB_SHIFT                 (0)
#define I3C_DMACTRL_DMAFB_MASK                  (0x3U << I3C_DMACTRL_DMAFB_SHIFT)
#define I3C_DMACTRL_DMAFB(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_DMACTRL_DMAFB_SHIFT)) & I3C_DMACTRL_DMAFB_MASK)

/*!
 * @brief I3C_DATACTRL Register Bit Definition
 */

#define I3C_DATACTRL_RXEMPTY_SHIFT              (31)
#define I3C_DATACTRL_RXEMPTY_MASK               (0x1U << I3C_DATACTRL_RXEMPTY_SHIFT)
#define I3C_DATACTRL_RXEMPTY(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_RXEMPTY_SHIFT)) & I3C_DATACTRL_RXEMPTY_MASK)

#define I3C_DATACTRL_TXFULL_SHIFT               (30)
#define I3C_DATACTRL_TXFULL_MASK                (0x1U << I3C_DATACTRL_TXFULL_SHIFT)
#define I3C_DATACTRL_TXFULL(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_TXFULL_SHIFT)) & I3C_DATACTRL_TXFULL_MASK)

#define I3C_DATACTRL_RXCNT_SHIFT                (24)
#define I3C_DATACTRL_RXCNT_MASK                 (0x1FU << I3C_DATACTRL_RXCNT_SHIFT)
#define I3C_DATACTRL_RXCNT(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_RXCNT_SHIFT)) & I3C_DATACTRL_RXCNT_MASK)

#define I3C_DATACTRL_TXCNT_SHIFT                (16)
#define I3C_DATACTRL_TXCNT_MASK                 (0x1FU << I3C_DATACTRL_TXCNT_SHIFT)
#define I3C_DATACTRL_TXCNT(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_TXCNT_SHIFT)) & I3C_DATACTRL_TXCNT_MASK)

#define I3C_DATACTRL_RXTRIG_SHIFT               (6)
#define I3C_DATACTRL_RXTRIG_MASK                (0x3U << I3C_DATACTRL_RXTRIG_SHIFT)
#define I3C_DATACTRL_RXTRIG(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_RXTRIG_SHIFT)) & I3C_DATACTRL_RXTRIG_MASK)

#define I3C_DATACTRL_TXTRIG_SHIFT               (4)
#define I3C_DATACTRL_TXTRIG_MASK                (0x3U << I3C_DATACTRL_TXTRIG_SHIFT)
#define I3C_DATACTRL_TXTRIG(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_TXTRIG_SHIFT)) & I3C_DATACTRL_TXTRIG_MASK)

#define I3C_DATACTRL_UNLOCK_SHIFT               (3)
#define I3C_DATACTRL_UNLOCK_MASK                (0x1U << I3C_DATACTRL_UNLOCK_SHIFT)
#define I3C_DATACTRL_UNLOCK(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_UNLOCK_SHIFT)) & I3C_DATACTRL_UNLOCK_MASK)

#define I3C_DATACTRL_FLUSHFB_SHIFT              (1)
#define I3C_DATACTRL_FLUSHFB_MASK               (0x1U << I3C_DATACTRL_FLUSHFB_SHIFT)
#define I3C_DATACTRL_FLUSHFB(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_FLUSHFB_SHIFT)) & I3C_DATACTRL_FLUSHFB_MASK)

#define I3C_DATACTRL_FLUSHTB_SHIFT              (0)
#define I3C_DATACTRL_FLUSHTB_MASK               (0x1U << I3C_DATACTRL_FLUSHTB_SHIFT)
#define I3C_DATACTRL_FLUSHTB(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_FLUSHTB_SHIFT)) & I3C_DATACTRL_FLUSHTB_MASK)

/*!
 * @brief I3C_WDATAB Register Bit Definition
 */

#define I3C_WDATAB_END2_SHIFT                   (16)
#define I3C_WDATAB_END2_MASK                    (0x1U << I3C_WDATAB_END2_SHIFT)
#define I3C_WDATAB_END2(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_WDATAB_END2_SHIFT)) & I3C_WDATAB_END2_MASK)

#define I3C_WDATAB_END_SHIFT                    (8)
#define I3C_WDATAB_END_MASK                     (0x1U << I3C_WDATAB_END_SHIFT)
#define I3C_WDATAB_END(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_WDATAB_END_SHIFT)) & I3C_WDATAB_END_MASK)

#define I3C_WDATAB_DATA_SHIFT                   (0)
#define I3C_WDATAB_DATA_MASK                    (0xFFU << I3C_WDATAB_DATA_SHIFT)
#define I3C_WDATAB_DATA(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_WDATAB_DATA_SHIFT)) & I3C_WDATAB_DATA_MASK)

/*!
 * @brief I3C_WDATABE Register Bit Definition
 */

#define I3C_WDATABE_DATA_SHIFT                  (0)
#define I3C_WDATABE_DATA_MASK                   (0xFFU << I3C_WDATABE_DATA_SHIFT)
#define I3C_WDATABE_DATA(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_WDATABE_DATA_SHIFT)) & I3C_WDATABE_DATA_MASK)

/*!
 * @brief I3C_WDATAH Register Bit Definition
 */

#define I3C_WDATAH_END_SHIFT                    (16)
#define I3C_WDATAH_END_MASK                     (0x1U << I3C_WDATAH_END_SHIFT)
#define I3C_WDATAH_END(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_WDATAH_END_SHIFT)) & I3C_WDATAH_END_MASK)

#define I3C_WDATAH_DATA1_SHIFT                  (8)
#define I3C_WDATAH_DATA1_MASK                   (0xFFU << I3C_WDATAH_DATA1_SHIFT)
#define I3C_WDATAH_DATA1(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_WDATAH_DATA1_SHIFT)) & I3C_WDATAH_DATA1_MASK)

#define I3C_WDATAH_DATA0_SHIFT                  (0)
#define I3C_WDATAH_DATA0_MASK                   (0xFFU << I3C_WDATAH_DATA0_SHIFT)
#define I3C_WDATAH_DATA0(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_WDATAH_DATA0_SHIFT)) & I3C_WDATAH_DATA0_MASK)

/*!
 * @brief I3C_WDATAHE Register Bit Definition
 */

#define I3C_WDATAHE_DATA1_SHIFT                 (8)
#define I3C_WDATAHE_DATA1_MASK                  (0xFFU << I3C_WDATAHE_DATA1_SHIFT)
#define I3C_WDATAHE_DATA1(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_WDATAHE_DATA1_SHIFT)) & I3C_WDATAHE_DATA1_MASK)

