UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define I3C_WDATAHE_DATA0_SHIFT                 (0)
#define I3C_WDATAHE_DATA0_MASK                  (0xFFU << I3C_WDATAHE_DATA0_SHIFT)
#define I3C_WDATAHE_DATA0(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_WDATAHE_DATA0_SHIFT)) & I3C_WDATAHE_DATA0_MASK)

/*!
 * @brief I3C_RDATAB Register Bit Definition
 */

#define I3C_RDATAB_DATA0_SHIFT                  (0)
#define I3C_RDATAB_DATA0_MASK                   (0xFFU << I3C_RDATAB_DATA0_SHIFT)
#define I3C_RDATAB_DATA0(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_RDATAB_DATA0_SHIFT)) & I3C_RDATAB_DATA0_MASK)

/*!
 * @brief I3C_RDATAH Register Bit Definition
 */

#define I3C_RDATAH_MSB_SHIFT                    (8)
#define I3C_RDATAH_MSB_MASK                     (0xFFU << I3C_RDATAH_MSB_SHIFT)
#define I3C_RDATAH_MSB(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_RDATAH_MSB_SHIFT)) & I3C_RDATAH_MSB_MASK)

#define I3C_RDATAH_LSB_SHIFT                    (0)
#define I3C_RDATAH_LSB_MASK                     (0xFFU << I3C_RDATAH_LSB_SHIFT)
#define I3C_RDATAH_LSB(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_RDATAH_LSB_SHIFT)) & I3C_RDATAH_LSB_MASK)

/*!
 * @brief I3C_WDATAB1 Register Bit Definition
 */

#define I3C_WDATAB1_DATA_SHIFT                  (0)
#define I3C_WDATAB1_DATA_MASK                   (0xFFU << I3C_WDATAB1_DATA_SHIFT)
#define I3C_WDATAB1_DATA(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_WDATAB1_DATA_SHIFT)) & I3C_WDATAB1_DATA_MASK)

/*!
 * @brief I3C_CAPABILITIES2 Register Bit Definition
 */

#define I3C_CAPABILITIES2_SSTWR_SHIFT           (23)
#define I3C_CAPABILITIES2_SSTWR_MASK            (0x1U << I3C_CAPABILITIES2_SSTWR_SHIFT)
#define I3C_CAPABILITIES2_SSTWR(x)              (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES2_SSTWR_SHIFT)) & I3C_CAPABILITIES2_SSTWR_MASK)

#define I3C_CAPABILITIES2_SSTSUB_SHIFT          (22)
#define I3C_CAPABILITIES2_SSTSUB_MASK           (0x1U << I3C_CAPABILITIES2_SSTSUB_SHIFT)
#define I3C_CAPABILITIES2_SSTSUB(x)             (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES2_SSTSUB_SHIFT)) & I3C_CAPABILITIES2_SSTSUB_MASK)

#define I3C_CAPABILITIES2_AASA_SHIFT            (21)
#define I3C_CAPABILITIES2_AASA_MASK             (0x1U << I3C_CAPABILITIES2_AASA_SHIFT)
#define I3C_CAPABILITIES2_AASA(x)               (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES2_AASA_SHIFT)) & I3C_CAPABILITIES2_AASA_MASK)

#define I3C_CAPABILITIES2_GROUP_SHIFT           (18)
#define I3C_CAPABILITIES2_GROUP_MASK            (0x3U << I3C_CAPABILITIES2_GROUP_SHIFT)
#define I3C_CAPABILITIES2_GROUP(x)              (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES2_GROUP_SHIFT)) & I3C_CAPABILITIES2_GROUP_MASK)

#define I3C_CAPABILITIES2_SLVRST_SHIFT          (17)
#define I3C_CAPABILITIES2_SLVRST_MASK           (0x1U << I3C_CAPABILITIES2_SLVRST_SHIFT)
#define I3C_CAPABILITIES2_SLVRST(x)             (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES2_SLVRST_SHIFT)) & I3C_CAPABILITIES2_SLVRST_MASK)

#define I3C_CAPABILITIES2_V1P1_SHIFT            (16)
#define I3C_CAPABILITIES2_V1P1_MASK             (0x1U << I3C_CAPABILITIES2_V1P1_SHIFT)
#define I3C_CAPABILITIES2_V1P1(x)               (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES2_V1P1_SHIFT)) & I3C_CAPABILITIES2_V1P1_MASK)

#define I3C_CAPABILITIES2_IBIFIFO_SHIFT         (9)
#define I3C_CAPABILITIES2_IBIFIFO_MASK          (0x1U << I3C_CAPABILITIES2_IBIFIFO_SHIFT)
#define I3C_CAPABILITIES2_IBIFIFO(x)            (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES2_IBIFIFO_SHIFT)) & I3C_CAPABILITIES2_IBIFIFO_MASK)

#define I3C_CAPABILITIES2_IBIEXT_SHIFT          (8)
#define I3C_CAPABILITIES2_IBIEXT_MASK           (0x1U << I3C_CAPABILITIES2_IBIEXT_SHIFT)
#define I3C_CAPABILITIES2_IBIEXT(x)             (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES2_IBIEXT_SHIFT)) & I3C_CAPABILITIES2_IBIEXT_MASK)

#define I3C_CAPABILITIES2_I2CDEVID_SHIFT        (6)
#define I3C_CAPABILITIES2_I2CDEVID_MASK         (0x1U << I3C_CAPABILITIES2_I2CDEVID_SHIFT)
#define I3C_CAPABILITIES2_I2CDEVID(x)           (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES2_I2CDEVID_SHIFT)) & I3C_CAPABILITIES2_I2CDEVID_MASK)

#define I3C_CAPABILITIES2_I2CRST_SHIFT          (5)
#define I3C_CAPABILITIES2_I2CRST_MASK           (0x1U << I3C_CAPABILITIES2_I2CRST_SHIFT)
#define I3C_CAPABILITIES2_I2CRST(x)             (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES2_I2CRST_SHIFT)) & I3C_CAPABILITIES2_I2CRST_MASK)

#define I3C_CAPABILITIES2_I2C10B_SHIFT          (4)
#define I3C_CAPABILITIES2_I2C10B_MASK           (0x1U << I3C_CAPABILITIES2_I2C10B_SHIFT)
#define I3C_CAPABILITIES2_I2C10B(x)             (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES2_I2C10B_SHIFT)) & I3C_CAPABILITIES2_I2C10B_MASK)

#define I3C_CAPABILITIES2_MAPCNT_SHIFT          (0)
#define I3C_CAPABILITIES2_MAPCNT_MASK           (0xFU << I3C_CAPABILITIES2_MAPCNT_SHIFT)
#define I3C_CAPABILITIES2_MAPCNT(x)             (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES2_MAPCNT_SHIFT)) & I3C_CAPABILITIES2_MAPCNT_MASK)

/*!
 * @brief I3C_CAPABILITIES Register Bit Definition
 */

#define I3C_CAPABILITIES_DMA_SHIFT              (31)
#define I3C_CAPABILITIES_DMA_MASK               (0x1U << I3C_CAPABILITIES_DMA_SHIFT)
#define I3C_CAPABILITIES_DMA(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_DMA_SHIFT)) & I3C_CAPABILITIES_DMA_MASK)

#define I3C_CAPABILITIES_INT_SHIFT              (30)
#define I3C_CAPABILITIES_INT_MASK               (0x1U << I3C_CAPABILITIES_INT_SHIFT)
#define I3C_CAPABILITIES_INT(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_INT_SHIFT)) & I3C_CAPABILITIES_INT_MASK)

#define I3C_CAPABILITIES_FIFORX_SHIFT           (28)
#define I3C_CAPABILITIES_FIFORX_MASK            (0x3U << I3C_CAPABILITIES_FIFORX_SHIFT)
#define I3C_CAPABILITIES_FIFORX(x)              (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_FIFORX_SHIFT)) & I3C_CAPABILITIES_FIFORX_MASK)

#define I3C_CAPABILITIES_FIFOTX_SHIFT           (26)
#define I3C_CAPABILITIES_FIFOTX_MASK            (0x3U << I3C_CAPABILITIES_FIFOTX_SHIFT)
#define I3C_CAPABILITIES_FIFOTX(x)              (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_FIFOTX_SHIFT)) & I3C_CAPABILITIES_FIFOTX_MASK)

