UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define I3C_CAPABILITIES_EXTFIFO_SHIFT          (23)
#define I3C_CAPABILITIES_EXTFIFO_MASK           (0x7U << I3C_CAPABILITIES_EXTFIFO_SHIFT)
#define I3C_CAPABILITIES_EXTFIFO(x)             (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_EXTFIFO_SHIFT)) & I3C_CAPABILITIES_EXTFIFO_MASK)

#define I3C_CAPABILITIES_TIMECTRL_SHIFT         (21)
#define I3C_CAPABILITIES_TIMECTRL_MASK          (0x1U << I3C_CAPABILITIES_TIMECTRL_SHIFT)
#define I3C_CAPABILITIES_TIMECTRL(x)            (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_TIMECTRL_SHIFT)) & I3C_CAPABILITIES_TIMECTRL_MASK)

#define I3C_CAPABILITIES_IBIMRHJ_SHIFT          (16)
#define I3C_CAPABILITIES_IBIMRHJ_MASK           (0x1FU << I3C_CAPABILITIES_IBIMRHJ_SHIFT)
#define I3C_CAPABILITIES_IBIMRHJ(x)             (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_IBIMRHJ_SHIFT)) & I3C_CAPABILITIES_IBIMRHJ_MASK)

#define I3C_CAPABILITIES_CCCHANDLE_SHIFT        (12)
#define I3C_CAPABILITIES_CCCHANDLE_MASK         (0xFU << I3C_CAPABILITIES_CCCHANDLE_SHIFT)
#define I3C_CAPABILITIES_CCCHANDLE(x)           (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_CCCHANDLE_SHIFT)) & I3C_CAPABILITIES_CCCHANDLE_MASK)

#define I3C_CAPABILITIES_SADDR_SHIFT            (10)
#define I3C_CAPABILITIES_SADDR_MASK             (0x3U << I3C_CAPABILITIES_SADDR_SHIFT)
#define I3C_CAPABILITIES_SADDR(x)               (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_SADDR_SHIFT)) & I3C_CAPABILITIES_SADDR_MASK)

#define I3C_CAPABILITIES_MASTER_SHIFT           (9)
#define I3C_CAPABILITIES_MASTER_MASK            (0x1U << I3C_CAPABILITIES_MASTER_SHIFT)
#define I3C_CAPABILITIES_MASTER(x)              (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_MASTER_SHIFT)) & I3C_CAPABILITIES_MASTER_MASK)

#define I3C_CAPABILITIES_HDRSUPP_SHIFT          (6)
#define I3C_CAPABILITIES_HDRSUPP_MASK           (0x7U << I3C_CAPABILITIES_HDRSUPP_SHIFT)
#define I3C_CAPABILITIES_HDRSUPP(x)             (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_HDRSUPP_SHIFT)) & I3C_CAPABILITIES_HDRSUPP_MASK)

#define I3C_CAPABILITIES_IDREG_SHIFT            (2)
#define I3C_CAPABILITIES_IDREG_MASK             (0xFU << I3C_CAPABILITIES_IDREG_SHIFT)
#define I3C_CAPABILITIES_IDREG(x)               (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_IDREG_SHIFT)) & I3C_CAPABILITIES_IDREG_MASK)

#define I3C_CAPABILITIES_IDENA_SHIFT            (0)
#define I3C_CAPABILITIES_IDENA_MASK             (0x3U << I3C_CAPABILITIES_IDENA_SHIFT)
#define I3C_CAPABILITIES_IDENA(x)               (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_IDENA_SHIFT)) & I3C_CAPABILITIES_IDENA_MASK)

/*!
 * @brief I3C_DYNADDR Register Bit Definition
 */

#define I3C_DYNADDR_KEY_SHIFT                   (16)
#define I3C_DYNADDR_KEY_MASK                    (0xFFFFU << I3C_DYNADDR_KEY_SHIFT)
#define I3C_DYNADDR_KEY(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_DYNADDR_KEY_SHIFT)) & I3C_DYNADDR_KEY_MASK)

#define I3C_DYNADDR_DCAUSE_SHIFT                (8)
#define I3C_DYNADDR_DCAUSE_MASK                 (0x7U << I3C_DYNADDR_DCAUSE_SHIFT)
#define I3C_DYNADDR_DCAUSE(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_DYNADDR_DCAUSE_SHIFT)) & I3C_DYNADDR_DCAUSE_MASK)

#define I3C_DYNADDR_DADDR_SHIFT                 (1)
#define I3C_DYNADDR_DADDR_MASK                  (0x7FU << I3C_DYNADDR_DADDR_SHIFT)
#define I3C_DYNADDR_DADDR(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_DYNADDR_DADDR_SHIFT)) & I3C_DYNADDR_DADDR_MASK)

#define I3C_DYNADDR_DAVLD_SHIFT                 (0)
#define I3C_DYNADDR_DAVLD_MASK                  (0x1U << I3C_DYNADDR_DAVLD_SHIFT)
#define I3C_DYNADDR_DAVLD(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_DYNADDR_DAVLD_SHIFT)) & I3C_DYNADDR_DAVLD_MASK)

/*!
 * @brief I3C_MAXLIMITS Register Bit Definition
 */

#define I3C_MAXLIMITS_MAXWR_SHIFT               (16)
#define I3C_MAXLIMITS_MAXWR_MASK                (0xFFFU << I3C_MAXLIMITS_MAXWR_SHIFT)
#define I3C_MAXLIMITS_MAXWR(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_MAXLIMITS_MAXWR_SHIFT)) & I3C_MAXLIMITS_MAXWR_MASK)

#define I3C_MAXLIMITS_MAXRD_SHIFT               (0)
#define I3C_MAXLIMITS_MAXRD_MASK                (0xFFFU << I3C_MAXLIMITS_MAXRD_SHIFT)
#define I3C_MAXLIMITS_MAXRD(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_MAXLIMITS_MAXRD_SHIFT)) & I3C_MAXLIMITS_MAXRD_MASK)

/*!
 * @brief I3C_IDPARTNO Register Bit Definition
 */

#define I3C_IDPARTNO_PARTNO_SHIFT                 (0)
#define I3C_IDPARTNO_PARTNO_MASK                  (0xFFFFFFFFU << I3C_IDPARTNO_PARTNO_SHIFT)
#define I3C_IDPARTNO_PARTNO(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_IDPARTNO_PARTNO_SHIFT)) & I3C_IDPARTNO_PARTNO_MASK)

/*!
 * @brief I3C_IDEXT Register Bit Definition
 */

#define I3C_IDEXT_BCR_SHIFT                     (16)
#define I3C_IDEXT_BCR_MASK                      (0xFFU << I3C_IDEXT_BCR_SHIFT)
#define I3C_IDEXT_BCR(x)                        (((uint32_t)(((uint32_t)(x)) << I3C_IDEXT_BCR_SHIFT)) & I3C_IDEXT_BCR_MASK)

#define I3C_IDEXT_DCR_SHIFT                     (8)
#define I3C_IDEXT_DCR_MASK                      (0xFFU << I3C_IDEXT_DCR_SHIFT)
#define I3C_IDEXT_DCR(x)                        (((uint32_t)(((uint32_t)(x)) << I3C_IDEXT_DCR_SHIFT)) & I3C_IDEXT_DCR_MASK)

/*!
 * @brief I3C_VENDORID Register Bit Definition
 */

#define I3C_VENDORID_VID_SHIFT                  (0)
#define I3C_VENDORID_VID_MASK                   (0x7FFFU << I3C_VENDORID_VID_SHIFT)
#define I3C_VENDORID_VID(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_VENDORID_VID_SHIFT)) & I3C_VENDORID_VID_MASK)

/*!
 * @brief I3C_DIV Register Bit Definition
 */

#define I3C_DIV_DIV_SHIFT                       (0)
#define I3C_DIV_DIV_MASK                        (0xFFU << I3C_DIV_DIV_SHIFT)
#define I3C_DIV_DIV(x)                          (((uint32_t)(((uint32_t)(x)) << I3C_DIV_DIV_SHIFT)) & I3C_DIV_DIV_MASK)

/*!
 * @brief I3C_SPKLEN Register Bit Definition
 */

#define I3C_SPKLEN_FLTEN_SHIFT                  (16)
#define I3C_SPKLEN_FLTEN_MASK                   (0x1U << I3C_SPKLEN_FLTEN_SHIFT)
#define I3C_SPKLEN_FLTEN(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_SPKLEN_FLTEN_SHIFT)) & I3C_SPKLEN_FLTEN_MASK)

