UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define I3C_SPKLEN_SPKLEN_SHIFT                 (0)
#define I3C_SPKLEN_SPKLEN_MASK                  (0xFFU << I3C_SPKLEN_SPKLEN_SHIFT)
#define I3C_SPKLEN_SPKLEN(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_SPKLEN_SPKLEN_SHIFT)) & I3C_SPKLEN_SPKLEN_MASK)

/*!
 * @}
 */ /* end of group I3C_Register_Masks */
/******************************************************************************
 *I3C Instance
*******************************************************************************/

#define I3C                  ((I3C_Type*)I3C1_BASE)

/*!
 * @}
 */ /* end of group I3C_Peripheral_Access_Layer */



/*!
 * @addtogroup IWDG_Peripheral_Access_Layer IWDG Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * IWDG Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t KR;                                                           ///< Key register                                 offset: 0x00
    __IO uint32_t PR;                                                           ///< Prescaler register                           offset: 0x04
    __IO uint32_t RLR;                                                          ///< Reload register                              offset: 0x08
    __IO uint32_t SR;                                                           ///< Status register                              offset: 0x0C
    __IO uint32_t CR;                                                           ///< Control register                             offset: 0x10
    __IO uint32_t IGEN;                                                         ///< Interrupt generate register                  offset: 0x14
    __IO uint32_t CNT;                                                          ///< Counter register                             offset: 0x18
} IWDG_Type;

/*******************************************************************************
 * IWDG Type
 ******************************************************************************/

/*!
 * @addtogroup IWDG_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief IWDG_KR Register Bit Definition
 */

#define IWDG_KR_KEY_SHIFT                       (0)
#define IWDG_KR_KEY_MASK                        (0xFFFFU << IWDG_KR_KEY_SHIFT)
#define IWDG_KR_KEY(x)                          (((uint32_t)(((uint32_t)(x)) << IWDG_KR_KEY_SHIFT)) & IWDG_KR_KEY_MASK)

/*!
 * @brief IWDG_PR Register Bit Definition
 */

#define IWDG_PR_PR_SHIFT                        (0)
#define IWDG_PR_PR_MASK                         (0x7U << IWDG_PR_PR_SHIFT)
#define IWDG_PR_PR(x)                           (((uint32_t)(((uint32_t)(x)) << IWDG_PR_PR_SHIFT)) & IWDG_PR_PR_MASK)

/*!
 * @brief IWDG_RLR Register Bit Definition
 */

#define IWDG_RLR_RL_SHIFT                       (0)
#define IWDG_RLR_RL_MASK                        (0xFFFU << IWDG_RLR_RL_SHIFT)
#define IWDG_RLR_RL(x)                          (((uint32_t)(((uint32_t)(x)) << IWDG_RLR_RL_SHIFT)) & IWDG_RLR_RL_MASK)

/*!
 * @brief IWDG_SR Register Bit Definition
 */

#define IWDG_SR_UPDATE_SHIFT                    (3)
#define IWDG_SR_UPDATE_MASK                     (0x1U << IWDG_SR_UPDATE_SHIFT)
#define IWDG_SR_UPDATE(x)                       (((uint32_t)(((uint32_t)(x)) << IWDG_SR_UPDATE_SHIFT)) & IWDG_SR_UPDATE_MASK)

#define IWDG_SR_IVU_SHIFT                       (2)
#define IWDG_SR_IVU_MASK                        (0x1U << IWDG_SR_IVU_SHIFT)
#define IWDG_SR_IVU(x)                          (((uint32_t)(((uint32_t)(x)) << IWDG_SR_IVU_SHIFT)) & IWDG_SR_IVU_MASK)

#define IWDG_SR_RVU_SHIFT                       (1)
#define IWDG_SR_RVU_MASK                        (0x1U << IWDG_SR_RVU_SHIFT)
#define IWDG_SR_RVU(x)                          (((uint32_t)(((uint32_t)(x)) << IWDG_SR_RVU_SHIFT)) & IWDG_SR_RVU_MASK)

#define IWDG_SR_PVU_SHIFT                       (0)
#define IWDG_SR_PVU_MASK                        (0x1U << IWDG_SR_PVU_SHIFT)
#define IWDG_SR_PVU(x)                          (((uint32_t)(((uint32_t)(x)) << IWDG_SR_PVU_SHIFT)) & IWDG_SR_PVU_MASK)

/*!
 * @brief IWDG_CR Register Bit Definition
 */

#define IWDG_CR_IRQCLR_SHIFT                    (1)
#define IWDG_CR_IRQCLR_MASK                     (0x1U << IWDG_CR_IRQCLR_SHIFT)
#define IWDG_CR_IRQCLR(x)                       (((uint32_t)(((uint32_t)(x)) << IWDG_CR_IRQCLR_SHIFT)) & IWDG_CR_IRQCLR_MASK)

#define IWDG_CR_IRQSEL_SHIFT                    (0)
#define IWDG_CR_IRQSEL_MASK                     (0x1U << IWDG_CR_IRQSEL_SHIFT)
#define IWDG_CR_IRQSEL(x)                       (((uint32_t)(((uint32_t)(x)) << IWDG_CR_IRQSEL_SHIFT)) & IWDG_CR_IRQSEL_MASK)

/*!
 * @brief IWDG_IGEN Register Bit Definition
 */

#define IWDG_IGEN_IGEN_SHIFT                    (0)
#define IWDG_IGEN_IGEN_MASK                     (0xFFFU << IWDG_IGEN_IGEN_SHIFT)
#define IWDG_IGEN_IGEN(x)                       (((uint32_t)(((uint32_t)(x)) << IWDG_IGEN_IGEN_SHIFT)) & IWDG_IGEN_IGEN_MASK)

/*!
 * @brief IWDG_CNT Register Bit Definition
 */

#define IWDG_CNT_IWDGCNT_SHIFT                  (8)
#define IWDG_CNT_IWDGCNT_MASK                   (0x7FFU << IWDG_CNT_IWDGCNT_SHIFT)
#define IWDG_CNT_IWDGCNT(x)                     (((uint32_t)(((uint32_t)(x)) << IWDG_CNT_IWDGCNT_SHIFT)) & IWDG_CNT_IWDGCNT_MASK)

#define IWDG_CNT_IWDGPS_SHIFT                   (0)
#define IWDG_CNT_IWDGPS_MASK                    (0xFFU << IWDG_CNT_IWDGPS_SHIFT)
#define IWDG_CNT_IWDGPS(x)                      (((uint32_t)(((uint32_t)(x)) << IWDG_CNT_IWDGPS_SHIFT)) & IWDG_CNT_IWDGPS_MASK)

/*!
 * @}
 */ /* end of group IWDG_Register_Masks */
/******************************************************************************
 *IWDG Instance
*******************************************************************************/

#define IWDG                 ((IWDG_Type*)IWDG_BASE)

/*!
 * @}
 */ /* end of group IWDG_Peripheral_Access_Layer */



/*!
 * @addtogroup LPTIM_Peripheral_Access_Layer LPTIM Peripheral Access Layer
 *  @{
 */

