UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
/*******************************************************************************
 * PWR Type
 ******************************************************************************/

/*!
 * @addtogroup PWR_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief PWR_CR Register Bit Definition
 */

#define PWR_CR_STDBYFSWK_SHIFT                  (14)
#define PWR_CR_STDBYFSWK_MASK                   (0x3U << PWR_CR_STDBYFSWK_SHIFT)
#define PWR_CR_STDBYFSWK(x)                     (((uint32_t)(((uint32_t)(x)) << PWR_CR_STDBYFSWK_SHIFT)) & PWR_CR_STDBYFSWK_MASK)

#define PWR_CR_PLS_SHIFT                        (9)
#define PWR_CR_PLS_MASK                         (0xFU << PWR_CR_PLS_SHIFT)
#define PWR_CR_PLS(x)                           (((uint32_t)(((uint32_t)(x)) << PWR_CR_PLS_SHIFT)) & PWR_CR_PLS_MASK)

#define PWR_CR_PVDE_SHIFT                       (4)
#define PWR_CR_PVDE_MASK                        (0x1U << PWR_CR_PVDE_SHIFT)
#define PWR_CR_PVDE(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_CR_PVDE_SHIFT)) & PWR_CR_PVDE_MASK)

#define PWR_CR_CSBF_SHIFT                       (3)
#define PWR_CR_CSBF_MASK                        (0x1U << PWR_CR_CSBF_SHIFT)
#define PWR_CR_CSBF(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_CR_CSBF_SHIFT)) & PWR_CR_CSBF_MASK)

#define PWR_CR_CWUF_SHIFT                       (2)
#define PWR_CR_CWUF_MASK                        (0x1U << PWR_CR_CWUF_SHIFT)
#define PWR_CR_CWUF(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_CR_CWUF_SHIFT)) & PWR_CR_CWUF_MASK)

#define PWR_CR_PDDS_SHIFT                       (1)
#define PWR_CR_PDDS_MASK                        (0x1U << PWR_CR_PDDS_SHIFT)
#define PWR_CR_PDDS(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_CR_PDDS_SHIFT)) & PWR_CR_PDDS_MASK)

#define PWR_CR_LPDS_SHIFT                       (0)
#define PWR_CR_LPDS_MASK                        (0x1U << PWR_CR_LPDS_SHIFT)
#define PWR_CR_LPDS(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_CR_LPDS_SHIFT)) & PWR_CR_LPDS_MASK)

/*!
 * @brief PWR_CSR Register Bit Definition
 */

#define PWR_CSR_EWUP6_SHIFT                     (13)
#define PWR_CSR_EWUP6_MASK                      (0x1U << PWR_CSR_EWUP6_SHIFT)
#define PWR_CSR_EWUP6(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_CSR_EWUP6_SHIFT)) & PWR_CSR_EWUP6_MASK)

#define PWR_CSR_EWUP5_SHIFT                     (12)
#define PWR_CSR_EWUP5_MASK                      (0x1U << PWR_CSR_EWUP5_SHIFT)
#define PWR_CSR_EWUP5(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_CSR_EWUP5_SHIFT)) & PWR_CSR_EWUP5_MASK)

#define PWR_CSR_EWUP4_SHIFT                     (11)
#define PWR_CSR_EWUP4_MASK                      (0x1U << PWR_CSR_EWUP4_SHIFT)
#define PWR_CSR_EWUP4(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_CSR_EWUP4_SHIFT)) & PWR_CSR_EWUP4_MASK)

#define PWR_CSR_EWUP2_SHIFT                     (9)
#define PWR_CSR_EWUP2_MASK                      (0x1U << PWR_CSR_EWUP2_SHIFT)
#define PWR_CSR_EWUP2(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_CSR_EWUP2_SHIFT)) & PWR_CSR_EWUP2_MASK)

#define PWR_CSR_EWUP1_SHIFT                     (8)
#define PWR_CSR_EWUP1_MASK                      (0x1U << PWR_CSR_EWUP1_SHIFT)
#define PWR_CSR_EWUP1(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_CSR_EWUP1_SHIFT)) & PWR_CSR_EWUP1_MASK)

#define PWR_CSR_PVDO_SHIFT                      (2)
#define PWR_CSR_PVDO_MASK                       (0x1U << PWR_CSR_PVDO_SHIFT)
#define PWR_CSR_PVDO(x)                         (((uint32_t)(((uint32_t)(x)) << PWR_CSR_PVDO_SHIFT)) & PWR_CSR_PVDO_MASK)

#define PWR_CSR_SBF_SHIFT                       (1)
#define PWR_CSR_SBF_MASK                        (0x1U << PWR_CSR_SBF_SHIFT)
#define PWR_CSR_SBF(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_CSR_SBF_SHIFT)) & PWR_CSR_SBF_MASK)

#define PWR_CSR_WUF_SHIFT                       (0)
#define PWR_CSR_WUF_MASK                        (0x1U << PWR_CSR_WUF_SHIFT)
#define PWR_CSR_WUF(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_CSR_WUF_SHIFT)) & PWR_CSR_WUF_MASK)

/*!
 * @brief PWR_CR1 Register Bit Definition
 */

#define PWR_CR1_WKPEDGE6_SHIFT                  (5)
#define PWR_CR1_WKPEDGE6_MASK                   (0x1U << PWR_CR1_WKPEDGE6_SHIFT)
#define PWR_CR1_WKPEDGE6(x)                     (((uint32_t)(((uint32_t)(x)) << PWR_CR1_WKPEDGE6_SHIFT)) & PWR_CR1_WKPEDGE6_MASK)

#define PWR_CR1_WKPEDGE5_SHIFT                  (4)
#define PWR_CR1_WKPEDGE5_MASK                   (0x1U << PWR_CR1_WKPEDGE5_SHIFT)
#define PWR_CR1_WKPEDGE5(x)                     (((uint32_t)(((uint32_t)(x)) << PWR_CR1_WKPEDGE5_SHIFT)) & PWR_CR1_WKPEDGE5_MASK)

#define PWR_CR1_WKPEDGE4_SHIFT                  (3)
#define PWR_CR1_WKPEDGE4_MASK                   (0x1U << PWR_CR1_WKPEDGE4_SHIFT)
#define PWR_CR1_WKPEDGE4(x)                     (((uint32_t)(((uint32_t)(x)) << PWR_CR1_WKPEDGE4_SHIFT)) & PWR_CR1_WKPEDGE4_MASK)

#define PWR_CR1_WKPEDGE2_SHIFT                  (1)
#define PWR_CR1_WKPEDGE2_MASK                   (0x1U << PWR_CR1_WKPEDGE2_SHIFT)
#define PWR_CR1_WKPEDGE2(x)                     (((uint32_t)(((uint32_t)(x)) << PWR_CR1_WKPEDGE2_SHIFT)) & PWR_CR1_WKPEDGE2_MASK)

#define PWR_CR1_WKPEDGE1_SHIFT                  (0)
#define PWR_CR1_WKPEDGE1_MASK                   (0x1U << PWR_CR1_WKPEDGE1_SHIFT)
#define PWR_CR1_WKPEDGE1(x)                     (((uint32_t)(((uint32_t)(x)) << PWR_CR1_WKPEDGE1_SHIFT)) & PWR_CR1_WKPEDGE1_MASK)

/*!
 * @brief PWR_SR1 Register Bit Definition
 */

#define PWR_SR1_WUF6_SHIFT                      (5)
#define PWR_SR1_WUF6_MASK                       (0x1U << PWR_SR1_WUF6_SHIFT)
#define PWR_SR1_WUF6(x)                         (((uint32_t)(((uint32_t)(x)) << PWR_SR1_WUF6_SHIFT)) & PWR_SR1_WUF6_MASK)

#define PWR_SR1_WUF5_SHIFT                      (4)
#define PWR_SR1_WUF5_MASK                       (0x1U << PWR_SR1_WUF5_SHIFT)
#define PWR_SR1_WUF5(x)                         (((uint32_t)(((uint32_t)(x)) << PWR_SR1_WUF5_SHIFT)) & PWR_SR1_WUF5_MASK)

