UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define PWR_SR1_WUF4_SHIFT                      (3)
#define PWR_SR1_WUF4_MASK                       (0x1U << PWR_SR1_WUF4_SHIFT)
#define PWR_SR1_WUF4(x)                         (((uint32_t)(((uint32_t)(x)) << PWR_SR1_WUF4_SHIFT)) & PWR_SR1_WUF4_MASK)

#define PWR_SR1_WUF2_SHIFT                      (1)
#define PWR_SR1_WUF2_MASK                       (0x1U << PWR_SR1_WUF2_SHIFT)
#define PWR_SR1_WUF2(x)                         (((uint32_t)(((uint32_t)(x)) << PWR_SR1_WUF2_SHIFT)) & PWR_SR1_WUF2_MASK)

#define PWR_SR1_WUF1_SHIFT                      (0)
#define PWR_SR1_WUF1_MASK                       (0x1U << PWR_SR1_WUF1_SHIFT)
#define PWR_SR1_WUF1(x)                         (((uint32_t)(((uint32_t)(x)) << PWR_SR1_WUF1_SHIFT)) & PWR_SR1_WUF1_MASK)

/*!
 * @brief PWR_SCR Register Bit Definition
 */

#define PWR_SCR_WUF6CLR_SHIFT                   (5)
#define PWR_SCR_WUF6CLR_MASK                    (0x1U << PWR_SCR_WUF6CLR_SHIFT)
#define PWR_SCR_WUF6CLR(x)                      (((uint32_t)(((uint32_t)(x)) << PWR_SCR_WUF6CLR_SHIFT)) & PWR_SCR_WUF6CLR_MASK)

#define PWR_SCR_WUF5CLR_SHIFT                   (4)
#define PWR_SCR_WUF5CLR_MASK                    (0x1U << PWR_SCR_WUF5CLR_SHIFT)
#define PWR_SCR_WUF5CLR(x)                      (((uint32_t)(((uint32_t)(x)) << PWR_SCR_WUF5CLR_SHIFT)) & PWR_SCR_WUF5CLR_MASK)

#define PWR_SCR_WUF4CLR_SHIFT                   (3)
#define PWR_SCR_WUF4CLR_MASK                    (0x1U << PWR_SCR_WUF4CLR_SHIFT)
#define PWR_SCR_WUF4CLR(x)                      (((uint32_t)(((uint32_t)(x)) << PWR_SCR_WUF4CLR_SHIFT)) & PWR_SCR_WUF4CLR_MASK)

#define PWR_SCR_WUF2CLR_SHIFT                   (1)
#define PWR_SCR_WUF2CLR_MASK                    (0x1U << PWR_SCR_WUF2CLR_SHIFT)
#define PWR_SCR_WUF2CLR(x)                      (((uint32_t)(((uint32_t)(x)) << PWR_SCR_WUF2CLR_SHIFT)) & PWR_SCR_WUF2CLR_MASK)

#define PWR_SCR_WUF1CLR_SHIFT                   (0)
#define PWR_SCR_WUF1CLR_MASK                    (0x1U << PWR_SCR_WUF1CLR_SHIFT)
#define PWR_SCR_WUF1CLR(x)                      (((uint32_t)(((uint32_t)(x)) << PWR_SCR_WUF1CLR_SHIFT)) & PWR_SCR_WUF1CLR_MASK)

/*!
 * @brief PWR_CFGR Register Bit Definition
 */

#define PWR_CFGR_LSICAL_SHIFT                   (5)
#define PWR_CFGR_LSICAL_MASK                    (0x1FU << PWR_CFGR_LSICAL_SHIFT)
#define PWR_CFGR_LSICAL(x)                      (((uint32_t)(((uint32_t)(x)) << PWR_CFGR_LSICAL_SHIFT)) & PWR_CFGR_LSICAL_MASK)

#define PWR_CFGR_LSICALSEL_SHIFT                (0)
#define PWR_CFGR_LSICALSEL_MASK                 (0x1FU << PWR_CFGR_LSICALSEL_SHIFT)
#define PWR_CFGR_LSICALSEL(x)                   (((uint32_t)(((uint32_t)(x)) << PWR_CFGR_LSICALSEL_SHIFT)) & PWR_CFGR_LSICALSEL_MASK)

/*!
 * @}
 */ /* end of group PWR_Register_Masks */
/******************************************************************************
 *PWR Instance
*******************************************************************************/

#define PWR                  ((PWR_Type*)PWR_BASE)

/*!
 * @}
 */ /* end of group PWR_Peripheral_Access_Layer */



/*!
 * @addtogroup RCC_Peripheral_Access_Layer RCC Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * RCC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                           ///< Clock Control Register                       offset: 0x00
    __IO uint32_t CFGR;                                                         ///< Clock Configuration Register                 offset: 0x04
    __IO uint32_t CIR;                                                          ///< Clock Interrupt Register                     offset: 0x08
    __IO uint32_t APB2RSTR;                                                     ///< APB2 Peripheral Reset Register               offset: 0x0C
    __IO uint32_t APB1RSTR;                                                     ///< APB1 Peripheral Reset Register               offset: 0x10
    __IO uint32_t AHBENR;                                                       ///< AHB Peripheral Clock Enable Register         offset: 0x14
    __IO uint32_t APB2ENR;                                                      ///< APB2 Peripheral Clock Enable Register        offset: 0x18
    __IO uint32_t APB1ENR;                                                      ///< APB1 Peripheral Clock Enable Register        offset: 0x1C
    __IO uint32_t BDCR;                                                         ///< Backup Domain Control Register               offset: 0x20
    __IO uint32_t CSR;                                                          ///< Control Status Register                      offset: 0x24
    __IO uint32_t AHBRSTR;                                                      ///< AHB Peripheral Reset Register                offset: 0x28
    __IO uint32_t CFGR2;                                                        ///< Clock Configuration Register 2               offset: 0x2C
    __IO uint32_t Reserved0[4];                                                 ///< Reserved
    __IO uint32_t SYSCFG;                                                       ///< System Configuration Register                offset: 0x40
    __IO uint32_t Reserved1[2];                                                 ///< Reserved
    __IO uint32_t ICSCR;                                                        ///< Internal Clock Source Calibration Register   offset: 0x4C
    __IO uint32_t PLL1CFGR;                                                     ///< PLL1 Configuration Register                  offset: 0x50
    __IO uint32_t PLL2CFGR;                                                     ///< PLL2 Configuration Register                  offset: 0x54
} RCC_Type;

/*******************************************************************************
 * RCC Type
 ******************************************************************************/

/*!
 * @addtogroup RCC_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief RCC_CR Register Bit Definition
 */

#define RCC_CR_PLL2RDY_SHIFT                    (29)
#define RCC_CR_PLL2RDY_MASK                     (0x1U << RCC_CR_PLL2RDY_SHIFT)
#define RCC_CR_PLL2RDY(x)                       (((uint32_t)(((uint32_t)(x)) << RCC_CR_PLL2RDY_SHIFT)) & RCC_CR_PLL2RDY_MASK)

#define RCC_CR_PLL2ON_SHIFT                     (28)
#define RCC_CR_PLL2ON_MASK                      (0x1U << RCC_CR_PLL2ON_SHIFT)
#define RCC_CR_PLL2ON(x)                        (((uint32_t)(((uint32_t)(x)) << RCC_CR_PLL2ON_SHIFT)) & RCC_CR_PLL2ON_MASK)

#define RCC_CR_PLL1RDY_SHIFT                    (25)
#define RCC_CR_PLL1RDY_MASK                     (0x1U << RCC_CR_PLL1RDY_SHIFT)
#define RCC_CR_PLL1RDY(x)                       (((uint32_t)(((uint32_t)(x)) << RCC_CR_PLL1RDY_SHIFT)) & RCC_CR_PLL1RDY_MASK)

#define RCC_CR_PLL1ON_SHIFT                     (24)
#define RCC_CR_PLL1ON_MASK                      (0x1U << RCC_CR_PLL1ON_SHIFT)
#define RCC_CR_PLL1ON(x)                        (((uint32_t)(((uint32_t)(x)) << RCC_CR_PLL1ON_SHIFT)) & RCC_CR_PLL1ON_MASK)

#define RCC_CR_CSSON_SHIFT                      (19)
#define RCC_CR_CSSON_MASK                       (0x1U << RCC_CR_CSSON_SHIFT)
#define RCC_CR_CSSON(x)                         (((uint32_t)(((uint32_t)(x)) << RCC_CR_CSSON_SHIFT)) & RCC_CR_CSSON_MASK)

