UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define RCC_APB1RSTR_UART2_SHIFT                (17)
#define RCC_APB1RSTR_UART2_MASK                 (0x1U << RCC_APB1RSTR_UART2_SHIFT)
#define RCC_APB1RSTR_UART2(x)                   (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_UART2_SHIFT)) & RCC_APB1RSTR_UART2_MASK)

#define RCC_APB1RSTR_SPI2_SHIFT                 (14)
#define RCC_APB1RSTR_SPI2_MASK                  (0x1U << RCC_APB1RSTR_SPI2_SHIFT)
#define RCC_APB1RSTR_SPI2(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_SPI2_SHIFT)) & RCC_APB1RSTR_SPI2_MASK)

#define RCC_APB1RSTR_WWDG_SHIFT                 (11)
#define RCC_APB1RSTR_WWDG_MASK                  (0x1U << RCC_APB1RSTR_WWDG_SHIFT)
#define RCC_APB1RSTR_WWDG(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_WWDG_SHIFT)) & RCC_APB1RSTR_WWDG_MASK)

#define RCC_APB1RSTR_I3C_SHIFT                  (6)
#define RCC_APB1RSTR_I3C_MASK                   (0x1U << RCC_APB1RSTR_I3C_SHIFT)
#define RCC_APB1RSTR_I3C(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_I3C_SHIFT)) & RCC_APB1RSTR_I3C_MASK)

#define RCC_APB1RSTR_TIM3_SHIFT                 (1)
#define RCC_APB1RSTR_TIM3_MASK                  (0x1U << RCC_APB1RSTR_TIM3_SHIFT)
#define RCC_APB1RSTR_TIM3(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_TIM3_SHIFT)) & RCC_APB1RSTR_TIM3_MASK)

#define RCC_APB1RSTR_TIM2_SHIFT                 (0)
#define RCC_APB1RSTR_TIM2_MASK                  (0x1U << RCC_APB1RSTR_TIM2_SHIFT)
#define RCC_APB1RSTR_TIM2(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_TIM2_SHIFT)) & RCC_APB1RSTR_TIM2_MASK)

/*!
 * @brief RCC_AHBENR Register Bit Definition
 */

#define RCC_AHBENR_HWDIV_SHIFT                  (26)
#define RCC_AHBENR_HWDIV_MASK                   (0x1U << RCC_AHBENR_HWDIV_SHIFT)
#define RCC_AHBENR_HWDIV(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_HWDIV_SHIFT)) & RCC_AHBENR_HWDIV_MASK)

#define RCC_AHBENR_USB_SHIFT                    (24)
#define RCC_AHBENR_USB_MASK                     (0x1U << RCC_AHBENR_USB_SHIFT)
#define RCC_AHBENR_USB(x)                       (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_USB_SHIFT)) & RCC_AHBENR_USB_MASK)

#define RCC_AHBENR_GPIOD_SHIFT                  (20)
#define RCC_AHBENR_GPIOD_MASK                   (0x1U << RCC_AHBENR_GPIOD_SHIFT)
#define RCC_AHBENR_GPIOD(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_GPIOD_SHIFT)) & RCC_AHBENR_GPIOD_MASK)

#define RCC_AHBENR_GPIOC_SHIFT                  (19)
#define RCC_AHBENR_GPIOC_MASK                   (0x1U << RCC_AHBENR_GPIOC_SHIFT)
#define RCC_AHBENR_GPIOC(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_GPIOC_SHIFT)) & RCC_AHBENR_GPIOC_MASK)

#define RCC_AHBENR_GPIOB_SHIFT                  (18)
#define RCC_AHBENR_GPIOB_MASK                   (0x1U << RCC_AHBENR_GPIOB_SHIFT)
#define RCC_AHBENR_GPIOB(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_GPIOB_SHIFT)) & RCC_AHBENR_GPIOB_MASK)

#define RCC_AHBENR_GPIOA_SHIFT                  (17)
#define RCC_AHBENR_GPIOA_MASK                   (0x1U << RCC_AHBENR_GPIOA_SHIFT)
#define RCC_AHBENR_GPIOA(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_GPIOA_SHIFT)) & RCC_AHBENR_GPIOA_MASK)

#define RCC_AHBENR_CRC_SHIFT                    (6)
#define RCC_AHBENR_CRC_MASK                     (0x1U << RCC_AHBENR_CRC_SHIFT)
#define RCC_AHBENR_CRC(x)                       (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_CRC_SHIFT)) & RCC_AHBENR_CRC_MASK)

#define RCC_AHBENR_FLASH_SHIFT                  (4)
#define RCC_AHBENR_FLASH_MASK                   (0x1U << RCC_AHBENR_FLASH_SHIFT)
#define RCC_AHBENR_FLASH(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_FLASH_SHIFT)) & RCC_AHBENR_FLASH_MASK)

#define RCC_AHBENR_SRAM_SHIFT                   (2)
#define RCC_AHBENR_SRAM_MASK                    (0x1U << RCC_AHBENR_SRAM_SHIFT)
#define RCC_AHBENR_SRAM(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_SRAM_SHIFT)) & RCC_AHBENR_SRAM_MASK)

#define RCC_AHBENR_DMA_SHIFT                    (0)
#define RCC_AHBENR_DMA_MASK                     (0x1U << RCC_AHBENR_DMA_SHIFT)
#define RCC_AHBENR_DMA(x)                       (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_DMA_SHIFT)) & RCC_AHBENR_DMA_MASK)

/*!
 * @brief RCC_APB2ENR Register Bit Definition
 */

#define RCC_APB2ENR_LPUART_SHIFT                (31)
#define RCC_APB2ENR_LPUART_MASK                 (0x1U << RCC_APB2ENR_LPUART_SHIFT)
#define RCC_APB2ENR_LPUART(x)                   (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_LPUART_SHIFT)) & RCC_APB2ENR_LPUART_MASK)

#define RCC_APB2ENR_LPTIM_SHIFT                 (30)
#define RCC_APB2ENR_LPTIM_MASK                  (0x1U << RCC_APB2ENR_LPTIM_SHIFT)
#define RCC_APB2ENR_LPTIM(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_LPTIM_SHIFT)) & RCC_APB2ENR_LPTIM_MASK)

#define RCC_APB2ENR_EXTI_SHIFT                  (29)
#define RCC_APB2ENR_EXTI_MASK                   (0x1U << RCC_APB2ENR_EXTI_SHIFT)
#define RCC_APB2ENR_EXTI(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_EXTI_SHIFT)) & RCC_APB2ENR_EXTI_MASK)

#define RCC_APB2ENR_DBG_SHIFT                   (22)
#define RCC_APB2ENR_DBG_MASK                    (0x1U << RCC_APB2ENR_DBG_SHIFT)
#define RCC_APB2ENR_DBG(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_DBG_SHIFT)) & RCC_APB2ENR_DBG_MASK)

#define RCC_APB2ENR_TIM17_SHIFT                 (18)
#define RCC_APB2ENR_TIM17_MASK                  (0x1U << RCC_APB2ENR_TIM17_SHIFT)
#define RCC_APB2ENR_TIM17(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_TIM17_SHIFT)) & RCC_APB2ENR_TIM17_MASK)

#define RCC_APB2ENR_TIM16_SHIFT                 (17)
#define RCC_APB2ENR_TIM16_MASK                  (0x1U << RCC_APB2ENR_TIM16_SHIFT)
#define RCC_APB2ENR_TIM16(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_TIM16_SHIFT)) & RCC_APB2ENR_TIM16_MASK)

#define RCC_APB2ENR_TIM14_SHIFT                 (16)
#define RCC_APB2ENR_TIM14_MASK                  (0x1U << RCC_APB2ENR_TIM14_SHIFT)
#define RCC_APB2ENR_TIM14(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_TIM14_SHIFT)) & RCC_APB2ENR_TIM14_MASK)

#define RCC_APB2ENR_COMP_SHIFT                  (15)
#define RCC_APB2ENR_COMP_MASK                   (0x1U << RCC_APB2ENR_COMP_SHIFT)
#define RCC_APB2ENR_COMP(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_COMP_SHIFT)) & RCC_APB2ENR_COMP_MASK)

#define RCC_APB2ENR_UART1_SHIFT                 (14)
#define RCC_APB2ENR_UART1_MASK                  (0x1U << RCC_APB2ENR_UART1_SHIFT)
#define RCC_APB2ENR_UART1(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_UART1_SHIFT)) & RCC_APB2ENR_UART1_MASK)

#define RCC_APB2ENR_SPI1_SHIFT                  (12)
#define RCC_APB2ENR_SPI1_MASK                   (0x1U << RCC_APB2ENR_SPI1_SHIFT)
#define RCC_APB2ENR_SPI1(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_SPI1_SHIFT)) & RCC_APB2ENR_SPI1_MASK)

#define RCC_APB2ENR_TIM1_SHIFT                  (11)
#define RCC_APB2ENR_TIM1_MASK                   (0x1U << RCC_APB2ENR_TIM1_SHIFT)
#define RCC_APB2ENR_TIM1(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_TIM1_SHIFT)) & RCC_APB2ENR_TIM1_MASK)

#define RCC_APB2ENR_ADC_SHIFT                   (9)
#define RCC_APB2ENR_ADC_MASK                    (0x1U << RCC_APB2ENR_ADC_SHIFT)
#define RCC_APB2ENR_ADC(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_ADC_SHIFT)) & RCC_APB2ENR_ADC_MASK)

#define RCC_APB2ENR_SYSCFG_SHIFT                (0)
#define RCC_APB2ENR_SYSCFG_MASK                 (0x1U << RCC_APB2ENR_SYSCFG_SHIFT)
#define RCC_APB2ENR_SYSCFG(x)                   (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_SYSCFG_SHIFT)) & RCC_APB2ENR_SYSCFG_MASK)

/*!
 * @brief RCC_APB1ENR Register Bit Definition
 */

#define RCC_APB1ENR_RTC_SHIFT                   (31)
#define RCC_APB1ENR_RTC_MASK                    (0x1U << RCC_APB1ENR_RTC_SHIFT)
#define RCC_APB1ENR_RTC(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_APB1ENR_RTC_SHIFT)) & RCC_APB1ENR_RTC_MASK)

