UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define RCC_CSR_LOCKUPEN_SHIFT                  (7)
#define RCC_CSR_LOCKUPEN_MASK                   (0x1U << RCC_CSR_LOCKUPEN_SHIFT)
#define RCC_CSR_LOCKUPEN(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_CSR_LOCKUPEN_SHIFT)) & RCC_CSR_LOCKUPEN_MASK)

#define RCC_CSR_PVDRSTEN_SHIFT                  (6)
#define RCC_CSR_PVDRSTEN_MASK                   (0x1U << RCC_CSR_PVDRSTEN_SHIFT)
#define RCC_CSR_PVDRSTEN(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_CSR_PVDRSTEN_SHIFT)) & RCC_CSR_PVDRSTEN_MASK)

#define RCC_CSR_LSIOE_SHIFT                     (5)
#define RCC_CSR_LSIOE_MASK                      (0x1U << RCC_CSR_LSIOE_SHIFT)
#define RCC_CSR_LSIOE(x)                        (((uint32_t)(((uint32_t)(x)) << RCC_CSR_LSIOE_SHIFT)) & RCC_CSR_LSIOE_MASK)

#define RCC_CSR_LSIRDY_SHIFT                    (1)
#define RCC_CSR_LSIRDY_MASK                     (0x1U << RCC_CSR_LSIRDY_SHIFT)
#define RCC_CSR_LSIRDY(x)                       (((uint32_t)(((uint32_t)(x)) << RCC_CSR_LSIRDY_SHIFT)) & RCC_CSR_LSIRDY_MASK)

#define RCC_CSR_LSION_SHIFT                     (0)
#define RCC_CSR_LSION_MASK                      (0x1U << RCC_CSR_LSION_SHIFT)
#define RCC_CSR_LSION(x)                        (((uint32_t)(((uint32_t)(x)) << RCC_CSR_LSION_SHIFT)) & RCC_CSR_LSION_MASK)

/*!
 * @brief RCC_AHBRSTR Register Bit Definition
 */

#define RCC_AHBRSTR_HWDIV_SHIFT                 (26)
#define RCC_AHBRSTR_HWDIV_MASK                  (0x1U << RCC_AHBRSTR_HWDIV_SHIFT)
#define RCC_AHBRSTR_HWDIV(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_HWDIV_SHIFT)) & RCC_AHBRSTR_HWDIV_MASK)

#define RCC_AHBRSTR_USB_SHIFT                   (24)
#define RCC_AHBRSTR_USB_MASK                    (0x1U << RCC_AHBRSTR_USB_SHIFT)
#define RCC_AHBRSTR_USB(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_USB_SHIFT)) & RCC_AHBRSTR_USB_MASK)

#define RCC_AHBRSTR_GPIOD_SHIFT                 (20)
#define RCC_AHBRSTR_GPIOD_MASK                  (0x1U << RCC_AHBRSTR_GPIOD_SHIFT)
#define RCC_AHBRSTR_GPIOD(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_GPIOD_SHIFT)) & RCC_AHBRSTR_GPIOD_MASK)

#define RCC_AHBRSTR_GPIOC_SHIFT                 (19)
#define RCC_AHBRSTR_GPIOC_MASK                  (0x1U << RCC_AHBRSTR_GPIOC_SHIFT)
#define RCC_AHBRSTR_GPIOC(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_GPIOC_SHIFT)) & RCC_AHBRSTR_GPIOC_MASK)

#define RCC_AHBRSTR_GPIOB_SHIFT                 (18)
#define RCC_AHBRSTR_GPIOB_MASK                  (0x1U << RCC_AHBRSTR_GPIOB_SHIFT)
#define RCC_AHBRSTR_GPIOB(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_GPIOB_SHIFT)) & RCC_AHBRSTR_GPIOB_MASK)

#define RCC_AHBRSTR_GPIOA_SHIFT                 (17)
#define RCC_AHBRSTR_GPIOA_MASK                  (0x1U << RCC_AHBRSTR_GPIOA_SHIFT)
#define RCC_AHBRSTR_GPIOA(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_GPIOA_SHIFT)) & RCC_AHBRSTR_GPIOA_MASK)

#define RCC_AHBRSTR_CRC_SHIFT                   (6)
#define RCC_AHBRSTR_CRC_MASK                    (0x1U << RCC_AHBRSTR_CRC_SHIFT)
#define RCC_AHBRSTR_CRC(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_CRC_SHIFT)) & RCC_AHBRSTR_CRC_MASK)

#define RCC_AHBRSTR_DMA_SHIFT                   (0)
#define RCC_AHBRSTR_DMA_MASK                    (0x1U << RCC_AHBRSTR_DMA_SHIFT)
#define RCC_AHBRSTR_DMA(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_DMA_SHIFT)) & RCC_AHBRSTR_DMA_MASK)

/*!
 * @brief RCC_CFGR2 Register Bit Definition
 */

#define RCC_CFGR2_LPTIMCLKSEL_SHIFT             (29)
#define RCC_CFGR2_LPTIMCLKSEL_MASK              (0x3U << RCC_CFGR2_LPTIMCLKSEL_SHIFT)
#define RCC_CFGR2_LPTIMCLKSEL(x)                (((uint32_t)(((uint32_t)(x)) << RCC_CFGR2_LPTIMCLKSEL_SHIFT)) & RCC_CFGR2_LPTIMCLKSEL_MASK)

#define RCC_CFGR2_MCOPRE_SHIFT                  (20)
#define RCC_CFGR2_MCOPRE_MASK                   (0xFU << RCC_CFGR2_MCOPRE_SHIFT)
#define RCC_CFGR2_MCOPRE(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_CFGR2_MCOPRE_SHIFT)) & RCC_CFGR2_MCOPRE_MASK)

#define RCC_CFGR2_APB1CLKHVPRE_SHIFT            (16)
#define RCC_CFGR2_APB1CLKHVPRE_MASK             (0xFU << RCC_CFGR2_APB1CLKHVPRE_SHIFT)
#define RCC_CFGR2_APB1CLKHVPRE(x)               (((uint32_t)(((uint32_t)(x)) << RCC_CFGR2_APB1CLKHVPRE_SHIFT)) & RCC_CFGR2_APB1CLKHVPRE_MASK)

#define RCC_CFGR2_CANPRE_SHIFT                  (12)
#define RCC_CFGR2_CANPRE_MASK                   (0x3U << RCC_CFGR2_CANPRE_SHIFT)
#define RCC_CFGR2_CANPRE(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_CFGR2_CANPRE_SHIFT)) & RCC_CFGR2_CANPRE_MASK)

#define RCC_CFGR2_CANCLKSEL_SHIFT               (8)
#define RCC_CFGR2_CANCLKSEL_MASK                (0x3U << RCC_CFGR2_CANCLKSEL_SHIFT)
#define RCC_CFGR2_CANCLKSEL(x)                  (((uint32_t)(((uint32_t)(x)) << RCC_CFGR2_CANCLKSEL_SHIFT)) & RCC_CFGR2_CANCLKSEL_MASK)

#define RCC_CFGR2_LPUARTCLKSEL_SHIFT            (0)
#define RCC_CFGR2_LPUARTCLKSEL_MASK             (0x3U << RCC_CFGR2_LPUARTCLKSEL_SHIFT)
#define RCC_CFGR2_LPUARTCLKSEL(x)               (((uint32_t)(((uint32_t)(x)) << RCC_CFGR2_LPUARTCLKSEL_SHIFT)) & RCC_CFGR2_LPUARTCLKSEL_MASK)

/*!
 * @brief RCC_SYSCFG Register Bit Definition
 */

#define RCC_SYSCFG_HSELPFEN_SHIFT               (14)
#define RCC_SYSCFG_HSELPFEN_MASK                (0x1U << RCC_SYSCFG_HSELPFEN_SHIFT)
#define RCC_SYSCFG_HSELPFEN(x)                  (((uint32_t)(((uint32_t)(x)) << RCC_SYSCFG_HSELPFEN_SHIFT)) & RCC_SYSCFG_HSELPFEN_MASK)

#define RCC_SYSCFG_HSERFBSEL_SHIFT              (8)
#define RCC_SYSCFG_HSERFBSEL_MASK               (0x3U << RCC_SYSCFG_HSERFBSEL_SHIFT)
#define RCC_SYSCFG_HSERFBSEL(x)                 (((uint32_t)(((uint32_t)(x)) << RCC_SYSCFG_HSERFBSEL_SHIFT)) & RCC_SYSCFG_HSERFBSEL_MASK)

#define RCC_SYSCFG_PROGCHECKEN_SHIFT            (0)
#define RCC_SYSCFG_PROGCHECKEN_MASK             (0x1U << RCC_SYSCFG_PROGCHECKEN_SHIFT)
#define RCC_SYSCFG_PROGCHECKEN(x)               (((uint32_t)(((uint32_t)(x)) << RCC_SYSCFG_PROGCHECKEN_SHIFT)) & RCC_SYSCFG_PROGCHECKEN_MASK)

/*!
 * @brief RCC_ICSCR Register Bit Definition
 */

#define RCC_ICSCR_TRIMCRSSEL_SHIFT              (0)
#define RCC_ICSCR_TRIMCRSSEL_MASK               (0x1U << RCC_ICSCR_TRIMCRSSEL_SHIFT)
#define RCC_ICSCR_TRIMCRSSEL(x)                 (((uint32_t)(((uint32_t)(x)) << RCC_ICSCR_TRIMCRSSEL_SHIFT)) & RCC_ICSCR_TRIMCRSSEL_MASK)

/*!
 * @brief RCC_PLL1CFGR Register Bit Definition
 */

