UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define SPI_I2S_I2SCFGR_I2SSTD_SHIFT            (4)
#define SPI_I2S_I2SCFGR_I2SSTD_MASK             (0x3U << SPI_I2S_I2SCFGR_I2SSTD_SHIFT)
#define SPI_I2S_I2SCFGR_I2SSTD(x)               (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_I2SSTD_SHIFT)) & SPI_I2S_I2SCFGR_I2SSTD_MASK)

#define SPI_I2S_I2SCFGR_DATLEN_SHIFT            (1)
#define SPI_I2S_I2SCFGR_DATLEN_MASK             (0x3U << SPI_I2S_I2SCFGR_DATLEN_SHIFT)
#define SPI_I2S_I2SCFGR_DATLEN(x)               (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_DATLEN_SHIFT)) & SPI_I2S_I2SCFGR_DATLEN_MASK)

#define SPI_I2S_I2SCFGR_CHLEN_SHIFT             (0)
#define SPI_I2S_I2SCFGR_CHLEN_MASK              (0x1U << SPI_I2S_I2SCFGR_CHLEN_SHIFT)
#define SPI_I2S_I2SCFGR_CHLEN(x)                (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_CHLEN_SHIFT)) & SPI_I2S_I2SCFGR_CHLEN_MASK)

/*!
 * @}
 */ /* end of group SPI_I2S_Register_Masks */
/******************************************************************************
 *SPI_I2S Instance
*******************************************************************************/

#define SPI1                 ((SPI_Type*)SPI1_BASE)

#define SPI2                 ((SPI_Type*)SPI2_BASE)

/*!
 * @}
 */ /* end of group SPI_Peripheral_Access_Layer */



/*!
 * @addtogroup SYSCFG_Peripheral_Access_Layer SYSCFG Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * SYSCFG Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CFGR;                                                         ///< SYSCFG Configuration Register                offset: 0x00
    __IO uint32_t Reserved0[1];                                                 ///< Reserved
    __IO uint32_t EXTICR1;                                                      ///< SYSCFG External Interrupt Configuration Register 1offset: 0x08
    __IO uint32_t EXTICR2;                                                      ///< SYSCFG External Interrupt Configuration Register 2offset: 0x0C
    __IO uint32_t EXTICR3;                                                      ///< SYSCFG External Interrupt Configuration Register 3offset: 0x10
    __IO uint32_t EXTICR4;                                                      ///< SYSCFG External Interrupt Configuration Register 4offset: 0x14
    __IO uint32_t PADHYS;                                                       ///< SYSCFG PAD Configuration Register 2          offset: 0x18
} SYSCFG_Type;

/*******************************************************************************
 * SYSCFG Type
 ******************************************************************************/

/*!
 * @addtogroup SYSCFG_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief SYSCFG_CFGR Register Bit Definition
 */

#define SYSCFG_CFGR_TIM3TRIGDMARMP_SHIFT        (29)
#define SYSCFG_CFGR_TIM3TRIGDMARMP_MASK         (0x1U << SYSCFG_CFGR_TIM3TRIGDMARMP_SHIFT)
#define SYSCFG_CFGR_TIM3TRIGDMARMP(x)           (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_TIM3TRIGDMARMP_SHIFT)) & SYSCFG_CFGR_TIM3TRIGDMARMP_MASK)

#define SYSCFG_CFGR_TIM3CH1DMARMP_SHIFT         (28)
#define SYSCFG_CFGR_TIM3CH1DMARMP_MASK          (0x1U << SYSCFG_CFGR_TIM3CH1DMARMP_SHIFT)
#define SYSCFG_CFGR_TIM3CH1DMARMP(x)            (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_TIM3CH1DMARMP_SHIFT)) & SYSCFG_CFGR_TIM3CH1DMARMP_MASK)

#define SYSCFG_CFGR_TIM2CH4DMARMP_SHIFT         (27)
#define SYSCFG_CFGR_TIM2CH4DMARMP_MASK          (0x1U << SYSCFG_CFGR_TIM2CH4DMARMP_SHIFT)
#define SYSCFG_CFGR_TIM2CH4DMARMP(x)            (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_TIM2CH4DMARMP_SHIFT)) & SYSCFG_CFGR_TIM2CH4DMARMP_MASK)

#define SYSCFG_CFGR_TIM2CH2DMARMP_SHIFT         (26)
#define SYSCFG_CFGR_TIM2CH2DMARMP_MASK          (0x1U << SYSCFG_CFGR_TIM2CH2DMARMP_SHIFT)
#define SYSCFG_CFGR_TIM2CH2DMARMP(x)            (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_TIM2CH2DMARMP_SHIFT)) & SYSCFG_CFGR_TIM2CH2DMARMP_MASK)

#define SYSCFG_CFGR_TIM1CH3DMARMP_SHIFT         (25)
#define SYSCFG_CFGR_TIM1CH3DMARMP_MASK          (0x1U << SYSCFG_CFGR_TIM1CH3DMARMP_SHIFT)
#define SYSCFG_CFGR_TIM1CH3DMARMP(x)            (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_TIM1CH3DMARMP_SHIFT)) & SYSCFG_CFGR_TIM1CH3DMARMP_MASK)

#define SYSCFG_CFGR_TIM1CH2DMARMP_SHIFT         (24)
#define SYSCFG_CFGR_TIM1CH2DMARMP_MASK          (0x1U << SYSCFG_CFGR_TIM1CH2DMARMP_SHIFT)
#define SYSCFG_CFGR_TIM1CH2DMARMP(x)            (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_TIM1CH2DMARMP_SHIFT)) & SYSCFG_CFGR_TIM1CH2DMARMP_MASK)

#define SYSCFG_CFGR_TIM1CH1DMARMP_SHIFT         (23)
#define SYSCFG_CFGR_TIM1CH1DMARMP_MASK          (0x1U << SYSCFG_CFGR_TIM1CH1DMARMP_SHIFT)
#define SYSCFG_CFGR_TIM1CH1DMARMP(x)            (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_TIM1CH1DMARMP_SHIFT)) & SYSCFG_CFGR_TIM1CH1DMARMP_MASK)

#define SYSCFG_CFGR_I2C1RXDMARMP_SHIFT          (22)
#define SYSCFG_CFGR_I2C1RXDMARMP_MASK           (0x1U << SYSCFG_CFGR_I2C1RXDMARMP_SHIFT)
#define SYSCFG_CFGR_I2C1RXDMARMP(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_I2C1RXDMARMP_SHIFT)) & SYSCFG_CFGR_I2C1RXDMARMP_MASK)

#define SYSCFG_CFGR_I2C1TXDMARMP_SHIFT          (21)
#define SYSCFG_CFGR_I2C1TXDMARMP_MASK           (0x1U << SYSCFG_CFGR_I2C1TXDMARMP_SHIFT)
#define SYSCFG_CFGR_I2C1TXDMARMP(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_I2C1TXDMARMP_SHIFT)) & SYSCFG_CFGR_I2C1TXDMARMP_MASK)

#define SYSCFG_CFGR_UART3RXDMARMP_SHIFT         (20)
#define SYSCFG_CFGR_UART3RXDMARMP_MASK          (0x1U << SYSCFG_CFGR_UART3RXDMARMP_SHIFT)
#define SYSCFG_CFGR_UART3RXDMARMP(x)            (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_UART3RXDMARMP_SHIFT)) & SYSCFG_CFGR_UART3RXDMARMP_MASK)

#define SYSCFG_CFGR_UART3TXDMARMP_SHIFT         (19)
#define SYSCFG_CFGR_UART3TXDMARMP_MASK          (0x1U << SYSCFG_CFGR_UART3TXDMARMP_SHIFT)
#define SYSCFG_CFGR_UART3TXDMARMP(x)            (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_UART3TXDMARMP_SHIFT)) & SYSCFG_CFGR_UART3TXDMARMP_MASK)

#define SYSCFG_CFGR_UART2RXDMARMP_SHIFT         (18)
#define SYSCFG_CFGR_UART2RXDMARMP_MASK          (0x1U << SYSCFG_CFGR_UART2RXDMARMP_SHIFT)
#define SYSCFG_CFGR_UART2RXDMARMP(x)            (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_UART2RXDMARMP_SHIFT)) & SYSCFG_CFGR_UART2RXDMARMP_MASK)

#define SYSCFG_CFGR_UART2TXDMARMP_SHIFT         (17)
#define SYSCFG_CFGR_UART2TXDMARMP_MASK          (0x1U << SYSCFG_CFGR_UART2TXDMARMP_SHIFT)
#define SYSCFG_CFGR_UART2TXDMARMP(x)            (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_UART2TXDMARMP_SHIFT)) & SYSCFG_CFGR_UART2TXDMARMP_MASK)

