UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define SYSCFG_CFGR_SPI2RXDMARMP_SHIFT          (16)
#define SYSCFG_CFGR_SPI2RXDMARMP_MASK           (0x1U << SYSCFG_CFGR_SPI2RXDMARMP_SHIFT)
#define SYSCFG_CFGR_SPI2RXDMARMP(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_SPI2RXDMARMP_SHIFT)) & SYSCFG_CFGR_SPI2RXDMARMP_MASK)

#define SYSCFG_CFGR_SPI2TXDMARMP_SHIFT          (15)
#define SYSCFG_CFGR_SPI2TXDMARMP_MASK           (0x1U << SYSCFG_CFGR_SPI2TXDMARMP_SHIFT)
#define SYSCFG_CFGR_SPI2TXDMARMP(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_SPI2TXDMARMP_SHIFT)) & SYSCFG_CFGR_SPI2TXDMARMP_MASK)

#define SYSCFG_CFGR_TIM17DMARMP_SHIFT           (12)
#define SYSCFG_CFGR_TIM17DMARMP_MASK            (0x1U << SYSCFG_CFGR_TIM17DMARMP_SHIFT)
#define SYSCFG_CFGR_TIM17DMARMP(x)              (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_TIM17DMARMP_SHIFT)) & SYSCFG_CFGR_TIM17DMARMP_MASK)

#define SYSCFG_CFGR_TIM16DMARMP_SHIFT           (11)
#define SYSCFG_CFGR_TIM16DMARMP_MASK            (0x1U << SYSCFG_CFGR_TIM16DMARMP_SHIFT)
#define SYSCFG_CFGR_TIM16DMARMP(x)              (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_TIM16DMARMP_SHIFT)) & SYSCFG_CFGR_TIM16DMARMP_MASK)

#define SYSCFG_CFGR_UART1RXDMARMP_SHIFT         (10)
#define SYSCFG_CFGR_UART1RXDMARMP_MASK          (0x1U << SYSCFG_CFGR_UART1RXDMARMP_SHIFT)
#define SYSCFG_CFGR_UART1RXDMARMP(x)            (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_UART1RXDMARMP_SHIFT)) & SYSCFG_CFGR_UART1RXDMARMP_MASK)

#define SYSCFG_CFGR_UART1TXDMARMP_SHIFT         (9)
#define SYSCFG_CFGR_UART1TXDMARMP_MASK          (0x1U << SYSCFG_CFGR_UART1TXDMARMP_SHIFT)
#define SYSCFG_CFGR_UART1TXDMARMP(x)            (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_UART1TXDMARMP_SHIFT)) & SYSCFG_CFGR_UART1TXDMARMP_MASK)

#define SYSCFG_CFGR_ADCDMARMP_SHIFT             (8)
#define SYSCFG_CFGR_ADCDMARMP_MASK              (0x1U << SYSCFG_CFGR_ADCDMARMP_SHIFT)
#define SYSCFG_CFGR_ADCDMARMP(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_ADCDMARMP_SHIFT)) & SYSCFG_CFGR_ADCDMARMP_MASK)

#define SYSCFG_CFGR_MEMMODE_SHIFT               (0)
#define SYSCFG_CFGR_MEMMODE_MASK                (0x3U << SYSCFG_CFGR_MEMMODE_SHIFT)
#define SYSCFG_CFGR_MEMMODE(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_MEMMODE_SHIFT)) & SYSCFG_CFGR_MEMMODE_MASK)

/*!
 * @brief SYSCFG_EXTICR1 Register Bit Definition
 */

#define SYSCFG_EXTICR1_EXTI3_SHIFT              (12)
#define SYSCFG_EXTICR1_EXTI3_MASK               (0xFU << SYSCFG_EXTICR1_EXTI3_SHIFT)
#define SYSCFG_EXTICR1_EXTI3(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR1_EXTI3_SHIFT)) & SYSCFG_EXTICR1_EXTI3_MASK)

#define SYSCFG_EXTICR1_EXTI2_SHIFT              (8)
#define SYSCFG_EXTICR1_EXTI2_MASK               (0xFU << SYSCFG_EXTICR1_EXTI2_SHIFT)
#define SYSCFG_EXTICR1_EXTI2(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR1_EXTI2_SHIFT)) & SYSCFG_EXTICR1_EXTI2_MASK)

#define SYSCFG_EXTICR1_EXTI1_SHIFT              (4)
#define SYSCFG_EXTICR1_EXTI1_MASK               (0xFU << SYSCFG_EXTICR1_EXTI1_SHIFT)
#define SYSCFG_EXTICR1_EXTI1(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR1_EXTI1_SHIFT)) & SYSCFG_EXTICR1_EXTI1_MASK)

#define SYSCFG_EXTICR1_EXTI0_SHIFT              (0)
#define SYSCFG_EXTICR1_EXTI0_MASK               (0xFU << SYSCFG_EXTICR1_EXTI0_SHIFT)
#define SYSCFG_EXTICR1_EXTI0(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR1_EXTI0_SHIFT)) & SYSCFG_EXTICR1_EXTI0_MASK)

/*!
 * @brief SYSCFG_EXTICR2 Register Bit Definition
 */

#define SYSCFG_EXTICR2_EXTI7_SHIFT              (12)
#define SYSCFG_EXTICR2_EXTI7_MASK               (0xFU << SYSCFG_EXTICR2_EXTI7_SHIFT)
#define SYSCFG_EXTICR2_EXTI7(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR2_EXTI7_SHIFT)) & SYSCFG_EXTICR2_EXTI7_MASK)

#define SYSCFG_EXTICR2_EXTI6_SHIFT              (8)
#define SYSCFG_EXTICR2_EXTI6_MASK               (0xFU << SYSCFG_EXTICR2_EXTI6_SHIFT)
#define SYSCFG_EXTICR2_EXTI6(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR2_EXTI6_SHIFT)) & SYSCFG_EXTICR2_EXTI6_MASK)

#define SYSCFG_EXTICR2_EXTI5_SHIFT              (4)
#define SYSCFG_EXTICR2_EXTI5_MASK               (0xFU << SYSCFG_EXTICR2_EXTI5_SHIFT)
#define SYSCFG_EXTICR2_EXTI5(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR2_EXTI5_SHIFT)) & SYSCFG_EXTICR2_EXTI5_MASK)

#define SYSCFG_EXTICR2_EXTI4_SHIFT              (0)
#define SYSCFG_EXTICR2_EXTI4_MASK               (0xFU << SYSCFG_EXTICR2_EXTI4_SHIFT)
#define SYSCFG_EXTICR2_EXTI4(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR2_EXTI4_SHIFT)) & SYSCFG_EXTICR2_EXTI4_MASK)

/*!
 * @brief SYSCFG_EXTICR3 Register Bit Definition
 */

#define SYSCFG_EXTICR3_EXTI11_SHIFT             (12)
#define SYSCFG_EXTICR3_EXTI11_MASK              (0xFU << SYSCFG_EXTICR3_EXTI11_SHIFT)
#define SYSCFG_EXTICR3_EXTI11(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR3_EXTI11_SHIFT)) & SYSCFG_EXTICR3_EXTI11_MASK)

#define SYSCFG_EXTICR3_EXTI10_SHIFT             (8)
#define SYSCFG_EXTICR3_EXTI10_MASK              (0xFU << SYSCFG_EXTICR3_EXTI10_SHIFT)
#define SYSCFG_EXTICR3_EXTI10(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR3_EXTI10_SHIFT)) & SYSCFG_EXTICR3_EXTI10_MASK)

#define SYSCFG_EXTICR3_EXTI9_SHIFT              (4)
#define SYSCFG_EXTICR3_EXTI9_MASK               (0xFU << SYSCFG_EXTICR3_EXTI9_SHIFT)
#define SYSCFG_EXTICR3_EXTI9(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR3_EXTI9_SHIFT)) & SYSCFG_EXTICR3_EXTI9_MASK)

#define SYSCFG_EXTICR3_EXTI8_SHIFT              (0)
#define SYSCFG_EXTICR3_EXTI8_MASK               (0xFU << SYSCFG_EXTICR3_EXTI8_SHIFT)
#define SYSCFG_EXTICR3_EXTI8(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR3_EXTI8_SHIFT)) & SYSCFG_EXTICR3_EXTI8_MASK)

/*!
 * @brief SYSCFG_EXTICR4 Register Bit Definition
 */

#define SYSCFG_EXTICR4_EXTI15_SHIFT             (12)
#define SYSCFG_EXTICR4_EXTI15_MASK              (0xFU << SYSCFG_EXTICR4_EXTI15_SHIFT)
#define SYSCFG_EXTICR4_EXTI15(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR4_EXTI15_SHIFT)) & SYSCFG_EXTICR4_EXTI15_MASK)

#define SYSCFG_EXTICR4_EXTI14_SHIFT             (8)
#define SYSCFG_EXTICR4_EXTI14_MASK              (0xFU << SYSCFG_EXTICR4_EXTI14_SHIFT)
#define SYSCFG_EXTICR4_EXTI14(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR4_EXTI14_SHIFT)) & SYSCFG_EXTICR4_EXTI14_MASK)

#define SYSCFG_EXTICR4_EXTI13_SHIFT             (4)
#define SYSCFG_EXTICR4_EXTI13_MASK              (0xFU << SYSCFG_EXTICR4_EXTI13_SHIFT)
#define SYSCFG_EXTICR4_EXTI13(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR4_EXTI13_SHIFT)) & SYSCFG_EXTICR4_EXTI13_MASK)

#define SYSCFG_EXTICR4_EXTI12_SHIFT             (0)
#define SYSCFG_EXTICR4_EXTI12_MASK              (0xFU << SYSCFG_EXTICR4_EXTI12_SHIFT)
#define SYSCFG_EXTICR4_EXTI12(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR4_EXTI12_SHIFT)) & SYSCFG_EXTICR4_EXTI12_MASK)

/*!
 * @brief SYSCFG_PADHYS Register Bit Definition
 */

