UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define TIM1_PDER_CCR5SHIFTEN_SHIFT             (5)
#define TIM1_PDER_CCR5SHIFTEN_MASK              (0x1U << TIM1_PDER_CCR5SHIFTEN_SHIFT)
#define TIM1_PDER_CCR5SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCR5SHIFTEN_SHIFT)) & TIM1_PDER_CCR5SHIFTEN_MASK)

#define TIM1_PDER_CCR4SHIFTEN_SHIFT             (4)
#define TIM1_PDER_CCR4SHIFTEN_MASK              (0x1U << TIM1_PDER_CCR4SHIFTEN_SHIFT)
#define TIM1_PDER_CCR4SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCR4SHIFTEN_SHIFT)) & TIM1_PDER_CCR4SHIFTEN_MASK)

#define TIM1_PDER_CCR3SHIFTEN_SHIFT             (3)
#define TIM1_PDER_CCR3SHIFTEN_MASK              (0x1U << TIM1_PDER_CCR3SHIFTEN_SHIFT)
#define TIM1_PDER_CCR3SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCR3SHIFTEN_SHIFT)) & TIM1_PDER_CCR3SHIFTEN_MASK)

#define TIM1_PDER_CCR2SHIFTEN_SHIFT             (2)
#define TIM1_PDER_CCR2SHIFTEN_MASK              (0x1U << TIM1_PDER_CCR2SHIFTEN_SHIFT)
#define TIM1_PDER_CCR2SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCR2SHIFTEN_SHIFT)) & TIM1_PDER_CCR2SHIFTEN_MASK)

#define TIM1_PDER_CCR1SHIFTEN_SHIFT             (1)
#define TIM1_PDER_CCR1SHIFTEN_MASK              (0x1U << TIM1_PDER_CCR1SHIFTEN_SHIFT)
#define TIM1_PDER_CCR1SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCR1SHIFTEN_SHIFT)) & TIM1_PDER_CCR1SHIFTEN_MASK)

#define TIM1_PDER_CCDREPE_SHIFT                 (0)
#define TIM1_PDER_CCDREPE_MASK                  (0x1U << TIM1_PDER_CCDREPE_SHIFT)
#define TIM1_PDER_CCDREPE(x)                    (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCDREPE_SHIFT)) & TIM1_PDER_CCDREPE_MASK)

/*!
 * @brief TIM1_CCRxFALL Register Bit Definition
 */

#define TIM1_CCRxFALL_CCRXFALL_SHIFT            (0)
#define TIM1_CCRxFALL_CCRXFALL_MASK             (0xFFFFU << TIM1_CCRxFALL_CCRXFALL_SHIFT)
#define TIM1_CCRxFALL_CCRXFALL(x)               (((uint32_t)(((uint32_t)(x)) << TIM1_CCRxFALL_CCRXFALL_SHIFT)) & TIM1_CCRxFALL_CCRXFALL_MASK)

/*!
 * @brief TIM1_BKINF Register Bit Definition
 */

#define TIM1_BKINF_BKINSEL_SHIFT                (5)
#define TIM1_BKINF_BKINSEL_MASK                 (0xFFFU << TIM1_BKINF_BKINSEL_SHIFT)
#define TIM1_BKINF_BKINSEL(x)                   (((uint32_t)(((uint32_t)(x)) << TIM1_BKINF_BKINSEL_SHIFT)) & TIM1_BKINF_BKINSEL_MASK)

#define TIM1_BKINF_BKINF_SHIFT                  (1)
#define TIM1_BKINF_BKINF_MASK                   (0xFU << TIM1_BKINF_BKINF_SHIFT)
#define TIM1_BKINF_BKINF(x)                     (((uint32_t)(((uint32_t)(x)) << TIM1_BKINF_BKINF_SHIFT)) & TIM1_BKINF_BKINF_MASK)

#define TIM1_BKINF_BKINFE_SHIFT                 (0)
#define TIM1_BKINF_BKINFE_MASK                  (0x1U << TIM1_BKINF_BKINFE_SHIFT)
#define TIM1_BKINF_BKINFE(x)                    (((uint32_t)(((uint32_t)(x)) << TIM1_BKINF_BKINFE_SHIFT)) & TIM1_BKINF_BKINFE_MASK)

/*!
 * @}
 */ /* end of group TIM1_Register_Masks */
/******************************************************************************
 *TIM1 Instance
*******************************************************************************/

#define TIM1                 ((TIM1_Type*)TIM1_BASE)

/*!
 * @}
 */ /* end of group TIM1_Peripheral_Access_Layer */



/*!
 * @addtogroup TIM14_Peripheral_Access_Layer TIM14 Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * TIM14 Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR1;                                                          ///< Control Register 1                           offset: 0x00
    __IO uint32_t Reserved0[2];                                                 ///< Reserved
    __IO uint32_t DIER;                                                         ///< DMA/Interrupt Enable Register (DMA is only suitable for the chip with built in DMA)offset: 0x0C
    __IO uint32_t SR;                                                           ///< Status Register                              offset: 0x10
    __IO uint32_t EGR;                                                          ///< Event Generation Register                    offset: 0x14
    __IO uint32_t CCMR1;                                                        ///< Capture/Compare Mode Register 1              offset: 0x18
    __IO uint32_t Reserved1[1];                                                 ///< Reserved
    __IO uint32_t CCER;                                                         ///< Capture/Compare Enable Register              offset: 0x20
    __IO uint32_t CNT;                                                          ///< Counter                                      offset: 0x24
    __IO uint32_t PSC;                                                          ///< Prescaler                                    offset: 0x28
    __IO uint32_t ARR;                                                          ///< Auto Reload Register                         offset: 0x2C
    __IO uint32_t Reserved2[1];                                                 ///< Reserved
    __IO uint32_t CCR1;                                                         ///< Capture/Compare Register 1                   offset: 0x34
    __IO uint32_t Reserved3[3];                                                 ///< Reserved
    __IO uint32_t BDTR;                                                         ///< Break And Dead-Time Register                 offset: 0x44
} TIM14_Type;

/*******************************************************************************
 * TIM14 Type
 ******************************************************************************/

/*!
 * @addtogroup TIM14_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief TIM14_CR1 Register Bit Definition
 */

#define TIM14_CR1_CKD_SHIFT                     (8)
#define TIM14_CR1_CKD_MASK                      (0x3U << TIM14_CR1_CKD_SHIFT)
#define TIM14_CR1_CKD(x)                        (((uint32_t)(((uint32_t)(x)) << TIM14_CR1_CKD_SHIFT)) & TIM14_CR1_CKD_MASK)

#define TIM14_CR1_ARPE_SHIFT                    (7)
#define TIM14_CR1_ARPE_MASK                     (0x1U << TIM14_CR1_ARPE_SHIFT)
#define TIM14_CR1_ARPE(x)                       (((uint32_t)(((uint32_t)(x)) << TIM14_CR1_ARPE_SHIFT)) & TIM14_CR1_ARPE_MASK)

#define TIM14_CR1_OPM_SHIFT                     (3)
#define TIM14_CR1_OPM_MASK                      (0x1U << TIM14_CR1_OPM_SHIFT)
#define TIM14_CR1_OPM(x)                        (((uint32_t)(((uint32_t)(x)) << TIM14_CR1_OPM_SHIFT)) & TIM14_CR1_OPM_MASK)

