UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define TIM14_CR1_URS_SHIFT                     (2)
#define TIM14_CR1_URS_MASK                      (0x1U << TIM14_CR1_URS_SHIFT)
#define TIM14_CR1_URS(x)                        (((uint32_t)(((uint32_t)(x)) << TIM14_CR1_URS_SHIFT)) & TIM14_CR1_URS_MASK)

#define TIM14_CR1_UDIS_SHIFT                    (1)
#define TIM14_CR1_UDIS_MASK                     (0x1U << TIM14_CR1_UDIS_SHIFT)
#define TIM14_CR1_UDIS(x)                       (((uint32_t)(((uint32_t)(x)) << TIM14_CR1_UDIS_SHIFT)) & TIM14_CR1_UDIS_MASK)

#define TIM14_CR1_CEN_SHIFT                     (0)
#define TIM14_CR1_CEN_MASK                      (0x1U << TIM14_CR1_CEN_SHIFT)
#define TIM14_CR1_CEN(x)                        (((uint32_t)(((uint32_t)(x)) << TIM14_CR1_CEN_SHIFT)) & TIM14_CR1_CEN_MASK)

/*!
 * @brief TIM14_DIER Register Bit Definition
 */

#define TIM14_DIER_CC1DE_SHIFT                  (9)
#define TIM14_DIER_CC1DE_MASK                   (0x1U << TIM14_DIER_CC1DE_SHIFT)
#define TIM14_DIER_CC1DE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM14_DIER_CC1DE_SHIFT)) & TIM14_DIER_CC1DE_MASK)

#define TIM14_DIER_UDE_SHIFT                    (8)
#define TIM14_DIER_UDE_MASK                     (0x1U << TIM14_DIER_UDE_SHIFT)
#define TIM14_DIER_UDE(x)                       (((uint32_t)(((uint32_t)(x)) << TIM14_DIER_UDE_SHIFT)) & TIM14_DIER_UDE_MASK)

#define TIM14_DIER_CC1IE_SHIFT                  (1)
#define TIM14_DIER_CC1IE_MASK                   (0x1U << TIM14_DIER_CC1IE_SHIFT)
#define TIM14_DIER_CC1IE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM14_DIER_CC1IE_SHIFT)) & TIM14_DIER_CC1IE_MASK)

#define TIM14_DIER_UIE_SHIFT                    (0)
#define TIM14_DIER_UIE_MASK                     (0x1U << TIM14_DIER_UIE_SHIFT)
#define TIM14_DIER_UIE(x)                       (((uint32_t)(((uint32_t)(x)) << TIM14_DIER_UIE_SHIFT)) & TIM14_DIER_UIE_MASK)

/*!
 * @brief TIM14_SR Register Bit Definition
 */

#define TIM14_SR_CC1OF_SHIFT                    (9)
#define TIM14_SR_CC1OF_MASK                     (0x1U << TIM14_SR_CC1OF_SHIFT)
#define TIM14_SR_CC1OF(x)                       (((uint32_t)(((uint32_t)(x)) << TIM14_SR_CC1OF_SHIFT)) & TIM14_SR_CC1OF_MASK)

#define TIM14_SR_CC1IF_SHIFT                    (1)
#define TIM14_SR_CC1IF_MASK                     (0x1U << TIM14_SR_CC1IF_SHIFT)
#define TIM14_SR_CC1IF(x)                       (((uint32_t)(((uint32_t)(x)) << TIM14_SR_CC1IF_SHIFT)) & TIM14_SR_CC1IF_MASK)

#define TIM14_SR_UIF_SHIFT                      (0)
#define TIM14_SR_UIF_MASK                       (0x1U << TIM14_SR_UIF_SHIFT)
#define TIM14_SR_UIF(x)                         (((uint32_t)(((uint32_t)(x)) << TIM14_SR_UIF_SHIFT)) & TIM14_SR_UIF_MASK)

/*!
 * @brief TIM14_EGR Register Bit Definition
 */

#define TIM14_EGR_CC1G_SHIFT                    (1)
#define TIM14_EGR_CC1G_MASK                     (0x1U << TIM14_EGR_CC1G_SHIFT)
#define TIM14_EGR_CC1G(x)                       (((uint32_t)(((uint32_t)(x)) << TIM14_EGR_CC1G_SHIFT)) & TIM14_EGR_CC1G_MASK)

#define TIM14_EGR_UG_SHIFT                      (0)
#define TIM14_EGR_UG_MASK                       (0x1U << TIM14_EGR_UG_SHIFT)
#define TIM14_EGR_UG(x)                         (((uint32_t)(((uint32_t)(x)) << TIM14_EGR_UG_SHIFT)) & TIM14_EGR_UG_MASK)

/*!
 * @brief TIM14_CCMR1_OUTPUT Register Bit Definition
 */

#define TIM14_CCMR1OUTPUT_OC1M_SHIFT            (4)
#define TIM14_CCMR1OUTPUT_OC1M_MASK             (0x7U << TIM14_CCMR1OUTPUT_OC1M_SHIFT)
#define TIM14_CCMR1OUTPUT_OC1M(x)               (((uint32_t)(((uint32_t)(x)) << TIM14_CCMR1OUTPUT_OC1M_SHIFT)) & TIM14_CCMR1OUTPUT_OC1M_MASK)

#define TIM14_CCMR1OUTPUT_OC1PE_SHIFT           (3)
#define TIM14_CCMR1OUTPUT_OC1PE_MASK            (0x1U << TIM14_CCMR1OUTPUT_OC1PE_SHIFT)
#define TIM14_CCMR1OUTPUT_OC1PE(x)              (((uint32_t)(((uint32_t)(x)) << TIM14_CCMR1OUTPUT_OC1PE_SHIFT)) & TIM14_CCMR1OUTPUT_OC1PE_MASK)

#define TIM14_CCMR1OUTPUT_CC1S_SHIFT            (0)
#define TIM14_CCMR1OUTPUT_CC1S_MASK             (0x3U << TIM14_CCMR1OUTPUT_CC1S_SHIFT)
#define TIM14_CCMR1OUTPUT_CC1S(x)               (((uint32_t)(((uint32_t)(x)) << TIM14_CCMR1OUTPUT_CC1S_SHIFT)) & TIM14_CCMR1OUTPUT_CC1S_MASK)

/*!
 * @brief TIM14_CCMR1_INPUT Register Bit Definition
 */

#define TIM14_CCMR1INPUT_IC1F_SHIFT             (4)
#define TIM14_CCMR1INPUT_IC1F_MASK              (0xFU << TIM14_CCMR1INPUT_IC1F_SHIFT)
#define TIM14_CCMR1INPUT_IC1F(x)                (((uint32_t)(((uint32_t)(x)) << TIM14_CCMR1INPUT_IC1F_SHIFT)) & TIM14_CCMR1INPUT_IC1F_MASK)

#define TIM14_CCMR1INPUT_IC1PSC_SHIFT           (2)
#define TIM14_CCMR1INPUT_IC1PSC_MASK            (0x3U << TIM14_CCMR1INPUT_IC1PSC_SHIFT)
#define TIM14_CCMR1INPUT_IC1PSC(x)              (((uint32_t)(((uint32_t)(x)) << TIM14_CCMR1INPUT_IC1PSC_SHIFT)) & TIM14_CCMR1INPUT_IC1PSC_MASK)

#define TIM14_CCMR1INPUT_CC1S_SHIFT             (0)
#define TIM14_CCMR1INPUT_CC1S_MASK              (0x3U << TIM14_CCMR1INPUT_CC1S_SHIFT)
#define TIM14_CCMR1INPUT_CC1S(x)                (((uint32_t)(((uint32_t)(x)) << TIM14_CCMR1INPUT_CC1S_SHIFT)) & TIM14_CCMR1INPUT_CC1S_MASK)

/*!
 * @brief TIM14_CCER Register Bit Definition
 */

#define TIM14_CCER_CC1NP_SHIFT                  (3)
#define TIM14_CCER_CC1NP_MASK                   (0x1U << TIM14_CCER_CC1NP_SHIFT)
#define TIM14_CCER_CC1NP(x)                     (((uint32_t)(((uint32_t)(x)) << TIM14_CCER_CC1NP_SHIFT)) & TIM14_CCER_CC1NP_MASK)

#define TIM14_CCER_CC1P_SHIFT                   (1)
#define TIM14_CCER_CC1P_MASK                    (0x1U << TIM14_CCER_CC1P_SHIFT)
#define TIM14_CCER_CC1P(x)                      (((uint32_t)(((uint32_t)(x)) << TIM14_CCER_CC1P_SHIFT)) & TIM14_CCER_CC1P_MASK)

#define TIM14_CCER_CC1E_SHIFT                   (0)
#define TIM14_CCER_CC1E_MASK                    (0x1U << TIM14_CCER_CC1E_SHIFT)
#define TIM14_CCER_CC1E(x)                      (((uint32_t)(((uint32_t)(x)) << TIM14_CCER_CC1E_SHIFT)) & TIM14_CCER_CC1E_MASK)

/*!
 * @brief TIM14_CNT Register Bit Definition
 */

#define TIM14_CNT_CNT_SHIFT                     (0)
#define TIM14_CNT_CNT_MASK                      (0xFFFFU << TIM14_CNT_CNT_SHIFT)
#define TIM14_CNT_CNT(x)                        (((uint32_t)(((uint32_t)(x)) << TIM14_CNT_CNT_SHIFT)) & TIM14_CNT_CNT_MASK)

/*!
 * @brief TIM14_PSC Register Bit Definition
 */

#define TIM14_PSC_PSC_SHIFT                     (0)
#define TIM14_PSC_PSC_MASK                      (0xFFFFU << TIM14_PSC_PSC_SHIFT)
#define TIM14_PSC_PSC(x)                        (((uint32_t)(((uint32_t)(x)) << TIM14_PSC_PSC_SHIFT)) & TIM14_PSC_PSC_MASK)

/*!
 * @brief TIM14_ARR Register Bit Definition
 */

