UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define TIM14_ARR_ARR_SHIFT                     (0)
#define TIM14_ARR_ARR_MASK                      (0xFFFFU << TIM14_ARR_ARR_SHIFT)
#define TIM14_ARR_ARR(x)                        (((uint32_t)(((uint32_t)(x)) << TIM14_ARR_ARR_SHIFT)) & TIM14_ARR_ARR_MASK)

/*!
 * @brief TIM14_CCR1 Register Bit Definition
 */

#define TIM14_CCR1_CCR1_SHIFT                   (0)
#define TIM14_CCR1_CCR1_MASK                    (0xFFFFU << TIM14_CCR1_CCR1_SHIFT)
#define TIM14_CCR1_CCR1(x)                      (((uint32_t)(((uint32_t)(x)) << TIM14_CCR1_CCR1_SHIFT)) & TIM14_CCR1_CCR1_MASK)

/*!
 * @brief TIM14_BDTR Register Bit Definition
 */

#define TIM14_BDTR_MOE_SHIFT                    (15)
#define TIM14_BDTR_MOE_MASK                     (0x1U << TIM14_BDTR_MOE_SHIFT)
#define TIM14_BDTR_MOE(x)                       (((uint32_t)(((uint32_t)(x)) << TIM14_BDTR_MOE_SHIFT)) & TIM14_BDTR_MOE_MASK)

/*!
 * @}
 */ /* end of group TIM14_Register_Masks */
/******************************************************************************
 *TIM14 Instance
*******************************************************************************/

#define TIM14                ((TIM14_Type*)TIM14_BASE)

/*!
 * @}
 */ /* end of group TIM14_Peripheral_Access_Layer */



/*!
 * @addtogroup TIM16_Peripheral_Access_Layer TIM16 Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * TIM16 Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR1;                                                          ///< Control Register 1                           offset: 0x00
    __IO uint32_t CR2;                                                          ///< Control Register 2                           offset: 0x04
    __IO uint32_t Reserved0[1];                                                 ///< Reserved
    __IO uint32_t DIER;                                                         ///< DMA/Interrupt Enable Register (DMA is only suitable for the chip with built in DMA)offset: 0x0C
    __IO uint32_t SR;                                                           ///< Status Register                              offset: 0x10
    __IO uint32_t EGR;                                                          ///< Event Generation Register                    offset: 0x14
    __IO uint32_t CCMR1;                                                        ///< Capture/Compare Mode Register 1              offset: 0x18
    __IO uint32_t Reserved1[1];                                                 ///< Reserved
    __IO uint32_t CCER;                                                         ///< Capture/Compare Enable Register              offset: 0x20
    __IO uint32_t CNT;                                                          ///< Counter                                      offset: 0x24
    __IO uint32_t PSC;                                                          ///< Prescaler                                    offset: 0x28
    __IO uint32_t ARR;                                                          ///< Auto Reload Register                         offset: 0x2C
    __IO uint32_t Reserved2[1];                                                 ///< Reserved
    __IO uint32_t CCR1;                                                         ///< Capture/Compare Register 1                   offset: 0x34
    __IO uint32_t Reserved3[3];                                                 ///< Reserved
    __IO uint32_t BDTR;                                                         ///< Break And Dead-Time Register                 offset: 0x44
    __IO uint32_t Reserved4[11];                                                ///< Reserved
    __IO uint32_t BKINF;                                                        ///< Break Input Filter Register                  offset: 0x74
} TIM16_Type;

/*******************************************************************************
 * TIM16 Type
 ******************************************************************************/

/*!
 * @addtogroup TIM16_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief TIM16_CR1 Register Bit Definition
 */

#define TIM16_CR1_CKD_SHIFT                     (8)
#define TIM16_CR1_CKD_MASK                      (0x3U << TIM16_CR1_CKD_SHIFT)
#define TIM16_CR1_CKD(x)                        (((uint32_t)(((uint32_t)(x)) << TIM16_CR1_CKD_SHIFT)) & TIM16_CR1_CKD_MASK)

#define TIM16_CR1_ARPE_SHIFT                    (7)
#define TIM16_CR1_ARPE_MASK                     (0x1U << TIM16_CR1_ARPE_SHIFT)
#define TIM16_CR1_ARPE(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_CR1_ARPE_SHIFT)) & TIM16_CR1_ARPE_MASK)

#define TIM16_CR1_OPM_SHIFT                     (3)
#define TIM16_CR1_OPM_MASK                      (0x1U << TIM16_CR1_OPM_SHIFT)
#define TIM16_CR1_OPM(x)                        (((uint32_t)(((uint32_t)(x)) << TIM16_CR1_OPM_SHIFT)) & TIM16_CR1_OPM_MASK)

#define TIM16_CR1_URS_SHIFT                     (2)
#define TIM16_CR1_URS_MASK                      (0x1U << TIM16_CR1_URS_SHIFT)
#define TIM16_CR1_URS(x)                        (((uint32_t)(((uint32_t)(x)) << TIM16_CR1_URS_SHIFT)) & TIM16_CR1_URS_MASK)

#define TIM16_CR1_UDIS_SHIFT                    (1)
#define TIM16_CR1_UDIS_MASK                     (0x1U << TIM16_CR1_UDIS_SHIFT)
#define TIM16_CR1_UDIS(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_CR1_UDIS_SHIFT)) & TIM16_CR1_UDIS_MASK)

#define TIM16_CR1_CEN_SHIFT                     (0)
#define TIM16_CR1_CEN_MASK                      (0x1U << TIM16_CR1_CEN_SHIFT)
#define TIM16_CR1_CEN(x)                        (((uint32_t)(((uint32_t)(x)) << TIM16_CR1_CEN_SHIFT)) & TIM16_CR1_CEN_MASK)

/*!
 * @brief TIM16_CR2 Register Bit Definition
 */

#define TIM16_CR2_OIS1N_SHIFT                   (9)
#define TIM16_CR2_OIS1N_MASK                    (0x1U << TIM16_CR2_OIS1N_SHIFT)
#define TIM16_CR2_OIS1N(x)                      (((uint32_t)(((uint32_t)(x)) << TIM16_CR2_OIS1N_SHIFT)) & TIM16_CR2_OIS1N_MASK)

#define TIM16_CR2_OIS1_SHIFT                    (8)
#define TIM16_CR2_OIS1_MASK                     (0x1U << TIM16_CR2_OIS1_SHIFT)
#define TIM16_CR2_OIS1(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_CR2_OIS1_SHIFT)) & TIM16_CR2_OIS1_MASK)

#define TIM16_CR2_CCDS_SHIFT                    (3)
#define TIM16_CR2_CCDS_MASK                     (0x1U << TIM16_CR2_CCDS_SHIFT)
#define TIM16_CR2_CCDS(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_CR2_CCDS_SHIFT)) & TIM16_CR2_CCDS_MASK)

#define TIM16_CR2_CCUS_SHIFT                    (2)
#define TIM16_CR2_CCUS_MASK                     (0x1U << TIM16_CR2_CCUS_SHIFT)
#define TIM16_CR2_CCUS(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_CR2_CCUS_SHIFT)) & TIM16_CR2_CCUS_MASK)

#define TIM16_CR2_CCPC_SHIFT                    (0)
#define TIM16_CR2_CCPC_MASK                     (0x1U << TIM16_CR2_CCPC_SHIFT)
#define TIM16_CR2_CCPC(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_CR2_CCPC_SHIFT)) & TIM16_CR2_CCPC_MASK)

/*!
 * @brief TIM16_DIER Register Bit Definition
 */

#define TIM16_DIER_CC1DE_SHIFT                  (9)
#define TIM16_DIER_CC1DE_MASK                   (0x1U << TIM16_DIER_CC1DE_SHIFT)
#define TIM16_DIER_CC1DE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM16_DIER_CC1DE_SHIFT)) & TIM16_DIER_CC1DE_MASK)

#define TIM16_DIER_UDE_SHIFT                    (8)
#define TIM16_DIER_UDE_MASK                     (0x1U << TIM16_DIER_UDE_SHIFT)
#define TIM16_DIER_UDE(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_DIER_UDE_SHIFT)) & TIM16_DIER_UDE_MASK)

#define TIM16_DIER_BIE_SHIFT                    (7)
#define TIM16_DIER_BIE_MASK                     (0x1U << TIM16_DIER_BIE_SHIFT)
#define TIM16_DIER_BIE(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_DIER_BIE_SHIFT)) & TIM16_DIER_BIE_MASK)

#define TIM16_DIER_COMIE_SHIFT                  (5)
#define TIM16_DIER_COMIE_MASK                   (0x1U << TIM16_DIER_COMIE_SHIFT)
#define TIM16_DIER_COMIE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM16_DIER_COMIE_SHIFT)) & TIM16_DIER_COMIE_MASK)

#define TIM16_DIER_CC1IE_SHIFT                  (1)
#define TIM16_DIER_CC1IE_MASK                   (0x1U << TIM16_DIER_CC1IE_SHIFT)
#define TIM16_DIER_CC1IE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM16_DIER_CC1IE_SHIFT)) & TIM16_DIER_CC1IE_MASK)

