UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define TIM16_DIER_UIE_SHIFT                    (0)
#define TIM16_DIER_UIE_MASK                     (0x1U << TIM16_DIER_UIE_SHIFT)
#define TIM16_DIER_UIE(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_DIER_UIE_SHIFT)) & TIM16_DIER_UIE_MASK)

/*!
 * @brief TIM16_SR Register Bit Definition
 */

#define TIM16_SR_CC1OF_SHIFT                    (9)
#define TIM16_SR_CC1OF_MASK                     (0x1U << TIM16_SR_CC1OF_SHIFT)
#define TIM16_SR_CC1OF(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_SR_CC1OF_SHIFT)) & TIM16_SR_CC1OF_MASK)

#define TIM16_SR_BIF_SHIFT                      (7)
#define TIM16_SR_BIF_MASK                       (0x1U << TIM16_SR_BIF_SHIFT)
#define TIM16_SR_BIF(x)                         (((uint32_t)(((uint32_t)(x)) << TIM16_SR_BIF_SHIFT)) & TIM16_SR_BIF_MASK)

#define TIM16_SR_COMIF_SHIFT                    (5)
#define TIM16_SR_COMIF_MASK                     (0x1U << TIM16_SR_COMIF_SHIFT)
#define TIM16_SR_COMIF(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_SR_COMIF_SHIFT)) & TIM16_SR_COMIF_MASK)

#define TIM16_SR_CC1IF_SHIFT                    (1)
#define TIM16_SR_CC1IF_MASK                     (0x1U << TIM16_SR_CC1IF_SHIFT)
#define TIM16_SR_CC1IF(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_SR_CC1IF_SHIFT)) & TIM16_SR_CC1IF_MASK)

#define TIM16_SR_UIF_SHIFT                      (0)
#define TIM16_SR_UIF_MASK                       (0x1U << TIM16_SR_UIF_SHIFT)
#define TIM16_SR_UIF(x)                         (((uint32_t)(((uint32_t)(x)) << TIM16_SR_UIF_SHIFT)) & TIM16_SR_UIF_MASK)

/*!
 * @brief TIM16_EGR Register Bit Definition
 */

#define TIM16_EGR_BG_SHIFT                      (7)
#define TIM16_EGR_BG_MASK                       (0x1U << TIM16_EGR_BG_SHIFT)
#define TIM16_EGR_BG(x)                         (((uint32_t)(((uint32_t)(x)) << TIM16_EGR_BG_SHIFT)) & TIM16_EGR_BG_MASK)

#define TIM16_EGR_COMG_SHIFT                    (5)
#define TIM16_EGR_COMG_MASK                     (0x1U << TIM16_EGR_COMG_SHIFT)
#define TIM16_EGR_COMG(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_EGR_COMG_SHIFT)) & TIM16_EGR_COMG_MASK)

#define TIM16_EGR_CC1G_SHIFT                    (1)
#define TIM16_EGR_CC1G_MASK                     (0x1U << TIM16_EGR_CC1G_SHIFT)
#define TIM16_EGR_CC1G(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_EGR_CC1G_SHIFT)) & TIM16_EGR_CC1G_MASK)

#define TIM16_EGR_UG_SHIFT                      (0)
#define TIM16_EGR_UG_MASK                       (0x1U << TIM16_EGR_UG_SHIFT)
#define TIM16_EGR_UG(x)                         (((uint32_t)(((uint32_t)(x)) << TIM16_EGR_UG_SHIFT)) & TIM16_EGR_UG_MASK)

/*!
 * @brief TIM16_CCMR1_OUTPUT Register Bit Definition
 */

#define TIM16_CCMR1OUTPUT_OC1M_SHIFT            (4)
#define TIM16_CCMR1OUTPUT_OC1M_MASK             (0x7U << TIM16_CCMR1OUTPUT_OC1M_SHIFT)
#define TIM16_CCMR1OUTPUT_OC1M(x)               (((uint32_t)(((uint32_t)(x)) << TIM16_CCMR1OUTPUT_OC1M_SHIFT)) & TIM16_CCMR1OUTPUT_OC1M_MASK)

#define TIM16_CCMR1OUTPUT_OC1PE_SHIFT           (3)
#define TIM16_CCMR1OUTPUT_OC1PE_MASK            (0x1U << TIM16_CCMR1OUTPUT_OC1PE_SHIFT)
#define TIM16_CCMR1OUTPUT_OC1PE(x)              (((uint32_t)(((uint32_t)(x)) << TIM16_CCMR1OUTPUT_OC1PE_SHIFT)) & TIM16_CCMR1OUTPUT_OC1PE_MASK)

#define TIM16_CCMR1OUTPUT_OC1FE_SHIFT           (2)
#define TIM16_CCMR1OUTPUT_OC1FE_MASK            (0x1U << TIM16_CCMR1OUTPUT_OC1FE_SHIFT)
#define TIM16_CCMR1OUTPUT_OC1FE(x)              (((uint32_t)(((uint32_t)(x)) << TIM16_CCMR1OUTPUT_OC1FE_SHIFT)) & TIM16_CCMR1OUTPUT_OC1FE_MASK)

#define TIM16_CCMR1OUTPUT_CC1S_SHIFT            (0)
#define TIM16_CCMR1OUTPUT_CC1S_MASK             (0x3U << TIM16_CCMR1OUTPUT_CC1S_SHIFT)
#define TIM16_CCMR1OUTPUT_CC1S(x)               (((uint32_t)(((uint32_t)(x)) << TIM16_CCMR1OUTPUT_CC1S_SHIFT)) & TIM16_CCMR1OUTPUT_CC1S_MASK)

/*!
 * @brief TIM16_CCMR1_INPUT Register Bit Definition
 */

#define TIM16_CCMR1INPUT_IC1F_SHIFT             (4)
#define TIM16_CCMR1INPUT_IC1F_MASK              (0xFU << TIM16_CCMR1INPUT_IC1F_SHIFT)
#define TIM16_CCMR1INPUT_IC1F(x)                (((uint32_t)(((uint32_t)(x)) << TIM16_CCMR1INPUT_IC1F_SHIFT)) & TIM16_CCMR1INPUT_IC1F_MASK)

#define TIM16_CCMR1INPUT_IC1PSC_SHIFT           (2)
#define TIM16_CCMR1INPUT_IC1PSC_MASK            (0x3U << TIM16_CCMR1INPUT_IC1PSC_SHIFT)
#define TIM16_CCMR1INPUT_IC1PSC(x)              (((uint32_t)(((uint32_t)(x)) << TIM16_CCMR1INPUT_IC1PSC_SHIFT)) & TIM16_CCMR1INPUT_IC1PSC_MASK)

#define TIM16_CCMR1INPUT_CC1S_SHIFT             (0)
#define TIM16_CCMR1INPUT_CC1S_MASK              (0x3U << TIM16_CCMR1INPUT_CC1S_SHIFT)
#define TIM16_CCMR1INPUT_CC1S(x)                (((uint32_t)(((uint32_t)(x)) << TIM16_CCMR1INPUT_CC1S_SHIFT)) & TIM16_CCMR1INPUT_CC1S_MASK)

/*!
 * @brief TIM16_CCER Register Bit Definition
 */

#define TIM16_CCER_CC1NP_SHIFT                  (3)
#define TIM16_CCER_CC1NP_MASK                   (0x1U << TIM16_CCER_CC1NP_SHIFT)
#define TIM16_CCER_CC1NP(x)                     (((uint32_t)(((uint32_t)(x)) << TIM16_CCER_CC1NP_SHIFT)) & TIM16_CCER_CC1NP_MASK)

#define TIM16_CCER_CC1NE_SHIFT                  (2)
#define TIM16_CCER_CC1NE_MASK                   (0x1U << TIM16_CCER_CC1NE_SHIFT)
#define TIM16_CCER_CC1NE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM16_CCER_CC1NE_SHIFT)) & TIM16_CCER_CC1NE_MASK)

#define TIM16_CCER_CC1P_SHIFT                   (1)
#define TIM16_CCER_CC1P_MASK                    (0x1U << TIM16_CCER_CC1P_SHIFT)
#define TIM16_CCER_CC1P(x)                      (((uint32_t)(((uint32_t)(x)) << TIM16_CCER_CC1P_SHIFT)) & TIM16_CCER_CC1P_MASK)

#define TIM16_CCER_CC1E_SHIFT                   (0)
#define TIM16_CCER_CC1E_MASK                    (0x1U << TIM16_CCER_CC1E_SHIFT)
#define TIM16_CCER_CC1E(x)                      (((uint32_t)(((uint32_t)(x)) << TIM16_CCER_CC1E_SHIFT)) & TIM16_CCER_CC1E_MASK)

/*!
 * @brief TIM16_CNT Register Bit Definition
 */

#define TIM16_CNT_CNT_SHIFT                     (0)
#define TIM16_CNT_CNT_MASK                      (0xFFFFU << TIM16_CNT_CNT_SHIFT)
#define TIM16_CNT_CNT(x)                        (((uint32_t)(((uint32_t)(x)) << TIM16_CNT_CNT_SHIFT)) & TIM16_CNT_CNT_MASK)

/*!
 * @brief TIM16_PSC Register Bit Definition
 */

