UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define TIM16_PSC_PSC_SHIFT                     (0)
#define TIM16_PSC_PSC_MASK                      (0xFFFFU << TIM16_PSC_PSC_SHIFT)
#define TIM16_PSC_PSC(x)                        (((uint32_t)(((uint32_t)(x)) << TIM16_PSC_PSC_SHIFT)) & TIM16_PSC_PSC_MASK)

/*!
 * @brief TIM16_ARR Register Bit Definition
 */

#define TIM16_ARR_ARR_SHIFT                     (0)
#define TIM16_ARR_ARR_MASK                      (0xFFFFU << TIM16_ARR_ARR_SHIFT)
#define TIM16_ARR_ARR(x)                        (((uint32_t)(((uint32_t)(x)) << TIM16_ARR_ARR_SHIFT)) & TIM16_ARR_ARR_MASK)

/*!
 * @brief TIM16_CCR1 Register Bit Definition
 */

#define TIM16_CCR1_CCR1_SHIFT                   (0)
#define TIM16_CCR1_CCR1_MASK                    (0xFFFFU << TIM16_CCR1_CCR1_SHIFT)
#define TIM16_CCR1_CCR1(x)                      (((uint32_t)(((uint32_t)(x)) << TIM16_CCR1_CCR1_SHIFT)) & TIM16_CCR1_CCR1_MASK)

/*!
 * @brief TIM16_BDTR Register Bit Definition
 */

#define TIM16_BDTR_MOE_SHIFT                    (15)
#define TIM16_BDTR_MOE_MASK                     (0x1U << TIM16_BDTR_MOE_SHIFT)
#define TIM16_BDTR_MOE(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_BDTR_MOE_SHIFT)) & TIM16_BDTR_MOE_MASK)

#define TIM16_BDTR_AOE_SHIFT                    (14)
#define TIM16_BDTR_AOE_MASK                     (0x1U << TIM16_BDTR_AOE_SHIFT)
#define TIM16_BDTR_AOE(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_BDTR_AOE_SHIFT)) & TIM16_BDTR_AOE_MASK)

#define TIM16_BDTR_BKP_SHIFT                    (13)
#define TIM16_BDTR_BKP_MASK                     (0x1U << TIM16_BDTR_BKP_SHIFT)
#define TIM16_BDTR_BKP(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_BDTR_BKP_SHIFT)) & TIM16_BDTR_BKP_MASK)

#define TIM16_BDTR_BKE_SHIFT                    (12)
#define TIM16_BDTR_BKE_MASK                     (0x1U << TIM16_BDTR_BKE_SHIFT)
#define TIM16_BDTR_BKE(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_BDTR_BKE_SHIFT)) & TIM16_BDTR_BKE_MASK)

#define TIM16_BDTR_OSSR_SHIFT                   (11)
#define TIM16_BDTR_OSSR_MASK                    (0x1U << TIM16_BDTR_OSSR_SHIFT)
#define TIM16_BDTR_OSSR(x)                      (((uint32_t)(((uint32_t)(x)) << TIM16_BDTR_OSSR_SHIFT)) & TIM16_BDTR_OSSR_MASK)

#define TIM16_BDTR_OSSI_SHIFT                   (10)
#define TIM16_BDTR_OSSI_MASK                    (0x1U << TIM16_BDTR_OSSI_SHIFT)
#define TIM16_BDTR_OSSI(x)                      (((uint32_t)(((uint32_t)(x)) << TIM16_BDTR_OSSI_SHIFT)) & TIM16_BDTR_OSSI_MASK)

#define TIM16_BDTR_LOCK_SHIFT                   (8)
#define TIM16_BDTR_LOCK_MASK                    (0x3U << TIM16_BDTR_LOCK_SHIFT)
#define TIM16_BDTR_LOCK(x)                      (((uint32_t)(((uint32_t)(x)) << TIM16_BDTR_LOCK_SHIFT)) & TIM16_BDTR_LOCK_MASK)

#define TIM16_BDTR_DTG_SHIFT                    (0)
#define TIM16_BDTR_DTG_MASK                     (0xFFU << TIM16_BDTR_DTG_SHIFT)
#define TIM16_BDTR_DTG(x)                       (((uint32_t)(((uint32_t)(x)) << TIM16_BDTR_DTG_SHIFT)) & TIM16_BDTR_DTG_MASK)

/*!
 * @brief TIM16_BKINF Register Bit Definition
 */

#define TIM16_BKINF_BKINSEL_SHIFT               (5)
#define TIM16_BKINF_BKINSEL_MASK                (0xFFFU << TIM16_BKINF_BKINSEL_SHIFT)
#define TIM16_BKINF_BKINSEL(x)                  (((uint32_t)(((uint32_t)(x)) << TIM16_BKINF_BKINSEL_SHIFT)) & TIM16_BKINF_BKINSEL_MASK)

#define TIM16_BKINF_BKINF_SHIFT                 (1)
#define TIM16_BKINF_BKINF_MASK                  (0xFU << TIM16_BKINF_BKINF_SHIFT)
#define TIM16_BKINF_BKINF(x)                    (((uint32_t)(((uint32_t)(x)) << TIM16_BKINF_BKINF_SHIFT)) & TIM16_BKINF_BKINF_MASK)

#define TIM16_BKINF_BKINFE_SHIFT                (0)
#define TIM16_BKINF_BKINFE_MASK                 (0x1U << TIM16_BKINF_BKINFE_SHIFT)
#define TIM16_BKINF_BKINFE(x)                   (((uint32_t)(((uint32_t)(x)) << TIM16_BKINF_BKINFE_SHIFT)) & TIM16_BKINF_BKINFE_MASK)

/*!
 * @}
 */ /* end of group TIM16_Register_Masks */
/******************************************************************************
 *TIM16 Instance
*******************************************************************************/

#define TIM16                ((TIM16_Type*)TIM16_BASE)

#define TIM17                ((TIM16_Type*)TIM17_BASE)

/*!
 * @}
 */ /* end of group TIM16_Peripheral_Access_Layer */



/*!
 * @addtogroup TIM2_Peripheral_Access_Layer TIM2 Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * TIM2 Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR1;                                                          ///< Control Register 1                           offset: 0x00
    __IO uint32_t CR2;                                                          ///< Control Register 2                           offset: 0x04
    __IO uint32_t SMCR;                                                         ///< Slave Mode Control Register                  offset: 0x08
    __IO uint32_t DIER;                                                         ///< DMA/Interrupt Enable Register (DMA is only suitable for the chip with built in DMA)offset: 0x0C
    __IO uint32_t SR;                                                           ///< Status Register                              offset: 0x10
    __IO uint32_t EGR;                                                          ///< Event Generation Register                    offset: 0x14
    __IO uint32_t CCMR1;                                                        ///< Capture/Compare Mode Register 1              offset: 0x18
    __IO uint32_t CCMR2;                                                        ///< Capture/Compare Mode Register 2              offset: 0x1C
    __IO uint32_t CCER;                                                         ///< Capture/Compare Enable Register              offset: 0x20
    __IO uint32_t CNT;                                                          ///< Counter                                      offset: 0x24
    __IO uint32_t PSC;                                                          ///< Prescaler                                    offset: 0x28
    __IO uint32_t ARR;                                                          ///< Auto Reload Register                         offset: 0x2C
    __IO uint32_t Reserved0[1];                                                 ///< Reserved
    __IO uint32_t CCR1;                                                         ///< Capture/Compare Register 1                   offset: 0x34
    __IO uint32_t CCR2;                                                         ///< Capture/Compare Register 2                   offset: 0x38
    __IO uint32_t CCR3;                                                         ///< Capture/Compare Register 3                   offset: 0x3C
    __IO uint32_t CCR4;                                                         ///< Capture/Compare Register 4                   offset: 0x40
    __IO uint32_t Reserved1[1];                                                 ///< Reserved
    __IO uint32_t DCR;                                                          ///< DMA Control Register (only suitable for the chip with built in DMA)offset: 0x48
    __IO uint32_t DMAR;                                                         ///< DMA Address Register Of Continuous Mode (only suitable for the chip with built in DMA)offset: 0x4C
    __IO uint32_t OR;                                                           ///< Input Option Register                        offset: 0x50
} TIM2_Type;

