UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define TIM2_CCMR1OUTPUT_OC2CE_SHIFT            (15)
#define TIM2_CCMR1OUTPUT_OC2CE_MASK             (0x1U << TIM2_CCMR1OUTPUT_OC2CE_SHIFT)
#define TIM2_CCMR1OUTPUT_OC2CE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1OUTPUT_OC2CE_SHIFT)) & TIM2_CCMR1OUTPUT_OC2CE_MASK)

#define TIM2_CCMR1OUTPUT_OC2M_SHIFT             (12)
#define TIM2_CCMR1OUTPUT_OC2M_MASK              (0x7U << TIM2_CCMR1OUTPUT_OC2M_SHIFT)
#define TIM2_CCMR1OUTPUT_OC2M(x)                (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1OUTPUT_OC2M_SHIFT)) & TIM2_CCMR1OUTPUT_OC2M_MASK)

#define TIM2_CCMR1OUTPUT_OC2PE_SHIFT            (11)
#define TIM2_CCMR1OUTPUT_OC2PE_MASK             (0x1U << TIM2_CCMR1OUTPUT_OC2PE_SHIFT)
#define TIM2_CCMR1OUTPUT_OC2PE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1OUTPUT_OC2PE_SHIFT)) & TIM2_CCMR1OUTPUT_OC2PE_MASK)

#define TIM2_CCMR1OUTPUT_OC2FE_SHIFT            (10)
#define TIM2_CCMR1OUTPUT_OC2FE_MASK             (0x1U << TIM2_CCMR1OUTPUT_OC2FE_SHIFT)
#define TIM2_CCMR1OUTPUT_OC2FE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1OUTPUT_OC2FE_SHIFT)) & TIM2_CCMR1OUTPUT_OC2FE_MASK)

#define TIM2_CCMR1OUTPUT_CC2S_SHIFT             (8)
#define TIM2_CCMR1OUTPUT_CC2S_MASK              (0x3U << TIM2_CCMR1OUTPUT_CC2S_SHIFT)
#define TIM2_CCMR1OUTPUT_CC2S(x)                (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1OUTPUT_CC2S_SHIFT)) & TIM2_CCMR1OUTPUT_CC2S_MASK)

#define TIM2_CCMR1OUTPUT_OC1CE_SHIFT            (7)
#define TIM2_CCMR1OUTPUT_OC1CE_MASK             (0x1U << TIM2_CCMR1OUTPUT_OC1CE_SHIFT)
#define TIM2_CCMR1OUTPUT_OC1CE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1OUTPUT_OC1CE_SHIFT)) & TIM2_CCMR1OUTPUT_OC1CE_MASK)

#define TIM2_CCMR1OUTPUT_OC1M_SHIFT             (4)
#define TIM2_CCMR1OUTPUT_OC1M_MASK              (0x7U << TIM2_CCMR1OUTPUT_OC1M_SHIFT)
#define TIM2_CCMR1OUTPUT_OC1M(x)                (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1OUTPUT_OC1M_SHIFT)) & TIM2_CCMR1OUTPUT_OC1M_MASK)

#define TIM2_CCMR1OUTPUT_OC1PE_SHIFT            (3)
#define TIM2_CCMR1OUTPUT_OC1PE_MASK             (0x1U << TIM2_CCMR1OUTPUT_OC1PE_SHIFT)
#define TIM2_CCMR1OUTPUT_OC1PE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1OUTPUT_OC1PE_SHIFT)) & TIM2_CCMR1OUTPUT_OC1PE_MASK)

#define TIM2_CCMR1OUTPUT_OC1FE_SHIFT            (2)
#define TIM2_CCMR1OUTPUT_OC1FE_MASK             (0x1U << TIM2_CCMR1OUTPUT_OC1FE_SHIFT)
#define TIM2_CCMR1OUTPUT_OC1FE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1OUTPUT_OC1FE_SHIFT)) & TIM2_CCMR1OUTPUT_OC1FE_MASK)

#define TIM2_CCMR1OUTPUT_CC1S_SHIFT             (0)
#define TIM2_CCMR1OUTPUT_CC1S_MASK              (0x3U << TIM2_CCMR1OUTPUT_CC1S_SHIFT)
#define TIM2_CCMR1OUTPUT_CC1S(x)                (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1OUTPUT_CC1S_SHIFT)) & TIM2_CCMR1OUTPUT_CC1S_MASK)

/*!
 * @brief TIM2_CCMR1_INPUT Register Bit Definition
 */

#define TIM2_CCMR1INPUT_IC2F_SHIFT              (12)
#define TIM2_CCMR1INPUT_IC2F_MASK               (0xFU << TIM2_CCMR1INPUT_IC2F_SHIFT)
#define TIM2_CCMR1INPUT_IC2F(x)                 (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1INPUT_IC2F_SHIFT)) & TIM2_CCMR1INPUT_IC2F_MASK)

#define TIM2_CCMR1INPUT_IC2PSC_SHIFT            (10)
#define TIM2_CCMR1INPUT_IC2PSC_MASK             (0x3U << TIM2_CCMR1INPUT_IC2PSC_SHIFT)
#define TIM2_CCMR1INPUT_IC2PSC(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1INPUT_IC2PSC_SHIFT)) & TIM2_CCMR1INPUT_IC2PSC_MASK)

#define TIM2_CCMR1INPUT_CC2S_SHIFT              (8)
#define TIM2_CCMR1INPUT_CC2S_MASK               (0x3U << TIM2_CCMR1INPUT_CC2S_SHIFT)
#define TIM2_CCMR1INPUT_CC2S(x)                 (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1INPUT_CC2S_SHIFT)) & TIM2_CCMR1INPUT_CC2S_MASK)

#define TIM2_CCMR1INPUT_IC1F_SHIFT              (4)
#define TIM2_CCMR1INPUT_IC1F_MASK               (0xFU << TIM2_CCMR1INPUT_IC1F_SHIFT)
#define TIM2_CCMR1INPUT_IC1F(x)                 (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1INPUT_IC1F_SHIFT)) & TIM2_CCMR1INPUT_IC1F_MASK)

#define TIM2_CCMR1INPUT_IC1PSC_SHIFT            (2)
#define TIM2_CCMR1INPUT_IC1PSC_MASK             (0x3U << TIM2_CCMR1INPUT_IC1PSC_SHIFT)
#define TIM2_CCMR1INPUT_IC1PSC(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1INPUT_IC1PSC_SHIFT)) & TIM2_CCMR1INPUT_IC1PSC_MASK)

#define TIM2_CCMR1INPUT_CC1S_SHIFT              (0)
#define TIM2_CCMR1INPUT_CC1S_MASK               (0x3U << TIM2_CCMR1INPUT_CC1S_SHIFT)
#define TIM2_CCMR1INPUT_CC1S(x)                 (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1INPUT_CC1S_SHIFT)) & TIM2_CCMR1INPUT_CC1S_MASK)

/*!
 * @brief TIM2_CCMR2_OUTPUT Register Bit Definition
 */

#define TIM2_CCMR2OUTPUT_OC4CE_SHIFT            (15)
#define TIM2_CCMR2OUTPUT_OC4CE_MASK             (0x1U << TIM2_CCMR2OUTPUT_OC4CE_SHIFT)
#define TIM2_CCMR2OUTPUT_OC4CE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC4CE_SHIFT)) & TIM2_CCMR2OUTPUT_OC4CE_MASK)

#define TIM2_CCMR2OUTPUT_OC4M_SHIFT             (12)
#define TIM2_CCMR2OUTPUT_OC4M_MASK              (0x7U << TIM2_CCMR2OUTPUT_OC4M_SHIFT)
#define TIM2_CCMR2OUTPUT_OC4M(x)                (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC4M_SHIFT)) & TIM2_CCMR2OUTPUT_OC4M_MASK)

#define TIM2_CCMR2OUTPUT_OC4PE_SHIFT            (11)
#define TIM2_CCMR2OUTPUT_OC4PE_MASK             (0x1U << TIM2_CCMR2OUTPUT_OC4PE_SHIFT)
#define TIM2_CCMR2OUTPUT_OC4PE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC4PE_SHIFT)) & TIM2_CCMR2OUTPUT_OC4PE_MASK)

#define TIM2_CCMR2OUTPUT_OC4FE_SHIFT            (10)
#define TIM2_CCMR2OUTPUT_OC4FE_MASK             (0x1U << TIM2_CCMR2OUTPUT_OC4FE_SHIFT)
#define TIM2_CCMR2OUTPUT_OC4FE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC4FE_SHIFT)) & TIM2_CCMR2OUTPUT_OC4FE_MASK)

#define TIM2_CCMR2OUTPUT_CC4S_SHIFT             (8)
#define TIM2_CCMR2OUTPUT_CC4S_MASK              (0x3U << TIM2_CCMR2OUTPUT_CC4S_SHIFT)
#define TIM2_CCMR2OUTPUT_CC4S(x)                (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_CC4S_SHIFT)) & TIM2_CCMR2OUTPUT_CC4S_MASK)

