UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define TIM2_CCMR2OUTPUT_OC3CE_SHIFT            (7)
#define TIM2_CCMR2OUTPUT_OC3CE_MASK             (0x1U << TIM2_CCMR2OUTPUT_OC3CE_SHIFT)
#define TIM2_CCMR2OUTPUT_OC3CE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC3CE_SHIFT)) & TIM2_CCMR2OUTPUT_OC3CE_MASK)

#define TIM2_CCMR2OUTPUT_OC3M_SHIFT             (4)
#define TIM2_CCMR2OUTPUT_OC3M_MASK              (0x7U << TIM2_CCMR2OUTPUT_OC3M_SHIFT)
#define TIM2_CCMR2OUTPUT_OC3M(x)                (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC3M_SHIFT)) & TIM2_CCMR2OUTPUT_OC3M_MASK)

#define TIM2_CCMR2OUTPUT_OC3PE_SHIFT            (3)
#define TIM2_CCMR2OUTPUT_OC3PE_MASK             (0x1U << TIM2_CCMR2OUTPUT_OC3PE_SHIFT)
#define TIM2_CCMR2OUTPUT_OC3PE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC3PE_SHIFT)) & TIM2_CCMR2OUTPUT_OC3PE_MASK)

#define TIM2_CCMR2OUTPUT_OC3FE_SHIFT            (2)
#define TIM2_CCMR2OUTPUT_OC3FE_MASK             (0x1U << TIM2_CCMR2OUTPUT_OC3FE_SHIFT)
#define TIM2_CCMR2OUTPUT_OC3FE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC3FE_SHIFT)) & TIM2_CCMR2OUTPUT_OC3FE_MASK)

#define TIM2_CCMR2OUTPUT_CC3S_SHIFT             (0)
#define TIM2_CCMR2OUTPUT_CC3S_MASK              (0x3U << TIM2_CCMR2OUTPUT_CC3S_SHIFT)
#define TIM2_CCMR2OUTPUT_CC3S(x)                (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_CC3S_SHIFT)) & TIM2_CCMR2OUTPUT_CC3S_MASK)

/*!
 * @brief TIM2_CCMR2_INPUT Register Bit Definition
 */

#define TIM2_CCMR2INPUT_IC4F_SHIFT              (12)
#define TIM2_CCMR2INPUT_IC4F_MASK               (0xFU << TIM2_CCMR2INPUT_IC4F_SHIFT)
#define TIM2_CCMR2INPUT_IC4F(x)                 (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2INPUT_IC4F_SHIFT)) & TIM2_CCMR2INPUT_IC4F_MASK)

#define TIM2_CCMR2INPUT_IC4PSC_SHIFT            (10)
#define TIM2_CCMR2INPUT_IC4PSC_MASK             (0x3U << TIM2_CCMR2INPUT_IC4PSC_SHIFT)
#define TIM2_CCMR2INPUT_IC4PSC(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2INPUT_IC4PSC_SHIFT)) & TIM2_CCMR2INPUT_IC4PSC_MASK)

#define TIM2_CCMR2INPUT_CC4S_SHIFT              (8)
#define TIM2_CCMR2INPUT_CC4S_MASK               (0x3U << TIM2_CCMR2INPUT_CC4S_SHIFT)
#define TIM2_CCMR2INPUT_CC4S(x)                 (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2INPUT_CC4S_SHIFT)) & TIM2_CCMR2INPUT_CC4S_MASK)

#define TIM2_CCMR2INPUT_IC3F_SHIFT              (4)
#define TIM2_CCMR2INPUT_IC3F_MASK               (0xFU << TIM2_CCMR2INPUT_IC3F_SHIFT)
#define TIM2_CCMR2INPUT_IC3F(x)                 (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2INPUT_IC3F_SHIFT)) & TIM2_CCMR2INPUT_IC3F_MASK)

#define TIM2_CCMR2INPUT_IC3PSC_SHIFT            (2)
#define TIM2_CCMR2INPUT_IC3PSC_MASK             (0x3U << TIM2_CCMR2INPUT_IC3PSC_SHIFT)
#define TIM2_CCMR2INPUT_IC3PSC(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2INPUT_IC3PSC_SHIFT)) & TIM2_CCMR2INPUT_IC3PSC_MASK)

#define TIM2_CCMR2INPUT_CC3S_SHIFT              (0)
#define TIM2_CCMR2INPUT_CC3S_MASK               (0x3U << TIM2_CCMR2INPUT_CC3S_SHIFT)
#define TIM2_CCMR2INPUT_CC3S(x)                 (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2INPUT_CC3S_SHIFT)) & TIM2_CCMR2INPUT_CC3S_MASK)

/*!
 * @brief TIM2_CCER Register Bit Definition
 */

#define TIM2_CCER_CC4NP_SHIFT                   (15)
#define TIM2_CCER_CC4NP_MASK                    (0x1U << TIM2_CCER_CC4NP_SHIFT)
#define TIM2_CCER_CC4NP(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCER_CC4NP_SHIFT)) & TIM2_CCER_CC4NP_MASK)

#define TIM2_CCER_CC4P_SHIFT                    (13)
#define TIM2_CCER_CC4P_MASK                     (0x1U << TIM2_CCER_CC4P_SHIFT)
#define TIM2_CCER_CC4P(x)                       (((uint32_t)(((uint32_t)(x)) << TIM2_CCER_CC4P_SHIFT)) & TIM2_CCER_CC4P_MASK)

#define TIM2_CCER_CC4E_SHIFT                    (12)
#define TIM2_CCER_CC4E_MASK                     (0x1U << TIM2_CCER_CC4E_SHIFT)
#define TIM2_CCER_CC4E(x)                       (((uint32_t)(((uint32_t)(x)) << TIM2_CCER_CC4E_SHIFT)) & TIM2_CCER_CC4E_MASK)

#define TIM2_CCER_CC3NP_SHIFT                   (11)
#define TIM2_CCER_CC3NP_MASK                    (0x1U << TIM2_CCER_CC3NP_SHIFT)
#define TIM2_CCER_CC3NP(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCER_CC3NP_SHIFT)) & TIM2_CCER_CC3NP_MASK)

#define TIM2_CCER_CC3P_SHIFT                    (9)
#define TIM2_CCER_CC3P_MASK                     (0x1U << TIM2_CCER_CC3P_SHIFT)
#define TIM2_CCER_CC3P(x)                       (((uint32_t)(((uint32_t)(x)) << TIM2_CCER_CC3P_SHIFT)) & TIM2_CCER_CC3P_MASK)

#define TIM2_CCER_CC3E_SHIFT                    (8)
#define TIM2_CCER_CC3E_MASK                     (0x1U << TIM2_CCER_CC3E_SHIFT)
#define TIM2_CCER_CC3E(x)                       (((uint32_t)(((uint32_t)(x)) << TIM2_CCER_CC3E_SHIFT)) & TIM2_CCER_CC3E_MASK)

#define TIM2_CCER_CC2NP_SHIFT                   (7)
#define TIM2_CCER_CC2NP_MASK                    (0x1U << TIM2_CCER_CC2NP_SHIFT)
#define TIM2_CCER_CC2NP(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCER_CC2NP_SHIFT)) & TIM2_CCER_CC2NP_MASK)

#define TIM2_CCER_CC2P_SHIFT                    (5)
#define TIM2_CCER_CC2P_MASK                     (0x1U << TIM2_CCER_CC2P_SHIFT)
#define TIM2_CCER_CC2P(x)                       (((uint32_t)(((uint32_t)(x)) << TIM2_CCER_CC2P_SHIFT)) & TIM2_CCER_CC2P_MASK)

#define TIM2_CCER_CC2E_SHIFT                    (4)
#define TIM2_CCER_CC2E_MASK                     (0x1U << TIM2_CCER_CC2E_SHIFT)
#define TIM2_CCER_CC2E(x)                       (((uint32_t)(((uint32_t)(x)) << TIM2_CCER_CC2E_SHIFT)) & TIM2_CCER_CC2E_MASK)

#define TIM2_CCER_CC1NP_SHIFT                   (3)
#define TIM2_CCER_CC1NP_MASK                    (0x1U << TIM2_CCER_CC1NP_SHIFT)
#define TIM2_CCER_CC1NP(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCER_CC1NP_SHIFT)) & TIM2_CCER_CC1NP_MASK)

#define TIM2_CCER_CC1P_SHIFT                    (1)
#define TIM2_CCER_CC1P_MASK                     (0x1U << TIM2_CCER_CC1P_SHIFT)
#define TIM2_CCER_CC1P(x)                       (((uint32_t)(((uint32_t)(x)) << TIM2_CCER_CC1P_SHIFT)) & TIM2_CCER_CC1P_MASK)

#define TIM2_CCER_CC1E_SHIFT                    (0)
#define TIM2_CCER_CC1E_MASK                     (0x1U << TIM2_CCER_CC1E_SHIFT)
#define TIM2_CCER_CC1E(x)                       (((uint32_t)(((uint32_t)(x)) << TIM2_CCER_CC1E_SHIFT)) & TIM2_CCER_CC1E_MASK)

/*!
 * @brief TIM2_CNT Register Bit Definition
 */

#define TIM2_CNT_CNT_SHIFT                      (0)
#define TIM2_CNT_CNT_MASK                       (0xFFFFFFFFU << TIM2_CNT_CNT_SHIFT)
#define TIM2_CNT_CNT(x)                         (((uint32_t)(((uint32_t)(x)) << TIM2_CNT_CNT_SHIFT)) & TIM2_CNT_CNT_MASK)

/*!
 * @brief TIM2_PSC Register Bit Definition
 */

#define TIM2_PSC_PSC_SHIFT                      (0)
#define TIM2_PSC_PSC_MASK                       (0xFFFFU << TIM2_PSC_PSC_SHIFT)
#define TIM2_PSC_PSC(x)                         (((uint32_t)(((uint32_t)(x)) << TIM2_PSC_PSC_SHIFT)) & TIM2_PSC_PSC_MASK)

/*!
 * @brief TIM2_ARR Register Bit Definition
 */

#define TIM2_ARR_ARR_SHIFT                      (0)
#define TIM2_ARR_ARR_MASK                       (0xFFFFFFFFU << TIM2_ARR_ARR_SHIFT)
#define TIM2_ARR_ARR(x)                         (((uint32_t)(((uint32_t)(x)) << TIM2_ARR_ARR_SHIFT)) & TIM2_ARR_ARR_MASK)

/*!
 * @brief TIM2_CCR1 Register Bit Definition
 */

#define TIM2_CCR1_CCR1_SHIFT                    (0)
#define TIM2_CCR1_CCR1_MASK                     (0xFFFFFFFFU << TIM2_CCR1_CCR1_SHIFT)
#define TIM2_CCR1_CCR1(x)                       (((uint32_t)(((uint32_t)(x)) << TIM2_CCR1_CCR1_SHIFT)) & TIM2_CCR1_CCR1_MASK)

/*!
 * @brief TIM2_CCR2 Register Bit Definition
 */

