UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define TIM3_SR_CC3IF_SHIFT                     (3)
#define TIM3_SR_CC3IF_MASK                      (0x1U << TIM3_SR_CC3IF_SHIFT)
#define TIM3_SR_CC3IF(x)                        (((uint32_t)(((uint32_t)(x)) << TIM3_SR_CC3IF_SHIFT)) & TIM3_SR_CC3IF_MASK)

#define TIM3_SR_CC2IF_SHIFT                     (2)
#define TIM3_SR_CC2IF_MASK                      (0x1U << TIM3_SR_CC2IF_SHIFT)
#define TIM3_SR_CC2IF(x)                        (((uint32_t)(((uint32_t)(x)) << TIM3_SR_CC2IF_SHIFT)) & TIM3_SR_CC2IF_MASK)

#define TIM3_SR_CC1IF_SHIFT                     (1)
#define TIM3_SR_CC1IF_MASK                      (0x1U << TIM3_SR_CC1IF_SHIFT)
#define TIM3_SR_CC1IF(x)                        (((uint32_t)(((uint32_t)(x)) << TIM3_SR_CC1IF_SHIFT)) & TIM3_SR_CC1IF_MASK)

#define TIM3_SR_UIF_SHIFT                       (0)
#define TIM3_SR_UIF_MASK                        (0x1U << TIM3_SR_UIF_SHIFT)
#define TIM3_SR_UIF(x)                          (((uint32_t)(((uint32_t)(x)) << TIM3_SR_UIF_SHIFT)) & TIM3_SR_UIF_MASK)

/*!
 * @brief TIM3_EGR Register Bit Definition
 */

#define TIM3_EGR_TG_SHIFT                       (6)
#define TIM3_EGR_TG_MASK                        (0x1U << TIM3_EGR_TG_SHIFT)
#define TIM3_EGR_TG(x)                          (((uint32_t)(((uint32_t)(x)) << TIM3_EGR_TG_SHIFT)) & TIM3_EGR_TG_MASK)

#define TIM3_EGR_CC4G_SHIFT                     (4)
#define TIM3_EGR_CC4G_MASK                      (0x1U << TIM3_EGR_CC4G_SHIFT)
#define TIM3_EGR_CC4G(x)                        (((uint32_t)(((uint32_t)(x)) << TIM3_EGR_CC4G_SHIFT)) & TIM3_EGR_CC4G_MASK)

#define TIM3_EGR_CC3G_SHIFT                     (3)
#define TIM3_EGR_CC3G_MASK                      (0x1U << TIM3_EGR_CC3G_SHIFT)
#define TIM3_EGR_CC3G(x)                        (((uint32_t)(((uint32_t)(x)) << TIM3_EGR_CC3G_SHIFT)) & TIM3_EGR_CC3G_MASK)

#define TIM3_EGR_CC2G_SHIFT                     (2)
#define TIM3_EGR_CC2G_MASK                      (0x1U << TIM3_EGR_CC2G_SHIFT)
#define TIM3_EGR_CC2G(x)                        (((uint32_t)(((uint32_t)(x)) << TIM3_EGR_CC2G_SHIFT)) & TIM3_EGR_CC2G_MASK)

#define TIM3_EGR_CC1G_SHIFT                     (1)
#define TIM3_EGR_CC1G_MASK                      (0x1U << TIM3_EGR_CC1G_SHIFT)
#define TIM3_EGR_CC1G(x)                        (((uint32_t)(((uint32_t)(x)) << TIM3_EGR_CC1G_SHIFT)) & TIM3_EGR_CC1G_MASK)

#define TIM3_EGR_UG_SHIFT                       (0)
#define TIM3_EGR_UG_MASK                        (0x1U << TIM3_EGR_UG_SHIFT)
#define TIM3_EGR_UG(x)                          (((uint32_t)(((uint32_t)(x)) << TIM3_EGR_UG_SHIFT)) & TIM3_EGR_UG_MASK)

/*!
 * @brief TIM3_CCMR1_OUTPUT Register Bit Definition
 */

#define TIM3_CCMR1OUTPUT_OC2CE_SHIFT            (15)
#define TIM3_CCMR1OUTPUT_OC2CE_MASK             (0x1U << TIM3_CCMR1OUTPUT_OC2CE_SHIFT)
#define TIM3_CCMR1OUTPUT_OC2CE(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1OUTPUT_OC2CE_SHIFT)) & TIM3_CCMR1OUTPUT_OC2CE_MASK)

#define TIM3_CCMR1OUTPUT_OC2M_SHIFT             (12)
#define TIM3_CCMR1OUTPUT_OC2M_MASK              (0x7U << TIM3_CCMR1OUTPUT_OC2M_SHIFT)
#define TIM3_CCMR1OUTPUT_OC2M(x)                (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1OUTPUT_OC2M_SHIFT)) & TIM3_CCMR1OUTPUT_OC2M_MASK)

#define TIM3_CCMR1OUTPUT_OC2PE_SHIFT            (11)
#define TIM3_CCMR1OUTPUT_OC2PE_MASK             (0x1U << TIM3_CCMR1OUTPUT_OC2PE_SHIFT)
#define TIM3_CCMR1OUTPUT_OC2PE(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1OUTPUT_OC2PE_SHIFT)) & TIM3_CCMR1OUTPUT_OC2PE_MASK)

#define TIM3_CCMR1OUTPUT_OC2FE_SHIFT            (10)
#define TIM3_CCMR1OUTPUT_OC2FE_MASK             (0x1U << TIM3_CCMR1OUTPUT_OC2FE_SHIFT)
#define TIM3_CCMR1OUTPUT_OC2FE(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1OUTPUT_OC2FE_SHIFT)) & TIM3_CCMR1OUTPUT_OC2FE_MASK)

#define TIM3_CCMR1OUTPUT_CC2S_SHIFT             (8)
#define TIM3_CCMR1OUTPUT_CC2S_MASK              (0x3U << TIM3_CCMR1OUTPUT_CC2S_SHIFT)
#define TIM3_CCMR1OUTPUT_CC2S(x)                (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1OUTPUT_CC2S_SHIFT)) & TIM3_CCMR1OUTPUT_CC2S_MASK)

#define TIM3_CCMR1OUTPUT_OC1CE_SHIFT            (7)
#define TIM3_CCMR1OUTPUT_OC1CE_MASK             (0x1U << TIM3_CCMR1OUTPUT_OC1CE_SHIFT)
#define TIM3_CCMR1OUTPUT_OC1CE(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1OUTPUT_OC1CE_SHIFT)) & TIM3_CCMR1OUTPUT_OC1CE_MASK)

#define TIM3_CCMR1OUTPUT_OC1M_SHIFT             (4)
#define TIM3_CCMR1OUTPUT_OC1M_MASK              (0x7U << TIM3_CCMR1OUTPUT_OC1M_SHIFT)
#define TIM3_CCMR1OUTPUT_OC1M(x)                (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1OUTPUT_OC1M_SHIFT)) & TIM3_CCMR1OUTPUT_OC1M_MASK)

#define TIM3_CCMR1OUTPUT_OC1PE_SHIFT            (3)
#define TIM3_CCMR1OUTPUT_OC1PE_MASK             (0x1U << TIM3_CCMR1OUTPUT_OC1PE_SHIFT)
#define TIM3_CCMR1OUTPUT_OC1PE(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1OUTPUT_OC1PE_SHIFT)) & TIM3_CCMR1OUTPUT_OC1PE_MASK)

#define TIM3_CCMR1OUTPUT_OC1FE_SHIFT            (2)
#define TIM3_CCMR1OUTPUT_OC1FE_MASK             (0x1U << TIM3_CCMR1OUTPUT_OC1FE_SHIFT)
#define TIM3_CCMR1OUTPUT_OC1FE(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1OUTPUT_OC1FE_SHIFT)) & TIM3_CCMR1OUTPUT_OC1FE_MASK)

#define TIM3_CCMR1OUTPUT_CC1S_SHIFT             (0)
#define TIM3_CCMR1OUTPUT_CC1S_MASK              (0x3U << TIM3_CCMR1OUTPUT_CC1S_SHIFT)
#define TIM3_CCMR1OUTPUT_CC1S(x)                (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1OUTPUT_CC1S_SHIFT)) & TIM3_CCMR1OUTPUT_CC1S_MASK)

/*!
 * @brief TIM3_CCMR1_INPUT Register Bit Definition
 */

#define TIM3_CCMR1INPUT_IC2F_SHIFT              (12)
#define TIM3_CCMR1INPUT_IC2F_MASK               (0xFU << TIM3_CCMR1INPUT_IC2F_SHIFT)
#define TIM3_CCMR1INPUT_IC2F(x)                 (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1INPUT_IC2F_SHIFT)) & TIM3_CCMR1INPUT_IC2F_MASK)

#define TIM3_CCMR1INPUT_IC2PSC_SHIFT            (10)
#define TIM3_CCMR1INPUT_IC2PSC_MASK             (0x3U << TIM3_CCMR1INPUT_IC2PSC_SHIFT)
#define TIM3_CCMR1INPUT_IC2PSC(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1INPUT_IC2PSC_SHIFT)) & TIM3_CCMR1INPUT_IC2PSC_MASK)

#define TIM3_CCMR1INPUT_CC2S_SHIFT              (8)
#define TIM3_CCMR1INPUT_CC2S_MASK               (0x3U << TIM3_CCMR1INPUT_CC2S_SHIFT)
#define TIM3_CCMR1INPUT_CC2S(x)                 (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1INPUT_CC2S_SHIFT)) & TIM3_CCMR1INPUT_CC2S_MASK)

#define TIM3_CCMR1INPUT_IC1F_SHIFT              (4)
#define TIM3_CCMR1INPUT_IC1F_MASK               (0xFU << TIM3_CCMR1INPUT_IC1F_SHIFT)
#define TIM3_CCMR1INPUT_IC1F(x)                 (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1INPUT_IC1F_SHIFT)) & TIM3_CCMR1INPUT_IC1F_MASK)

#define TIM3_CCMR1INPUT_IC1PSC_SHIFT            (2)
#define TIM3_CCMR1INPUT_IC1PSC_MASK             (0x3U << TIM3_CCMR1INPUT_IC1PSC_SHIFT)
#define TIM3_CCMR1INPUT_IC1PSC(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1INPUT_IC1PSC_SHIFT)) & TIM3_CCMR1INPUT_IC1PSC_MASK)

#define TIM3_CCMR1INPUT_CC1S_SHIFT              (0)
#define TIM3_CCMR1INPUT_CC1S_MASK               (0x3U << TIM3_CCMR1INPUT_CC1S_SHIFT)
#define TIM3_CCMR1INPUT_CC1S(x)                 (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1INPUT_CC1S_SHIFT)) & TIM3_CCMR1INPUT_CC1S_MASK)

/*!
 * @brief TIM3_CCMR2_OUTPUT Register Bit Definition
 */

#define TIM3_CCMR2OUTPUT_OC4CE_SHIFT            (15)
#define TIM3_CCMR2OUTPUT_OC4CE_MASK             (0x1U << TIM3_CCMR2OUTPUT_OC4CE_SHIFT)
#define TIM3_CCMR2OUTPUT_OC4CE(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2OUTPUT_OC4CE_SHIFT)) & TIM3_CCMR2OUTPUT_OC4CE_MASK)

#define TIM3_CCMR2OUTPUT_OC4M_SHIFT             (12)
#define TIM3_CCMR2OUTPUT_OC4M_MASK              (0x7U << TIM3_CCMR2OUTPUT_OC4M_SHIFT)
#define TIM3_CCMR2OUTPUT_OC4M(x)                (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2OUTPUT_OC4M_SHIFT)) & TIM3_CCMR2OUTPUT_OC4M_MASK)

#define TIM3_CCMR2OUTPUT_OC4PE_SHIFT            (11)
#define TIM3_CCMR2OUTPUT_OC4PE_MASK             (0x1U << TIM3_CCMR2OUTPUT_OC4PE_SHIFT)
#define TIM3_CCMR2OUTPUT_OC4PE(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2OUTPUT_OC4PE_SHIFT)) & TIM3_CCMR2OUTPUT_OC4PE_MASK)

#define TIM3_CCMR2OUTPUT_OC4FE_SHIFT            (10)
#define TIM3_CCMR2OUTPUT_OC4FE_MASK             (0x1U << TIM3_CCMR2OUTPUT_OC4FE_SHIFT)
#define TIM3_CCMR2OUTPUT_OC4FE(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2OUTPUT_OC4FE_SHIFT)) & TIM3_CCMR2OUTPUT_OC4FE_MASK)

