UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d.h
#define TIM3_PSC_PSC_SHIFT                      (0)
#define TIM3_PSC_PSC_MASK                       (0xFFFFU << TIM3_PSC_PSC_SHIFT)
#define TIM3_PSC_PSC(x)                         (((uint32_t)(((uint32_t)(x)) << TIM3_PSC_PSC_SHIFT)) & TIM3_PSC_PSC_MASK)

/*!
 * @brief TIM3_ARR Register Bit Definition
 */

#define TIM3_ARR_ARR_SHIFT                      (0)
#define TIM3_ARR_ARR_MASK                       (0xFFFFU << TIM3_ARR_ARR_SHIFT)
#define TIM3_ARR_ARR(x)                         (((uint32_t)(((uint32_t)(x)) << TIM3_ARR_ARR_SHIFT)) & TIM3_ARR_ARR_MASK)

/*!
 * @brief TIM3_CCR1 Register Bit Definition
 */

#define TIM3_CCR1_CCR1_SHIFT                    (0)
#define TIM3_CCR1_CCR1_MASK                     (0xFFFFU << TIM3_CCR1_CCR1_SHIFT)
#define TIM3_CCR1_CCR1(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCR1_CCR1_SHIFT)) & TIM3_CCR1_CCR1_MASK)

/*!
 * @brief TIM3_CCR2 Register Bit Definition
 */

#define TIM3_CCR2_CCR2_SHIFT                    (0)
#define TIM3_CCR2_CCR2_MASK                     (0xFFFFU << TIM3_CCR2_CCR2_SHIFT)
#define TIM3_CCR2_CCR2(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCR2_CCR2_SHIFT)) & TIM3_CCR2_CCR2_MASK)

/*!
 * @brief TIM3_CCR3 Register Bit Definition
 */

#define TIM3_CCR3_CCR3_SHIFT                    (0)
#define TIM3_CCR3_CCR3_MASK                     (0xFFFFU << TIM3_CCR3_CCR3_SHIFT)
#define TIM3_CCR3_CCR3(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCR3_CCR3_SHIFT)) & TIM3_CCR3_CCR3_MASK)

/*!
 * @brief TIM3_CCR4 Register Bit Definition
 */

#define TIM3_CCR4_CCR4_SHIFT                    (0)
#define TIM3_CCR4_CCR4_MASK                     (0xFFFFU << TIM3_CCR4_CCR4_SHIFT)
#define TIM3_CCR4_CCR4(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCR4_CCR4_SHIFT)) & TIM3_CCR4_CCR4_MASK)

/*!
 * @brief TIM3_DCR Register Bit Definition
 */

#define TIM3_DCR_DBL_SHIFT                      (8)
#define TIM3_DCR_DBL_MASK                       (0x1FU << TIM3_DCR_DBL_SHIFT)
#define TIM3_DCR_DBL(x)                         (((uint32_t)(((uint32_t)(x)) << TIM3_DCR_DBL_SHIFT)) & TIM3_DCR_DBL_MASK)

#define TIM3_DCR_DBA_SHIFT                      (0)
#define TIM3_DCR_DBA_MASK                       (0x1FU << TIM3_DCR_DBA_SHIFT)
#define TIM3_DCR_DBA(x)                         (((uint32_t)(((uint32_t)(x)) << TIM3_DCR_DBA_SHIFT)) & TIM3_DCR_DBA_MASK)

/*!
 * @brief TIM3_DMAR Register Bit Definition
 */

#define TIM3_DMAR_DMAB_SHIFT                    (0)
#define TIM3_DMAR_DMAB_MASK                     (0xFFFFU << TIM3_DMAR_DMAB_SHIFT)
#define TIM3_DMAR_DMAB(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_DMAR_DMAB_SHIFT)) & TIM3_DMAR_DMAB_MASK)

/*!
 * @brief TIM3_OR Register Bit Definition
 */

#define TIM3_OR_TI4RMP_SHIFT                    (6)
#define TIM3_OR_TI4RMP_MASK                     (0x3U << TIM3_OR_TI4RMP_SHIFT)
#define TIM3_OR_TI4RMP(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_OR_TI4RMP_SHIFT)) & TIM3_OR_TI4RMP_MASK)

#define TIM3_OR_ETRRMP_SHIFT                    (0)
#define TIM3_OR_ETRRMP_MASK                     (0x3U << TIM3_OR_ETRRMP_SHIFT)
#define TIM3_OR_ETRRMP(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_OR_ETRRMP_SHIFT)) & TIM3_OR_ETRRMP_MASK)

/*!
 * @}
 */ /* end of group TIM3_Register_Masks */
/******************************************************************************
 *TIM3 Instance
*******************************************************************************/

#define TIM3                 ((TIM3_Type*)TIM3_BASE)

/*!
 * @}
 */ /* end of group TIM3_Peripheral_Access_Layer */



/*!
 * @addtogroup UART_Peripheral_Access_Layer UART Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * UART Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t TDR;                                                          ///< UART Transmission Data Register              offset: 0x00
    __IO uint32_t RDR;                                                          ///< UART Receipt Data Register                   offset: 0x04
    __IO uint32_t CSR;                                                          ///< UART Current Status Register                 offset: 0x08
    __IO uint32_t ISR;                                                          ///< UART Interrupt Status Register               offset: 0x0C
    __IO uint32_t IER;                                                          ///< UART Interrupt Enable Register               offset: 0x10
    __IO uint32_t ICR;                                                          ///< UART Interrupt Clear Register                offset: 0x14
    __IO uint32_t GCR;                                                          ///< UART Global Control Register                 offset: 0x18
    __IO uint32_t CCR;                                                          ///< UART Universal Control Register              offset: 0x1C
    __IO uint32_t BRR;                                                          ///< UART Baud Rate Register                      offset: 0x20
    __IO uint32_t FRA;                                                          ///< UART Fraction Baud Rate Register             offset: 0x24
    __IO uint32_t RXADDR;                                                       ///< UART Receipt Address Register                offset: 0x28
    __IO uint32_t RXMASK;                                                       ///< UART Receipt Mask Register                   offset: 0x2C
    __IO uint32_t SCR;                                                          ///< UART SCR Register                            offset: 0x30
    __IO uint32_t IDLR;                                                         ///< UART Idle Data Length Register               offset: 0x34
    __IO uint32_t ABRCR;                                                        ///< UART Auto Baud Rate Control Register         offset: 0x38
    __IO uint32_t IRDA;                                                         ///< UART Infrared Function Control Register      offset: 0x3C
} UART_Type;

